# Quansheng UV-K5 driver (c) 2023 Jacek Lipkowski <sq5bpf@lipkowski.org>
# Modified for Full Chinese Firmware by hank9999
#
# based on template.py Copyright 2012 Dan Smith <dsmith@danplanet.com>
#
#
# This is a preliminary version of a driver for the UV-K5
# It is based on my reverse engineering effort described here:
# https://github.com/sq5bpf/uvk5-reverse-engineering
#
# Warning: this driver is experimental, it may brick your radio,
# eat your lunch and mess up your configuration.
#
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 2 of the License, or
# (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program.  If not, see <http://www.gnu.org/licenses/>.


import struct
import logging

from chirp import chirp_common, directory, bitwise, memmap, errors, util
from chirp.settings import RadioSetting, RadioSettingGroup, \
    RadioSettingValueBoolean, RadioSettingValueList, \
    RadioSettingValueInteger, RadioSettingValueString, \
    RadioSettings

LOG = logging.getLogger(__name__)

# Show the obfuscated version of commands. Not needed normally, but
# might be useful for someone who is debugging a similar radio
DEBUG_SHOW_OBFUSCATED_COMMANDS = False

# Show the memory being written/received. Not needed normally, because
# this is the same information as in the packet hexdumps, but
# might be useful for someone debugging some obscure memory issue
DEBUG_SHOW_MEMORY_ACTIONS = False

MEM_FORMAT = """
#seekto 0x0000;
struct {
  ul32 freq;
  ul32 offset;
  u8 rxcode;
  u8 txcode;

  u8 unknown1:2,
  txcodeflag:2,
  unknown2:2,
  rxcodeflag:2;

  //u8 flags1;
  u8 flags1_unknown7:1,
  flags1_unknown6:1,
  flags1_unknown5:1,
  enable_am:1,
  flags1_unknown3:1,
  is_in_scanlist:1,
  shift:2;

  //u8 flags2;
  u8 flags2_unknown7:1,
  flags2_unknown6:1,
  flags2_unknown5:1,
  bclo:1,
  txpower:2,
  bandwidth:1,
  freq_reverse:1;

  //u8 dtmf_flags;
  u8 dtmf_flags_unknown7:1,
  dtmf_flags_unknown6:1,
  dtmf_flags_unknown5:1,
  dtmf_flags_unknown4:1,
  dtmf_flags_unknown3:1,
  dtmf_pttid:2,
  dtmf_decode:1;


  u8 step;
  u8 scrambler;
} channel[214];

#seekto 0xd60;
struct {
u8 is_scanlist1:1,
is_scanlist2:1,
unknown1:1,
unknown2:1,
is_free:1,
band:3;
} channel_attributes[200];

#seekto 0xe40;
ul16 fmfreq[20];

#seekto 0xe70;
u8 call_channel;
u8 squelch;
u8 max_talk_time;
u8 noaa_autoscan;
u8 key_lock;
u8 vox_switch;
u8 vox_level;
u8 mic_gain;
u8 unknown3;
u8 channel_display_mode;
u8 crossband;
u8 battery_save;
u8 dual_watch;
u8 backlight_auto_mode;
u8 tail_note_elimination;
u8 vfo_open;

#seekto 0xe90;
u8 beep_control;
u8 key1_shortpress_action;
u8 key1_longpress_action;
u8 key2_shortpress_action;
u8 key2_longpress_action;
u8 scan_resume_mode;
u8 auto_keypad_lock;
u8 power_on_dispmode;
u8 password[4];

#seekto 0xea0;
u8 keypad_tone;
u8 language;

#seekto 0xea8;
u8 alarm_mode;
u8 reminding_of_end_talk;
u8 repeater_tail_elimination;

#seekto 0xeb0;
char logo_line1[16];
char logo_line2[16];

#seekto 0xed0;
struct {
u8 side_tone;
char separate_code;
char group_call_code;
u8 decode_response;
u8 auto_reset_time;
u8 preload_time;
u8 first_code_persist_time;
u8 hash_persist_time;
u8 code_persist_time;
u8 code_interval_time;
u8 permit_remote_kill;
} dtmf_settings;

#seekto 0xee0;
struct {
char dtmf_local_code[3];
char unused1[5];
char kill_code[5];
char unused2[3];
char revive_code[5];
char unused3[3];
char dtmf_up_code[16];
char dtmf_down_code[16];
} dtmf_settings_numbers;

#seekto 0xf18;
u8 scanlist_default;
u8 scanlist1_priority_scan;
u8 scanlist1_priority_ch1;
u8 scanlist1_priority_ch2;
u8 scanlist2_priority_scan;
u8 scanlist2_priority_ch1;
u8 scanlist2_priority_ch2;
u8 scanlist_unknown_0xff;


#seekto 0xf40;
struct {
u8 flock;
u8 tx350;
u8 killed;
u8 tx200;
u8 tx500;
u8 en350;
u8 enscramble;
} lock;

#seekto 0xf50;
struct {
char name[16];
} channelname[200];

#seekto 0x1c00;
struct {
char name[8];
char number[3];
char unused_00[5];
} dtmfcontact[16];

#seekto 0x1ed0;
struct {
struct {
    u8 start;
    u8 mid;
    u8 end;
} low;
struct {
    u8 start;
    u8 mid;
    u8 end;
} medium;
struct {
    u8 start;
    u8 mid;
    u8 end;
} high;
u8 unused_00[7];
} perbandpowersettings[7];

#seekto 0x1f40;
ul16 battery_level[6];
"""
# bits that we will save from the channel structure (mostly unknown)
SAVE_MASK_0A = 0b11001100
SAVE_MASK_0B = 0b11101100
SAVE_MASK_0C = 0b11100000
SAVE_MASK_0D = 0b11111000
SAVE_MASK_0E = 0b11110001
SAVE_MASK_0F = 0b11110000

# flags1
FLAGS1_OFFSET_NONE = 0b00
FLAGS1_OFFSET_MINUS = 0b10
FLAGS1_OFFSET_PLUS = 0b01

POWER_HIGH = 0b10
POWER_MEDIUM = 0b01
POWER_LOW = 0b00

# dtmf_flags
PTTID_LIST = ["off", "BOT", "EOT", "BOTH"]

# power
UVK5_POWER_LEVELS = [chirp_common.PowerLevel("Low",  watts=1.50),
                     chirp_common.PowerLevel("Med",  watts=3.00),
                     chirp_common.PowerLevel("High", watts=5.00),
                     ]

# scrambler
SCRAMBLER_LIST = ["off", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"]

# channel display mode
CHANNELDISP_LIST = ["Frequency", "Channel No", "Channel Name"]
# battery save
BATSAVE_LIST = ["OFF", "1:1", "1:2", "1:3", "1:4"]

# Backlight auto mode
BACKLIGHT_LIST = ["Off", "1s", "2s", "3s", "4s", "5s"]

# Crossband receiving/transmitting
CROSSBAND_LIST = ["Off", "Band A", "Band B"]
DUALWATCH_LIST = CROSSBAND_LIST

# steps
STEPS = [2.5, 5.0, 6.25, 10.0, 12.5, 25.0, 8.33]

# ctcss/dcs codes
TMODES = ["", "Tone", "DTCS", "DTCS"]
TONE_NONE = 0
TONE_CTCSS = 1
TONE_DCS = 2
TONE_RDCS = 3


CTCSS_TONES = [
    67.0, 69.3, 71.9, 74.4, 77.0, 79.7, 82.5, 85.4,
    88.5, 91.5, 94.8, 97.4, 100.0, 103.5, 107.2, 110.9,
    114.8, 118.8, 123.0, 127.3, 131.8, 136.5, 141.3, 146.2,
    151.4, 156.7, 159.8, 162.2, 165.5, 167.9, 171.3, 173.8,
    177.3, 179.9, 183.5, 186.2, 189.9, 192.8, 196.6, 199.5,
    203.5, 206.5, 210.7, 218.1, 225.7, 229.1, 233.6, 241.8,
    250.3, 254.1
]

# lifted from ft4.py
DTCS_CODES = [
    23,  25,  26,  31,  32,  36,  43,  47,  51,  53,  54,
    65,  71,  72,  73,  74,  114, 115, 116, 122, 125, 131,
    132, 134, 143, 145, 152, 155, 156, 162, 165, 172, 174,
    205, 212, 223, 225, 226, 243, 244, 245, 246, 251, 252,
    255, 261, 263, 265, 266, 271, 274, 306, 311, 315, 325,
    331, 332, 343, 346, 351, 356, 364, 365, 371, 411, 412,
    413, 423, 431, 432, 445, 446, 452, 454, 455, 462, 464,
    465, 466, 503, 506, 516, 523, 526, 532, 546, 565, 606,
    612, 624, 627, 631, 632, 654, 662, 664, 703, 712, 723,
    731, 732, 734, 743, 754
]

FLOCK_LIST = ["Off", "FCC", "CE", "GB", "430", "438"]

SCANRESUME_LIST = ["TO: Resume after 5 seconds",
                   "CO: Resume after signal disappears",
                   "SE: Stop scanning after receiving a signal"]

WELCOME_LIST = ["Full Screen", "Welcome Info", "Voltage"]
KEYPADTONE_LIST = ["Off", "Chinese", "English"]
LANGUAGE_LIST = ["Chinese", "English"]
ALARMMODE_LIST = ["SITE", "TONE"]
REMENDOFTALK_LIST = ["Off", "ROGER", "MDC"]
RTE_LIST = ["Off", "100ms", "200ms", "300ms", "400ms",
            "500ms", "600ms", "700ms", "800ms", "900ms"]

MEM_SIZE = 0x2000  # size of all memory
PROG_SIZE = 0x1d00  # size of the memory that we will write
MEM_BLOCK = 0x80  # largest block of memory that we can reliably write

# fm radio supported frequencies
FMMIN = 76.0
FMMAX = 108.0

# bands supported by the UV-K5
BANDS = {
        0: [50.0, 76.0],
        1: [108.0, 135.9999],
        2: [136.0, 199.9990],
        3: [200.0, 299.9999],
        4: [350.0, 399.9999],
        5: [400.0, 469.9999],
        6: [470.0, 600.0]
        }

# for radios with modified firmware:
BANDS_NOLIMITS = {
        0: [18.0, 76.0],
        1: [108.0, 135.9999],
        2: [136.0, 199.9990],
        3: [200.0, 299.9999],
        4: [350.0, 399.9999],
        5: [400.0, 469.9999],
        6: [470.0, 1300.0]
        }

SPECIALS = {
        "F1(50M-76M)A": 200,
        "F1(50M-76M)B": 201,
        "F2(108M-136M)A": 202,
        "F2(108M-136M)B": 203,
        "F3(136M-174M)A": 204,
        "F3(136M-174M)B": 205,
        "F4(174M-350M)A": 206,
        "F4(174M-350M)B": 207,
        "F5(350M-400M)A": 208,
        "F5(350M-400M)B": 209,
        "F6(400M-470M)A": 210,
        "F6(400M-470M)B": 211,
        "F7(470M-600M)A": 212,
        "F7(470M-600M)B": 213
        }

VFO_CHANNEL_NAMES = ["F1(50M-76M)A", "F1(50M-76M)B",
                     "F2(108M-136M)A", "F2(108M-136M)B",
                     "F3(136M-174M)A", "F3(136M-174M)B",
                     "F4(174M-350M)A", "F4(174M-350M)B",
                     "F5(350M-400M)A", "F5(350M-400M)B",
                     "F6(400M-470M)A", "F6(400M-470M)B",
                     "F7(470M-600M)A", "F7(470M-600M)B"]

SCANLIST_LIST = ["None", "1", "2", "1+2"]

DTMF_CHARS = "0123456789ABCD*# "
DTMF_CHARS_ID = "0123456789ABCDabcd"
DTMF_CHARS_KILL = "0123456789ABCDabcd"
DTMF_CHARS_UPDOWN = "0123456789ABCDabcd#* "
DTMF_CODE_CHARS = "ABCD*# "
DTMF_DECODE_RESPONSE_LIST = ["None", "Ring", "Reply", "Both"]

KEYACTIONS_LIST = ["None", "Flashlight on/off", "Power select",
                   "Monitor", "Scan on/off", "VOX on/off",
                   "Alarm on/off", "FM radio on/off", "Transmit 1750 Hz"]


FONT_MAPPING = {
    "\x80\x01": "一",
    "\x80\x02": "乙",
    "\x80\x03": "二",
    "\x80\x04": "十",
    "\x80\x05": "丁",
    "\x80\x06": "厂",
    "\x80\x07": "七",
    "\x80\x08": "卜",
    "\x80\x09": "八",
    "\x80\x0A": "人",
    "\x80\x0B": "入",
    "\x80\x0C": "乂",
    "\x80\x0D": "儿",
    "\x80\x0E": "九",
    "\x80\x0F": "匕",
    "\x80\x10": "几",
    "\x80\x11": "刁",
    "\x80\x12": "了",
    "\x80\x13": "乃",
    "\x80\x14": "刀",
    "\x80\x15": "力",
    "\x80\x16": "又",
    "\x80\x17": "乜",
    "\x80\x18": "三",
    "\x80\x19": "干",
    "\x80\x1A": "亍",
    "\x80\x1B": "于",
    "\x80\x1C": "亏",
    "\x80\x1D": "士",
    "\x80\x1E": "土",
    "\x80\x1F": "工",
    "\x80\x20": "才",
    "\x80\x21": "下",
    "\x80\x22": "寸",
    "\x80\x23": "丈",
    "\x80\x24": "大",
    "\x80\x25": "兀",
    "\x80\x26": "与",
    "\x80\x27": "万",
    "\x80\x28": "弋",
    "\x80\x29": "上",
    "\x80\x2A": "小",
    "\x80\x2B": "口",
    "\x80\x2C": "山",
    "\x80\x2D": "巾",
    "\x80\x2E": "千",
    "\x80\x2F": "乞",
    "\x80\x30": "川",
    "\x80\x31": "亿",
    "\x80\x32": "彳",
    "\x80\x33": "个",
    "\x80\x34": "么",
    "\x80\x35": "久",
    "\x80\x36": "勺",
    "\x80\x37": "丸",
    "\x80\x38": "夕",
    "\x80\x39": "凡",
    "\x80\x3A": "及",
    "\x80\x3B": "广",
    "\x80\x3C": "亡",
    "\x80\x3D": "门",
    "\x80\x3E": "丫",
    "\x80\x3F": "义",
    "\x80\x40": "之",
    "\x80\x41": "尸",
    "\x80\x42": "已",
    "\x80\x43": "巳",
    "\x80\x44": "弓",
    "\x80\x45": "己",
    "\x80\x46": "卫",
    "\x80\x47": "孑",
    "\x80\x48": "子",
    "\x80\x49": "孓",
    "\x80\x4A": "也",
    "\x80\x4B": "女",
    "\x80\x4C": "飞",
    "\x80\x4D": "刃",
    "\x80\x4E": "习",
    "\x80\x4F": "叉",
    "\x80\x50": "马",
    "\x80\x51": "乡",
    "\x80\x52": "幺",
    "\x80\x53": "丰",
    "\x80\x54": "王",
    "\x80\x55": "井",
    "\x80\x56": "开",
    "\x80\x57": "亓",
    "\x80\x58": "夫",
    "\x80\x59": "天",
    "\x80\x5A": "元",
    "\x80\x5B": "无",
    "\x80\x5C": "韦",
    "\x80\x5D": "云",
    "\x80\x5E": "专",
    "\x80\x5F": "丐",
    "\x80\x60": "扎",
    "\x80\x61": "廿",
    "\x80\x62": "艺",
    "\x80\x63": "木",
    "\x80\x64": "五",
    "\x80\x65": "支",
    "\x80\x66": "厅",
    "\x80\x67": "卅",
    "\x80\x68": "不",
    "\x80\x69": "仄",
    "\x80\x6A": "太",
    "\x80\x6B": "犬",
    "\x80\x6C": "区",
    "\x80\x6D": "历",
    "\x80\x6E": "友",
    "\x80\x6F": "歹",
    "\x80\x70": "尤",
    "\x80\x71": "匹",
    "\x80\x72": "厄",
    "\x80\x73": "车",
    "\x80\x74": "巨",
    "\x80\x75": "牙",
    "\x80\x76": "屯",
    "\x80\x77": "戈",
    "\x80\x78": "比",
    "\x80\x79": "互",
    "\x80\x7A": "切",
    "\x80\x7B": "瓦",
    "\x80\x7C": "止",
    "\x80\x7D": "少",
    "\x80\x7E": "曰",
    "\x80\x7F": "日",
    "\x80\x80": "中",
    "\x80\x81": "贝",
    "\x80\x82": "内",
    "\x80\x83": "水",
    "\x80\x84": "冈",
    "\x80\x85": "见",
    "\x80\x86": "手",
    "\x80\x87": "午",
    "\x80\x88": "牛",
    "\x80\x89": "毛",
    "\x80\x8A": "气",
    "\x80\x8B": "壬",
    "\x80\x8C": "升",
    "\x80\x8D": "夭",
    "\x80\x8E": "长",
    "\x80\x8F": "仁",
    "\x80\x90": "仃",
    "\x80\x91": "什",
    "\x80\x92": "片",
    "\x80\x93": "仆",
    "\x80\x94": "仉",
    "\x80\x95": "化",
    "\x80\x96": "仇",
    "\x80\x97": "币",
    "\x80\x98": "仂",
    "\x80\x99": "仍",
    "\x80\x9A": "仅",
    "\x80\x9B": "斤",
    "\x80\x9C": "爪",
    "\x80\x9D": "反",
    "\x80\x9E": "兮",
    "\x80\x9F": "刈",
    "\x80\xA0": "介",
    "\x80\xA1": "父",
    "\x80\xA2": "爻",
    "\x80\xA3": "从",
    "\x80\xA4": "仑",
    "\x80\xA5": "今",
    "\x80\xA6": "凶",
    "\x80\xA7": "分",
    "\x80\xA8": "乏",
    "\x80\xA9": "公",
    "\x80\xAA": "仓",
    "\x80\xAB": "月",
    "\x80\xAC": "氏",
    "\x80\xAD": "勿",
    "\x80\xAE": "风",
    "\x80\xAF": "欠",
    "\x80\xB0": "丹",
    "\x80\xB1": "匀",
    "\x80\xB2": "乌",
    "\x80\xB3": "勾",
    "\x80\xB4": "殳",
    "\x80\xB5": "凤",
    "\x80\xB6": "卞",
    "\x80\xB7": "六",
    "\x80\xB8": "文",
    "\x80\xB9": "亢",
    "\x80\xBA": "方",
    "\x80\xBB": "闩",
    "\x80\xBC": "火",
    "\x80\xBD": "为",
    "\x80\xBE": "斗",
    "\x80\xBF": "忆",
    "\x80\xC0": "计",
    "\x80\xC1": "订",
    "\x80\xC2": "户",
    "\x80\xC3": "讣",
    "\x80\xC4": "认",
    "\x80\xC5": "讥",
    "\x80\xC6": "冗",
    "\x80\xC7": "心",
    "\x80\xC8": "尹",
    "\x80\xC9": "尺",
    "\x80\xCA": "夬",
    "\x80\xCB": "引",
    "\x80\xCC": "丑",
    "\x80\xCD": "爿",
    "\x80\xCE": "巴",
    "\x80\xCF": "孔",
    "\x80\xD0": "队",
    "\x80\xD1": "办",
    "\x80\xD2": "以",
    "\x80\xD3": "允",
    "\x80\xD4": "邓",
    "\x80\xD5": "予",
    "\x80\xD6": "劝",
    "\x80\xD7": "双",
    "\x80\xD8": "书",
    "\x80\xD9": "毋",
    "\x80\xDA": "幻",
    "\x80\xDB": "玉",
    "\x80\xDC": "刊",
    "\x80\xDD": "末",
    "\x80\xDE": "未",
    "\x80\xDF": "示",
    "\x80\xE0": "击",
    "\x80\xE1": "邗",
    "\x80\xE2": "戋",
    "\x80\xE3": "打",
    "\x80\xE4": "巧",
    "\x80\xE5": "正",
    "\x80\xE6": "扑",
    "\x80\xE7": "卉",
    "\x80\xE8": "扒",
    "\x80\xE9": "邛",
    "\x80\xEA": "功",
    "\x80\xEB": "扔",
    "\x80\xEC": "去",
    "\x80\xED": "甘",
    "\x80\xEE": "世",
    "\x80\xEF": "艾",
    "\x80\xF0": "艽",
    "\x80\xF1": "古",
    "\x80\xF2": "节",
    "\x80\xF3": "艿",
    "\x80\xF4": "本",
    "\x80\xF5": "术",
    "\x80\xF6": "札",
    "\x80\xF7": "可",
    "\x80\xF8": "叵",
    "\x80\xF9": "匝",
    "\x80\xFA": "丙",
    "\x80\xFB": "左",
    "\x80\xFC": "厉",
    "\x80\xFD": "丕",
    "\x80\xFE": "石",
    "\x80\xFF": "右",
    "\x81\x01": "布",
    "\x81\x02": "夯",
    "\x81\x03": "龙",
    "\x81\x04": "戊",
    "\x81\x05": "平",
    "\x81\x06": "灭",
    "\x81\x07": "轧",
    "\x81\x08": "东",
    "\x81\x09": "匜",
    "\x81\x0A": "劢",
    "\x81\x0B": "卡",
    "\x81\x0C": "北",
    "\x81\x0D": "占",
    "\x81\x0E": "凸",
    "\x81\x0F": "卢",
    "\x81\x10": "业",
    "\x81\x11": "旧",
    "\x81\x12": "帅",
    "\x81\x13": "归",
    "\x81\x14": "目",
    "\x81\x15": "旦",
    "\x81\x16": "且",
    "\x81\x17": "叮",
    "\x81\x18": "叶",
    "\x81\x19": "甲",
    "\x81\x1A": "申",
    "\x81\x1B": "号",
    "\x81\x1C": "电",
    "\x81\x1D": "田",
    "\x81\x1E": "由",
    "\x81\x1F": "卟",
    "\x81\x20": "叭",
    "\x81\x21": "只",
    "\x81\x22": "央",
    "\x81\x23": "史",
    "\x81\x24": "叱",
    "\x81\x25": "叽",
    "\x81\x26": "兄",
    "\x81\x27": "叼",
    "\x81\x28": "叩",
    "\x81\x29": "叫",
    "\x81\x2A": "叻",
    "\x81\x2B": "叨",
    "\x81\x2C": "另",
    "\x81\x2D": "叹",
    "\x81\x2E": "冉",
    "\x81\x2F": "皿",
    "\x81\x30": "凹",
    "\x81\x31": "囚",
    "\x81\x32": "四",
    "\x81\x33": "生",
    "\x81\x34": "失",
    "\x81\x35": "矢",
    "\x81\x36": "氕",
    "\x81\x37": "乍",
    "\x81\x38": "禾",
    "\x81\x39": "仨",
    "\x81\x3A": "仕",
    "\x81\x3B": "丘",
    "\x81\x3C": "付",
    "\x81\x3D": "仗",
    "\x81\x3E": "代",
    "\x81\x3F": "仙",
    "\x81\x40": "仟",
    "\x81\x41": "仡",
    "\x81\x42": "仫",
    "\x81\x43": "伋",
    "\x81\x44": "们",
    "\x81\x45": "仪",
    "\x81\x46": "白",
    "\x81\x47": "仔",
    "\x81\x48": "他",
    "\x81\x49": "仞",
    "\x81\x4A": "斥",
    "\x81\x4B": "卮",
    "\x81\x4C": "瓜",
    "\x81\x4D": "乎",
    "\x81\x4E": "丛",
    "\x81\x4F": "令",
    "\x81\x50": "用",
    "\x81\x51": "甩",
    "\x81\x52": "印",
    "\x81\x53": "氐",
    "\x81\x54": "乐",
    "\x81\x55": "尔",
    "\x81\x56": "句",
    "\x81\x57": "匆",
    "\x81\x58": "犰",
    "\x81\x59": "册",
    "\x81\x5A": "卯",
    "\x81\x5B": "犯",
    "\x81\x5C": "外",
    "\x81\x5D": "处",
    "\x81\x5E": "冬",
    "\x81\x5F": "鸟",
    "\x81\x60": "务",
    "\x81\x61": "刍",
    "\x81\x62": "包",
    "\x81\x63": "饥",
    "\x81\x64": "主",
    "\x81\x65": "市",
    "\x81\x66": "庀",
    "\x81\x67": "邝",
    "\x81\x68": "立",
    "\x81\x69": "冯",
    "\x81\x6A": "邙",
    "\x81\x6B": "玄",
    "\x81\x6C": "闪",
    "\x81\x6D": "兰",
    "\x81\x6E": "半",
    "\x81\x6F": "汀",
    "\x81\x70": "汁",
    "\x81\x71": "汇",
    "\x81\x72": "头",
    "\x81\x73": "汈",
    "\x81\x74": "汉",
    "\x81\x75": "忉",
    "\x81\x76": "宁",
    "\x81\x77": "穴",
    "\x81\x78": "宄",
    "\x81\x79": "它",
    "\x81\x7A": "讦",
    "\x81\x7B": "讧",
    "\x81\x7C": "讨",
    "\x81\x7D": "写",
    "\x81\x7E": "让",
    "\x81\x7F": "礼",
    "\x81\x80": "讪",
    "\x81\x81": "讫",
    "\x81\x82": "训",
    "\x81\x83": "必",
    "\x81\x84": "议",
    "\x81\x85": "讯",
    "\x81\x86": "记",
    "\x81\x87": "永",
    "\x81\x88": "司",
    "\x81\x89": "尻",
    "\x81\x8A": "尼",
    "\x81\x8B": "民",
    "\x81\x8C": "弗",
    "\x81\x8D": "弘",
    "\x81\x8E": "阢",
    "\x81\x8F": "出",
    "\x81\x90": "阡",
    "\x81\x91": "辽",
    "\x81\x92": "奶",
    "\x81\x93": "奴",
    "\x81\x94": "尕",
    "\x81\x95": "加",
    "\x81\x96": "召",
    "\x81\x97": "皮",
    "\x81\x98": "边",
    "\x81\x99": "孕",
    "\x81\x9A": "发",
    "\x81\x9B": "圣",
    "\x81\x9C": "对",
    "\x81\x9D": "弁",
    "\x81\x9E": "台",
    "\x81\x9F": "矛",
    "\x81\xA0": "纠",
    "\x81\xA1": "驭",
    "\x81\xA2": "母",
    "\x81\xA3": "幼",
    "\x81\xA4": "丝",
    "\x81\xA5": "匡",
    "\x81\xA6": "耒",
    "\x81\xA7": "邦",
    "\x81\xA8": "玎",
    "\x81\xA9": "玑",
    "\x81\xAA": "式",
    "\x81\xAB": "迂",
    "\x81\xAC": "刑",
    "\x81\xAD": "邢",
    "\x81\xAE": "戎",
    "\x81\xAF": "动",
    "\x81\xB0": "圩",
    "\x81\xB1": "圬",
    "\x81\xB2": "圭",
    "\x81\xB3": "扛",
    "\x81\xB4": "寺",
    "\x81\xB5": "吉",
    "\x81\xB6": "扣",
    "\x81\xB7": "扦",
    "\x81\xB8": "圪",
    "\x81\xB9": "考",
    "\x81\xBA": "托",
    "\x81\xBB": "圳",
    "\x81\xBC": "老",
    "\x81\xBD": "圾",
    "\x81\xBE": "巩",
    "\x81\xBF": "执",
    "\x81\xC0": "扩",
    "\x81\xC1": "圹",
    "\x81\xC2": "扪",
    "\x81\xC3": "扫",
    "\x81\xC4": "圯",
    "\x81\xC5": "圮",
    "\x81\xC6": "地",
    "\x81\xC7": "扬",
    "\x81\xC8": "场",
    "\x81\xC9": "耳",
    "\x81\xCA": "芋",
    "\x81\xCB": "芏",
    "\x81\xCC": "共",
    "\x81\xCD": "芊",
    "\x81\xCE": "芍",
    "\x81\xCF": "芨",
    "\x81\xD0": "芄",
    "\x81\xD1": "芒",
    "\x81\xD2": "亚",
    "\x81\xD3": "芝",
    "\x81\xD4": "芎",
    "\x81\xD5": "芑",
    "\x81\xD6": "芗",
    "\x81\xD7": "朽",
    "\x81\xD8": "朴",
    "\x81\xD9": "机",
    "\x81\xDA": "权",
    "\x81\xDB": "过",
    "\x81\xDC": "亘",
    "\x81\xDD": "臣",
    "\x81\xDE": "吏",
    "\x81\xDF": "再",
    "\x81\xE0": "协",
    "\x81\xE1": "西",
    "\x81\xE2": "压",
    "\x81\xE3": "厌",
    "\x81\xE4": "厍",
    "\x81\xE5": "戌",
    "\x81\xE6": "在",
    "\x81\xE7": "百",
    "\x81\xE8": "有",
    "\x81\xE9": "存",
    "\x81\xEA": "而",
    "\x81\xEB": "页",
    "\x81\xEC": "匠",
    "\x81\xED": "夸",
    "\x81\xEE": "夺",
    "\x81\xEF": "夼",
    "\x81\xF0": "灰",
    "\x81\xF1": "达",
    "\x81\xF2": "戍",
    "\x81\xF3": "尥",
    "\x81\xF4": "列",
    "\x81\xF5": "死",
    "\x81\xF6": "成",
    "\x81\xF7": "夹",
    "\x81\xF8": "夷",
    "\x81\xF9": "轨",
    "\x81\xFA": "邪",
    "\x81\xFB": "尧",
    "\x81\xFC": "划",
    "\x81\xFD": "迈",
    "\x81\xFE": "毕",
    "\x81\xFF": "至",
    "\x82\x01": "此",
    "\x82\x02": "乩",
    "\x82\x03": "贞",
    "\x82\x04": "师",
    "\x82\x05": "尘",
    "\x82\x06": "尖",
    "\x82\x07": "劣",
    "\x82\x08": "光",
    "\x82\x09": "当",
    "\x82\x0A": "吁",
    "\x82\x0B": "早",
    "\x82\x0C": "吐",
    "\x82\x0D": "吓",
    "\x82\x0E": "旯",
    "\x82\x0F": "曳",
    "\x82\x10": "虫",
    "\x82\x11": "曲",
    "\x82\x12": "团",
    "\x82\x13": "同",
    "\x82\x14": "吕",
    "\x82\x15": "吊",
    "\x82\x16": "吃",
    "\x82\x17": "因",
    "\x82\x18": "吸",
    "\x82\x19": "吗",
    "\x82\x1A": "吆",
    "\x82\x1B": "屿",
    "\x82\x1C": "屹",
    "\x82\x1D": "岌",
    "\x82\x1E": "帆",
    "\x82\x1F": "岁",
    "\x82\x20": "回",
    "\x82\x21": "岂",
    "\x82\x22": "屺",
    "\x82\x23": "则",
    "\x82\x24": "刚",
    "\x82\x25": "网",
    "\x82\x26": "肉",
    "\x82\x27": "凼",
    "\x82\x28": "囝",
    "\x82\x29": "囡",
    "\x82\x2A": "钆",
    "\x82\x2B": "钇",
    "\x82\x2C": "年",
    "\x82\x2D": "朱",
    "\x82\x2E": "缶",
    "\x82\x2F": "氘",
    "\x82\x30": "氖",
    "\x82\x31": "牝",
    "\x82\x32": "先",
    "\x82\x33": "丢",
    "\x82\x34": "廷",
    "\x82\x35": "舌",
    "\x82\x36": "竹",
    "\x82\x37": "迁",
    "\x82\x38": "乔",
    "\x82\x39": "迄",
    "\x82\x3A": "伟",
    "\x82\x3B": "传",
    "\x82\x3C": "乒",
    "\x82\x3D": "乓",
    "\x82\x3E": "休",
    "\x82\x3F": "伍",
    "\x82\x40": "伎",
    "\x82\x41": "伏",
    "\x82\x42": "伛",
    "\x82\x43": "优",
    "\x82\x44": "臼",
    "\x82\x45": "伢",
    "\x82\x46": "伐",
    "\x82\x47": "仳",
    "\x82\x48": "延",
    "\x82\x49": "佤",
    "\x82\x4A": "仲",
    "\x82\x4B": "仵",
    "\x82\x4C": "件",
    "\x82\x4D": "任",
    "\x82\x4E": "伤",
    "\x82\x4F": "伥",
    "\x82\x50": "价",
    "\x82\x51": "伦",
    "\x82\x52": "份",
    "\x82\x53": "伧",
    "\x82\x54": "华",
    "\x82\x55": "仰",
    "\x82\x56": "伉",
    "\x82\x57": "仿",
    "\x82\x58": "伙",
    "\x82\x59": "伪",
    "\x82\x5A": "伫",
    "\x82\x5B": "自",
    "\x82\x5C": "伊",
    "\x82\x5D": "血",
    "\x82\x5E": "向",
    "\x82\x5F": "囟",
    "\x82\x60": "似",
    "\x82\x61": "后",
    "\x82\x62": "行",
    "\x82\x63": "甪",
    "\x82\x64": "舟",
    "\x82\x65": "全",
    "\x82\x66": "会",
    "\x82\x67": "杀",
    "\x82\x68": "合",
    "\x82\x69": "兆",
    "\x82\x6A": "企",
    "\x82\x6B": "汆",
    "\x82\x6C": "氽",
    "\x82\x6D": "众",
    "\x82\x6E": "爷",
    "\x82\x6F": "伞",
    "\x82\x70": "创",
    "\x82\x71": "刖",
    "\x82\x72": "肌",
    "\x82\x73": "肋",
    "\x82\x74": "朵",
    "\x82\x75": "杂",
    "\x82\x76": "夙",
    "\x82\x77": "危",
    "\x82\x78": "旬",
    "\x82\x79": "旭",
    "\x82\x7A": "旮",
    "\x82\x7B": "旨",
    "\x82\x7C": "负",
    "\x82\x7D": "犴",
    "\x82\x7E": "刎",
    "\x82\x7F": "犷",
    "\x82\x80": "匈",
    "\x82\x81": "犸",
    "\x82\x82": "舛",
    "\x82\x83": "各",
    "\x82\x84": "名",
    "\x82\x85": "多",
    "\x82\x86": "凫",
    "\x82\x87": "争",
    "\x82\x88": "邬",
    "\x82\x89": "色",
    "\x82\x8A": "饧",
    "\x82\x8B": "冱",
    "\x82\x8C": "壮",
    "\x82\x8D": "冲",
    "\x82\x8E": "妆",
    "\x82\x8F": "冰",
    "\x82\x90": "庄",
    "\x82\x91": "庆",
    "\x82\x92": "亦",
    "\x82\x93": "刘",
    "\x82\x94": "齐",
    "\x82\x95": "交",
    "\x82\x96": "次",
    "\x82\x97": "衣",
    "\x82\x98": "产",
    "\x82\x99": "决",
    "\x82\x9A": "亥",
    "\x82\x9B": "邡",
    "\x82\x9C": "充",
    "\x82\x9D": "妄",
    "\x82\x9E": "闭",
    "\x82\x9F": "问",
    "\x82\xA0": "闯",
    "\x82\xA1": "羊",
    "\x82\xA2": "并",
    "\x82\xA3": "关",
    "\x82\xA4": "米",
    "\x82\xA5": "灯",
    "\x82\xA6": "州",
    "\x82\xA7": "汗",
    "\x82\xA8": "污",
    "\x82\xA9": "江",
    "\x82\xAA": "汕",
    "\x82\xAB": "汔",
    "\x82\xAC": "汲",
    "\x82\xAD": "汐",
    "\x82\xAE": "汛",
    "\x82\xAF": "汜",
    "\x82\xB0": "池",
    "\x82\xB1": "汝",
    "\x82\xB2": "汤",
    "\x82\xB3": "汊",
    "\x82\xB4": "忖",
    "\x82\xB5": "忏",
    "\x82\xB6": "忙",
    "\x82\xB7": "兴",
    "\x82\xB8": "宇",
    "\x82\xB9": "守",
    "\x82\xBA": "宅",
    "\x82\xBB": "字",
    "\x82\xBC": "安",
    "\x82\xBD": "讲",
    "\x82\xBE": "讳",
    "\x82\xBF": "讴",
    "\x82\xC0": "军",
    "\x82\xC1": "讵",
    "\x82\xC2": "讶",
    "\x82\xC3": "祁",
    "\x82\xC4": "讷",
    "\x82\xC5": "许",
    "\x82\xC6": "讹",
    "\x82\xC7": "论",
    "\x82\xC8": "讼",
    "\x82\xC9": "农",
    "\x82\xCA": "讽",
    "\x82\xCB": "设",
    "\x82\xCC": "访",
    "\x82\xCD": "诀",
    "\x82\xCE": "聿",
    "\x82\xCF": "寻",
    "\x82\xD0": "那",
    "\x82\xD1": "艮",
    "\x82\xD2": "厾",
    "\x82\xD3": "迅",
    "\x82\xD4": "尽",
    "\x82\xD5": "导",
    "\x82\xD6": "异",
    "\x82\xD7": "弛",
    "\x82\xD8": "阱",
    "\x82\xD9": "阮",
    "\x82\xDA": "孙",
    "\x82\xDB": "阵",
    "\x82\xDC": "阳",
    "\x82\xDD": "收",
    "\x82\xDE": "阪",
    "\x82\xDF": "阶",
    "\x82\xE0": "阴",
    "\x82\xE1": "防",
    "\x82\xE2": "丞",
    "\x82\xE3": "奸",
    "\x82\xE4": "如",
    "\x82\xE5": "妁",
    "\x82\xE6": "妇",
    "\x82\xE7": "妃",
    "\x82\xE8": "好",
    "\x82\xE9": "她",
    "\x82\xEA": "妈",
    "\x82\xEB": "戏",
    "\x82\xEC": "羽",
    "\x82\xED": "观",
    "\x82\xEE": "牟",
    "\x82\xEF": "欢",
    "\x82\xF0": "买",
    "\x82\xF1": "纡",
    "\x82\xF2": "红",
    "\x82\xF3": "纣",
    "\x82\xF4": "驮",
    "\x82\xF5": "纤",
    "\x82\xF6": "纥",
    "\x82\xF7": "驯",
    "\x82\xF8": "纨",
    "\x82\xF9": "约",
    "\x82\xFA": "级",
    "\x82\xFB": "纩",
    "\x82\xFC": "纪",
    "\x82\xFD": "驰",
    "\x82\xFE": "纫",
    "\x82\xFF": "巡",
    "\x83\x01": "寿",
    "\x83\x02": "玕",
    "\x83\x03": "弄",
    "\x83\x04": "玙",
    "\x83\x05": "麦",
    "\x83\x06": "玖",
    "\x83\x07": "玚",
    "\x83\x08": "玛",
    "\x83\x09": "形",
    "\x83\x0A": "进",
    "\x83\x0B": "戒",
    "\x83\x0C": "吞",
    "\x83\x0D": "远",
    "\x83\x0E": "违",
    "\x83\x0F": "韧",
    "\x83\x10": "运",
    "\x83\x11": "扶",
    "\x83\x12": "抚",
    "\x83\x13": "坛",
    "\x83\x14": "抟",
    "\x83\x15": "技",
    "\x83\x16": "坏",
    "\x83\x17": "抔",
    "\x83\x18": "抠",
    "\x83\x19": "坜",
    "\x83\x1A": "扰",
    "\x83\x1B": "扼",
    "\x83\x1C": "拒",
    "\x83\x1D": "找",
    "\x83\x1E": "批",
    "\x83\x1F": "扯",
    "\x83\x20": "址",
    "\x83\x21": "走",
    "\x83\x22": "抄",
    "\x83\x23": "汞",
    "\x83\x24": "坝",
    "\x83\x25": "贡",
    "\x83\x26": "攻",
    "\x83\x27": "赤",
    "\x83\x28": "圻",
    "\x83\x29": "折",
    "\x83\x2A": "抓",
    "\x83\x2B": "扳",
    "\x83\x2C": "坂",
    "\x83\x2D": "抡",
    "\x83\x2E": "扮",
    "\x83\x2F": "抢",
    "\x83\x30": "扺",
    "\x83\x31": "孝",
    "\x83\x32": "坎",
    "\x83\x33": "坍",
    "\x83\x34": "均",
    "\x83\x35": "坞",
    "\x83\x36": "抑",
    "\x83\x37": "抛",
    "\x83\x38": "投",
    "\x83\x39": "抃",
    "\x83\x3A": "坟",
    "\x83\x3B": "坑",
    "\x83\x3C": "抗",
    "\x83\x3D": "坊",
    "\x83\x3E": "抖",
    "\x83\x3F": "护",
    "\x83\x40": "壳",
    "\x83\x41": "志",
    "\x83\x42": "扭",
    "\x83\x43": "块",
    "\x83\x44": "抉",
    "\x83\x45": "声",
    "\x83\x46": "把",
    "\x83\x47": "报",
    "\x83\x48": "拟",
    "\x83\x49": "抒",
    "\x83\x4A": "却",
    "\x83\x4B": "劫",
    "\x83\x4C": "毐",
    "\x83\x4D": "芙",
    "\x83\x4E": "芫",
    "\x83\x4F": "芜",
    "\x83\x50": "苇",
    "\x83\x51": "邯",
    "\x83\x52": "芸",
    "\x83\x53": "芾",
    "\x83\x54": "芰",
    "\x83\x55": "苈",
    "\x83\x56": "苊",
    "\x83\x57": "苣",
    "\x83\x58": "芽",
    "\x83\x59": "芷",
    "\x83\x5A": "芮",
    "\x83\x5B": "苋",
    "\x83\x5C": "芼",
    "\x83\x5D": "苌",
    "\x83\x5E": "花",
    "\x83\x5F": "芹",
    "\x83\x60": "芥",
    "\x83\x61": "苁",
    "\x83\x62": "芩",
    "\x83\x63": "芬",
    "\x83\x64": "苍",
    "\x83\x65": "芪",
    "\x83\x66": "芴",
    "\x83\x67": "芡",
    "\x83\x68": "芟",
    "\x83\x69": "苄",
    "\x83\x6A": "芳",
    "\x83\x6B": "严",
    "\x83\x6C": "苎",
    "\x83\x6D": "芦",
    "\x83\x6E": "芯",
    "\x83\x6F": "劳",
    "\x83\x70": "克",
    "\x83\x71": "芭",
    "\x83\x72": "苏",
    "\x83\x73": "苡",
    "\x83\x74": "杆",
    "\x83\x75": "杜",
    "\x83\x76": "杠",
    "\x83\x77": "材",
    "\x83\x78": "村",
    "\x83\x79": "杖",
    "\x83\x7A": "杌",
    "\x83\x7B": "杏",
    "\x83\x7C": "杉",
    "\x83\x7D": "巫",
    "\x83\x7E": "杓",
    "\x83\x7F": "极",
    "\x83\x80": "杧",
    "\x83\x81": "杞",
    "\x83\x82": "李",
    "\x83\x83": "杨",
    "\x83\x84": "杈",
    "\x83\x85": "求",
    "\x83\x86": "忑",
    "\x83\x87": "孛",
    "\x83\x88": "甫",
    "\x83\x89": "匣",
    "\x83\x8A": "更",
    "\x83\x8B": "束",
    "\x83\x8C": "吾",
    "\x83\x8D": "豆",
    "\x83\x8E": "两",
    "\x83\x8F": "邴",
    "\x83\x90": "酉",
    "\x83\x91": "丽",
    "\x83\x92": "医",
    "\x83\x93": "辰",
    "\x83\x94": "励",
    "\x83\x95": "邳",
    "\x83\x96": "否",
    "\x83\x97": "还",
    "\x83\x98": "矶",
    "\x83\x99": "奁",
    "\x83\x9A": "豕",
    "\x83\x9B": "尬",
    "\x83\x9C": "歼",
    "\x83\x9D": "来",
    "\x83\x9E": "忒",
    "\x83\x9F": "连",
    "\x83\xA0": "欤",
    "\x83\xA1": "轩",
    "\x83\xA2": "轪",
    "\x83\xA3": "轫",
    "\x83\xA4": "迓",
    "\x83\xA5": "邶",
    "\x83\xA6": "忐",
    "\x83\xA7": "芈",
    "\x83\xA8": "步",
    "\x83\xA9": "卤",
    "\x83\xAA": "卣",
    "\x83\xAB": "邺",
    "\x83\xAC": "坚",
    "\x83\xAD": "肖",
    "\x83\xAE": "旰",
    "\x83\xAF": "旱",
    "\x83\xB0": "盯",
    "\x83\xB1": "呈",
    "\x83\xB2": "时",
    "\x83\xB3": "吴",
    "\x83\xB4": "呋",
    "\x83\xB5": "助",
    "\x83\xB6": "县",
    "\x83\xB7": "里",
    "\x83\xB8": "呓",
    "\x83\xB9": "呆",
    "\x83\xBA": "吱",
    "\x83\xBB": "吠",
    "\x83\xBC": "呔",
    "\x83\xBD": "呕",
    "\x83\xBE": "园",
    "\x83\xBF": "呖",
    "\x83\xC0": "呃",
    "\x83\xC1": "旷",
    "\x83\xC2": "围",
    "\x83\xC3": "呀",
    "\x83\xC4": "吨",
    "\x83\xC5": "旸",
    "\x83\xC6": "吡",
    "\x83\xC7": "町",
    "\x83\xC8": "足",
    "\x83\xC9": "虬",
    "\x83\xCA": "邮",
    "\x83\xCB": "男",
    "\x83\xCC": "困",
    "\x83\xCD": "吵",
    "\x83\xCE": "串",
    "\x83\xCF": "呙",
    "\x83\xD0": "呐",
    "\x83\xD1": "呗",
    "\x83\xD2": "员",
    "\x83\xD3": "听",
    "\x83\xD4": "吟",
    "\x83\xD5": "吩",
    "\x83\xD6": "呛",
    "\x83\xD7": "吻",
    "\x83\xD8": "吹",
    "\x83\xD9": "呜",
    "\x83\xDA": "吭",
    "\x83\xDB": "吣",
    "\x83\xDC": "吲",
    "\x83\xDD": "吼",
    "\x83\xDE": "邑",
    "\x83\xDF": "吧",
    "\x83\xE0": "囤",
    "\x83\xE1": "别",
    "\x83\xE2": "吮",
    "\x83\xE3": "岍",
    "\x83\xE4": "帏",
    "\x83\xE5": "岐",
    "\x83\xE6": "岖",
    "\x83\xE7": "岈",
    "\x83\xE8": "岗",
    "\x83\xE9": "岘",
    "\x83\xEA": "帐",
    "\x83\xEB": "岑",
    "\x83\xEC": "岚",
    "\x83\xED": "兕",
    "\x83\xEE": "财",
    "\x83\xEF": "囵",
    "\x83\xF0": "囫",
    "\x83\xF1": "钉",
    "\x83\xF2": "针",
    "\x83\xF3": "钊",
    "\x83\xF4": "钋",
    "\x83\xF5": "钌",
    "\x83\xF6": "迕",
    "\x83\xF7": "氙",
    "\x83\xF8": "氚",
    "\x83\xF9": "牡",
    "\x83\xFA": "告",
    "\x83\xFB": "我",
    "\x83\xFC": "乱",
    "\x83\xFD": "利",
    "\x83\xFE": "秃",
    "\x83\xFF": "秀",
    "\x84\x01": "私",
    "\x84\x02": "岙",
    "\x84\x03": "每",
    "\x84\x04": "佞",
    "\x84\x05": "兵",
    "\x84\x06": "邱",
    "\x84\x07": "估",
    "\x84\x08": "体",
    "\x84\x09": "何",
    "\x84\x0A": "佐",
    "\x84\x0B": "伾",
    "\x84\x0C": "佑",
    "\x84\x0D": "攸",
    "\x84\x0E": "但",
    "\x84\x0F": "伸",
    "\x84\x10": "佃",
    "\x84\x11": "佚",
    "\x84\x12": "作",
    "\x84\x13": "伯",
    "\x84\x14": "伶",
    "\x84\x15": "佣",
    "\x84\x16": "低",
    "\x84\x17": "你",
    "\x84\x18": "佝",
    "\x84\x19": "佟",
    "\x84\x1A": "住",
    "\x84\x1B": "位",
    "\x84\x1C": "伴",
    "\x84\x1D": "佗",
    "\x84\x1E": "身",
    "\x84\x1F": "皂",
    "\x84\x20": "伺",
    "\x84\x21": "佛",
    "\x84\x22": "伽",
    "\x84\x23": "囱",
    "\x84\x24": "近",
    "\x84\x25": "彻",
    "\x84\x26": "役",
    "\x84\x27": "彷",
    "\x84\x28": "返",
    "\x84\x29": "佘",
    "\x84\x2A": "余",
    "\x84\x2B": "希",
    "\x84\x2C": "佥",
    "\x84\x2D": "坐",
    "\x84\x2E": "谷",
    "\x84\x2F": "孚",
    "\x84\x30": "妥",
    "\x84\x31": "豸",
    "\x84\x32": "含",
    "\x84\x33": "邻",
    "\x84\x34": "坌",
    "\x84\x35": "岔",
    "\x84\x36": "肝",
    "\x84\x37": "肟",
    "\x84\x38": "肛",
    "\x84\x39": "肚",
    "\x84\x3A": "肘",
    "\x84\x3B": "肠",
    "\x84\x3C": "邸",
    "\x84\x3D": "龟",
    "\x84\x3E": "甸",
    "\x84\x3F": "奂",
    "\x84\x40": "免",
    "\x84\x41": "劬",
    "\x84\x42": "狂",
    "\x84\x43": "犹",
    "\x84\x44": "狈",
    "\x84\x45": "狄",
    "\x84\x46": "角",
    "\x84\x47": "删",
    "\x84\x48": "狃",
    "\x84\x49": "狁",
    "\x84\x4A": "鸠",
    "\x84\x4B": "条",
    "\x84\x4C": "彤",
    "\x84\x4D": "卵",
    "\x84\x4E": "灸",
    "\x84\x4F": "岛",
    "\x84\x50": "邹",
    "\x84\x51": "刨",
    "\x84\x52": "饨",
    "\x84\x53": "迎",
    "\x84\x54": "饩",
    "\x84\x55": "饪",
    "\x84\x56": "饫",
    "\x84\x57": "饬",
    "\x84\x58": "饭",
    "\x84\x59": "饮",
    "\x84\x5A": "系",
    "\x84\x5B": "言",
    "\x84\x5C": "冻",
    "\x84\x5D": "状",
    "\x84\x5E": "亩",
    "\x84\x5F": "况",
    "\x84\x60": "亨",
    "\x84\x61": "庑",
    "\x84\x62": "床",
    "\x84\x63": "庋",
    "\x84\x64": "库",
    "\x84\x65": "庇",
    "\x84\x66": "疔",
    "\x84\x67": "疖",
    "\x84\x68": "疗",
    "\x84\x69": "吝",
    "\x84\x6A": "应",
    "\x84\x6B": "冷",
    "\x84\x6C": "这",
    "\x84\x6D": "庐",
    "\x84\x6E": "序",
    "\x84\x6F": "辛",
    "\x84\x70": "肓",
    "\x84\x71": "弃",
    "\x84\x72": "冶",
    "\x84\x73": "忘",
    "\x84\x74": "闰",
    "\x84\x75": "闱",
    "\x84\x76": "闲",
    "\x84\x77": "闳",
    "\x84\x78": "间",
    "\x84\x79": "闵",
    "\x84\x7A": "闶",
    "\x84\x7B": "闷",
    "\x84\x7C": "羌",
    "\x84\x7D": "判",
    "\x84\x7E": "兑",
    "\x84\x7F": "灶",
    "\x84\x80": "灿",
    "\x84\x81": "灼",
    "\x84\x82": "炀",
    "\x84\x83": "弟",
    "\x84\x84": "沣",
    "\x84\x85": "汪",
    "\x84\x86": "沅",
    "\x84\x87": "沄",
    "\x84\x88": "沐",
    "\x84\x89": "沛",
    "\x84\x8A": "沔",
    "\x84\x8B": "汰",
    "\x84\x8C": "沤",
    "\x84\x8D": "沥",
    "\x84\x8E": "沌",
    "\x84\x8F": "沘",
    "\x84\x90": "沏",
    "\x84\x91": "沚",
    "\x84\x92": "沙",
    "\x84\x93": "汩",
    "\x84\x94": "汨",
    "\x84\x95": "汭",
    "\x84\x96": "汽",
    "\x84\x97": "沃",
    "\x84\x98": "沂",
    "\x84\x99": "沦",
    "\x84\x9A": "汹",
    "\x84\x9B": "汾",
    "\x84\x9C": "泛",
    "\x84\x9D": "沧",
    "\x84\x9E": "沨",
    "\x84\x9F": "沟",
    "\x84\xA0": "没",
    "\x84\xA1": "汴",
    "\x84\xA2": "汶",
    "\x84\xA3": "沆",
    "\x84\xA4": "沩",
    "\x84\xA5": "沪",
    "\x84\xA6": "沈",
    "\x84\xA7": "沉",
    "\x84\xA8": "沁",
    "\x84\xA9": "泐",
    "\x84\xAA": "怃",
    "\x84\xAB": "忮",
    "\x84\xAC": "怀",
    "\x84\xAD": "怄",
    "\x84\xAE": "忧",
    "\x84\xAF": "忡",
    "\x84\xB0": "忤",
    "\x84\xB1": "忾",
    "\x84\xB2": "怅",
    "\x84\xB3": "忻",
    "\x84\xB4": "忪",
    "\x84\xB5": "怆",
    "\x84\xB6": "忭",
    "\x84\xB7": "忱",
    "\x84\xB8": "快",
    "\x84\xB9": "忸",
    "\x84\xBA": "完",
    "\x84\xBB": "宋",
    "\x84\xBC": "宏",
    "\x84\xBD": "牢",
    "\x84\xBE": "究",
    "\x84\xBF": "穷",
    "\x84\xC0": "灾",
    "\x84\xC1": "良",
    "\x84\xC2": "证",
    "\x84\xC3": "诂",
    "\x84\xC4": "诃",
    "\x84\xC5": "启",
    "\x84\xC6": "评",
    "\x84\xC7": "补",
    "\x84\xC8": "初",
    "\x84\xC9": "社",
    "\x84\xCA": "祀",
    "\x84\xCB": "祃",
    "\x84\xCC": "诅",
    "\x84\xCD": "识",
    "\x84\xCE": "诈",
    "\x84\xCF": "诉",
    "\x84\xD0": "罕",
    "\x84\xD1": "诊",
    "\x84\xD2": "诋",
    "\x84\xD3": "诌",
    "\x84\xD4": "词",
    "\x84\xD5": "诎",
    "\x84\xD6": "诏",
    "\x84\xD7": "诐",
    "\x84\xD8": "译",
    "\x84\xD9": "诒",
    "\x84\xDA": "君",
    "\x84\xDB": "灵",
    "\x84\xDC": "即",
    "\x84\xDD": "层",
    "\x84\xDE": "屁",
    "\x84\xDF": "屃",
    "\x84\xE0": "尿",
    "\x84\xE1": "尾",
    "\x84\xE2": "迟",
    "\x84\xE3": "局",
    "\x84\xE4": "改",
    "\x84\xE5": "张",
    "\x84\xE6": "忌",
    "\x84\xE7": "际",
    "\x84\xE8": "陆",
    "\x84\xE9": "阿",
    "\x84\xEA": "孜",
    "\x84\xEB": "陇",
    "\x84\xEC": "陈",
    "\x84\xED": "阽",
    "\x84\xEE": "阻",
    "\x84\xEF": "阼",
    "\x84\xF0": "附",
    "\x84\xF1": "坠",
    "\x84\xF2": "陀",
    "\x84\xF3": "陂",
    "\x84\xF4": "陉",
    "\x84\xF5": "妍",
    "\x84\xF6": "妩",
    "\x84\xF7": "妓",
    "\x84\xF8": "妪",
    "\x84\xF9": "妣",
    "\x84\xFA": "妙",
    "\x84\xFB": "妊",
    "\x84\xFC": "妖",
    "\x84\xFD": "妗",
    "\x84\xFE": "姊",
    "\x84\xFF": "妨",
    "\x85\x01": "妫",
    "\x85\x02": "妒",
    "\x85\x03": "妞",
    "\x85\x04": "姒",
    "\x85\x05": "妤",
    "\x85\x06": "努",
    "\x85\x07": "邵",
    "\x85\x08": "劭",
    "\x85\x09": "忍",
    "\x85\x0A": "刭",
    "\x85\x0B": "劲",
    "\x85\x0C": "甬",
    "\x85\x0D": "邰",
    "\x85\x0E": "矣",
    "\x85\x0F": "鸡",
    "\x85\x10": "纬",
    "\x85\x11": "纭",
    "\x85\x12": "驱",
    "\x85\x13": "纯",
    "\x85\x14": "纰",
    "\x85\x15": "纱",
    "\x85\x16": "纲",
    "\x85\x17": "纳",
    "\x85\x18": "纴",
    "\x85\x19": "纵",
    "\x85\x1A": "驳",
    "\x85\x1B": "纶",
    "\x85\x1C": "纷",
    "\x85\x1D": "纸",
    "\x85\x1E": "纹",
    "\x85\x1F": "纺",
    "\x85\x20": "纻",
    "\x85\x21": "驴",
    "\x85\x22": "纽",
    "\x85\x23": "纾",
    "\x85\x24": "奉",
    "\x85\x25": "玩",
    "\x85\x26": "玮",
    "\x85\x27": "环",
    "\x85\x28": "玡",
    "\x85\x29": "武",
    "\x85\x2A": "青",
    "\x85\x2B": "责",
    "\x85\x2C": "现",
    "\x85\x2D": "玫",
    "\x85\x2E": "玠",
    "\x85\x2F": "玢",
    "\x85\x30": "玥",
    "\x85\x31": "表",
    "\x85\x32": "玦",
    "\x85\x33": "甙",
    "\x85\x34": "盂",
    "\x85\x35": "忝",
    "\x85\x36": "规",
    "\x85\x37": "匦",
    "\x85\x38": "抹",
    "\x85\x39": "卦",
    "\x85\x3A": "邽",
    "\x85\x3B": "坩",
    "\x85\x3C": "坷",
    "\x85\x3D": "坯",
    "\x85\x3E": "拓",
    "\x85\x3F": "垅",
    "\x85\x40": "拢",
    "\x85\x41": "拔",
    "\x85\x42": "抨",
    "\x85\x43": "坪",
    "\x85\x44": "拣",
    "\x85\x45": "拤",
    "\x85\x46": "拈",
    "\x85\x47": "坫",
    "\x85\x48": "垆",
    "\x85\x49": "坦",
    "\x85\x4A": "担",
    "\x85\x4B": "坤",
    "\x85\x4C": "押",
    "\x85\x4D": "抻",
    "\x85\x4E": "抽",
    "\x85\x4F": "拐",
    "\x85\x50": "拃",
    "\x85\x51": "拖",
    "\x85\x52": "拊",
    "\x85\x53": "者",
    "\x85\x54": "拍",
    "\x85\x55": "顶",
    "\x85\x56": "坼",
    "\x85\x57": "拆",
    "\x85\x58": "拎",
    "\x85\x59": "拥",
    "\x85\x5A": "抵",
    "\x85\x5B": "坻",
    "\x85\x5C": "拘",
    "\x85\x5D": "势",
    "\x85\x5E": "抱",
    "\x85\x5F": "拄",
    "\x85\x60": "垃",
    "\x85\x61": "拉",
    "\x85\x62": "拦",
    "\x85\x63": "幸",
    "\x85\x64": "拌",
    "\x85\x65": "拧",
    "\x85\x66": "坨",
    "\x85\x67": "坭",
    "\x85\x68": "抿",
    "\x85\x69": "拂",
    "\x85\x6A": "拙",
    "\x85\x6B": "招",
    "\x85\x6C": "坡",
    "\x85\x6D": "披",
    "\x85\x6E": "拨",
    "\x85\x6F": "择",
    "\x85\x70": "拚",
    "\x85\x71": "抬",
    "\x85\x72": "拇",
    "\x85\x73": "坳",
    "\x85\x74": "拗",
    "\x85\x75": "耵",
    "\x85\x76": "其",
    "\x85\x77": "耶",
    "\x85\x78": "取",
    "\x85\x79": "茉",
    "\x85\x7A": "苷",
    "\x85\x7B": "苦",
    "\x85\x7C": "苯",
    "\x85\x7D": "昔",
    "\x85\x7E": "苛",
    "\x85\x7F": "苤",
    "\x85\x80": "若",
    "\x85\x81": "茂",
    "\x85\x82": "茏",
    "\x85\x83": "苹",
    "\x85\x84": "苫",
    "\x85\x85": "苴",
    "\x85\x86": "苜",
    "\x85\x87": "苗",
    "\x85\x88": "英",
    "\x85\x89": "苒",
    "\x85\x8A": "苘",
    "\x85\x8B": "茌",
    "\x85\x8C": "苻",
    "\x85\x8D": "苓",
    "\x85\x8E": "茚",
    "\x85\x8F": "苟",
    "\x85\x90": "茆",
    "\x85\x91": "茑",
    "\x85\x92": "苑",
    "\x85\x93": "苞",
    "\x85\x94": "范",
    "\x85\x95": "茓",
    "\x85\x96": "茔",
    "\x85\x97": "茕",
    "\x85\x98": "直",
    "\x85\x99": "苠",
    "\x85\x9A": "茀",
    "\x85\x9B": "茁",
    "\x85\x9C": "茄",
    "\x85\x9D": "苕",
    "\x85\x9E": "茎",
    "\x85\x9F": "苔",
    "\x85\xA0": "茅",
    "\x85\xA1": "枉",
    "\x85\xA2": "林",
    "\x85\xA3": "枝",
    "\x85\xA4": "杯",
    "\x85\xA5": "枢",
    "\x85\xA6": "枥",
    "\x85\xA7": "柜",
    "\x85\xA8": "枇",
    "\x85\xA9": "杪",
    "\x85\xAA": "杳",
    "\x85\xAB": "枘",
    "\x85\xAC": "枧",
    "\x85\xAD": "杵",
    "\x85\xAE": "枚",
    "\x85\xAF": "枨",
    "\x85\xB0": "析",
    "\x85\xB1": "板",
    "\x85\xB2": "枞",
    "\x85\xB3": "松",
    "\x85\xB4": "枪",
    "\x85\xB5": "枫",
    "\x85\xB6": "构",
    "\x85\xB7": "杭",
    "\x85\xB8": "枋",
    "\x85\xB9": "杰",
    "\x85\xBA": "述",
    "\x85\xBB": "枕",
    "\x85\xBC": "杻",
    "\x85\xBD": "杷",
    "\x85\xBE": "杼",
    "\x85\xBF": "丧",
    "\x85\xC0": "或",
    "\x85\xC1": "画",
    "\x85\xC2": "卧",
    "\x85\xC3": "事",
    "\x85\xC4": "刺",
    "\x85\xC5": "枣",
    "\x85\xC6": "雨",
    "\x85\xC7": "卖",
    "\x85\xC8": "矸",
    "\x85\xC9": "郁",
    "\x85\xCA": "矻",
    "\x85\xCB": "矾",
    "\x85\xCC": "矽",
    "\x85\xCD": "矿",
    "\x85\xCE": "砀",
    "\x85\xCF": "码",
    "\x85\xD0": "厕",
    "\x85\xD1": "奈",
    "\x85\xD2": "刳",
    "\x85\xD3": "奔",
    "\x85\xD4": "奇",
    "\x85\xD5": "奄",
    "\x85\xD6": "奋",
    "\x85\xD7": "态",
    "\x85\xD8": "瓯",
    "\x85\xD9": "欧",
    "\x85\xDA": "殴",
    "\x85\xDB": "垄",
    "\x85\xDC": "殁",
    "\x85\xDD": "郏",
    "\x85\xDE": "妻",
    "\x85\xDF": "轰",
    "\x85\xE0": "顷",
    "\x85\xE1": "转",
    "\x85\xE2": "轭",
    "\x85\xE3": "斩",
    "\x85\xE4": "轮",
    "\x85\xE5": "软",
    "\x85\xE6": "到",
    "\x85\xE7": "郅",
    "\x85\xE8": "鸢",
    "\x85\xE9": "非",
    "\x85\xEA": "叔",
    "\x85\xEB": "歧",
    "\x85\xEC": "肯",
    "\x85\xED": "齿",
    "\x85\xEE": "些",
    "\x85\xEF": "卓",
    "\x85\xF0": "虎",
    "\x85\xF1": "虏",
    "\x85\xF2": "肾",
    "\x85\xF3": "贤",
    "\x85\xF4": "尚",
    "\x85\xF5": "盱",
    "\x85\xF6": "旺",
    "\x85\xF7": "具",
    "\x85\xF8": "昊",
    "\x85\xF9": "昙",
    "\x85\xFA": "果",
    "\x85\xFB": "味",
    "\x85\xFC": "杲",
    "\x85\xFD": "昃",
    "\x85\xFE": "昆",
    "\x85\xFF": "国",
    "\x86\x01": "哎",
    "\x86\x02": "咕",
    "\x86\x03": "昌",
    "\x86\x04": "呵",
    "\x86\x05": "咂",
    "\x86\x06": "畅",
    "\x86\x07": "呸",
    "\x86\x08": "昕",
    "\x86\x09": "明",
    "\x86\x0A": "易",
    "\x86\x0B": "咙",
    "\x86\x0C": "昀",
    "\x86\x0D": "昂",
    "\x86\x0E": "旻",
    "\x86\x0F": "昉",
    "\x86\x10": "炅",
    "\x86\x11": "咔",
    "\x86\x12": "畀",
    "\x86\x13": "虮",
    "\x86\x14": "迪",
    "\x86\x15": "典",
    "\x86\x16": "固",
    "\x86\x17": "忠",
    "\x86\x18": "咀",
    "\x86\x19": "呷",
    "\x86\x1A": "呻",
    "\x86\x1B": "黾",
    "\x86\x1C": "咒",
    "\x86\x1D": "咋",
    "\x86\x1E": "咐",
    "\x86\x1F": "呱",
    "\x86\x20": "呼",
    "\x86\x21": "呤",
    "\x86\x22": "咚",
    "\x86\x23": "鸣",
    "\x86\x24": "咆",
    "\x86\x25": "咛",
    "\x86\x26": "咏",
    "\x86\x27": "呢",
    "\x86\x28": "咄",
    "\x86\x29": "呶",
    "\x86\x2A": "咖",
    "\x86\x2B": "呦",
    "\x86\x2C": "咝",
    "\x86\x2D": "岵",
    "\x86\x2E": "岢",
    "\x86\x2F": "岸",
    "\x86\x30": "岩",
    "\x86\x31": "帖",
    "\x86\x32": "罗",
    "\x86\x33": "岿",
    "\x86\x34": "岬",
    "\x86\x35": "岫",
    "\x86\x36": "帜",
    "\x86\x37": "帙",
    "\x86\x38": "帕",
    "\x86\x39": "岭",
    "\x86\x3A": "岣",
    "\x86\x3B": "峁",
    "\x86\x3C": "刿",
    "\x86\x3D": "峂",
    "\x86\x3E": "迥",
    "\x86\x3F": "岷",
    "\x86\x40": "剀",
    "\x86\x41": "凯",
    "\x86\x42": "帔",
    "\x86\x43": "峄",
    "\x86\x44": "沓",
    "\x86\x45": "败",
    "\x86\x46": "账",
    "\x86\x47": "贩",
    "\x86\x48": "贬",
    "\x86\x49": "购",
    "\x86\x4A": "贮",
    "\x86\x4B": "囹",
    "\x86\x4C": "图",
    "\x86\x4D": "罔",
    "\x86\x4E": "钍",
    "\x86\x4F": "钎",
    "\x86\x50": "钏",
    "\x86\x51": "钐",
    "\x86\x52": "钓",
    "\x86\x53": "钒",
    "\x86\x54": "钔",
    "\x86\x55": "钕",
    "\x86\x56": "钗",
    "\x86\x57": "邾",
    "\x86\x58": "制",
    "\x86\x59": "知",
    "\x86\x5A": "迭",
    "\x86\x5B": "氛",
    "\x86\x5C": "迮",
    "\x86\x5D": "垂",
    "\x86\x5E": "牦",
    "\x86\x5F": "牧",
    "\x86\x60": "物",
    "\x86\x61": "乖",
    "\x86\x62": "刮",
    "\x86\x63": "秆",
    "\x86\x64": "和",
    "\x86\x65": "季",
    "\x86\x66": "委",
    "\x86\x67": "竺",
    "\x86\x68": "秉",
    "\x86\x69": "迤",
    "\x86\x6A": "佳",
    "\x86\x6B": "侍",
    "\x86\x6C": "佶",
    "\x86\x6D": "岳",
    "\x86\x6E": "佬",
    "\x86\x6F": "佴",
    "\x86\x70": "供",
    "\x86\x71": "使",
    "\x86\x72": "侑",
    "\x86\x73": "佰",
    "\x86\x74": "侉",
    "\x86\x75": "例",
    "\x86\x76": "侠",
    "\x86\x77": "臾",
    "\x86\x78": "侥",
    "\x86\x79": "版",
    "\x86\x7A": "侄",
    "\x86\x7B": "岱",
    "\x86\x7C": "侦",
    "\x86\x7D": "侣",
    "\x86\x7E": "侗",
    "\x86\x7F": "侃",
    "\x86\x80": "侧",
    "\x86\x81": "侏",
    "\x86\x82": "凭",
    "\x86\x83": "侨",
    "\x86\x84": "侩",
    "\x86\x85": "佻",
    "\x86\x86": "佾",
    "\x86\x87": "佩",
    "\x86\x88": "货",
    "\x86\x89": "侈",
    "\x86\x8A": "侪",
    "\x86\x8B": "佼",
    "\x86\x8C": "依",
    "\x86\x8D": "佯",
    "\x86\x8E": "侬",
    "\x86\x8F": "帛",
    "\x86\x90": "卑",
    "\x86\x91": "的",
    "\x86\x92": "迫",
    "\x86\x93": "阜",
    "\x86\x94": "侔",
    "\x86\x95": "质",
    "\x86\x96": "欣",
    "\x86\x97": "郈",
    "\x86\x98": "征",
    "\x86\x99": "徂",
    "\x86\x9A": "往",
    "\x86\x9B": "爬",
    "\x86\x9C": "彼",
    "\x86\x9D": "径",
    "\x86\x9E": "所",
    "\x86\x9F": "舍",
    "\x86\xA0": "金",
    "\x86\xA1": "刽",
    "\x86\xA2": "郐",
    "\x86\xA3": "刹",
    "\x86\xA4": "命",
    "\x86\xA5": "肴",
    "\x86\xA6": "郄",
    "\x86\xA7": "斧",
    "\x86\xA8": "怂",
    "\x86\xA9": "爸",
    "\x86\xAA": "采",
    "\x86\xAB": "籴",
    "\x86\xAC": "觅",
    "\x86\xAD": "受",
    "\x86\xAE": "乳",
    "\x86\xAF": "贪",
    "\x86\xB0": "念",
    "\x86\xB1": "贫",
    "\x86\xB2": "忿",
    "\x86\xB3": "瓮",
    "\x86\xB4": "戗",
    "\x86\xB5": "肼",
    "\x86\xB6": "肤",
    "\x86\xB7": "朊",
    "\x86\xB8": "肺",
    "\x86\xB9": "肢",
    "\x86\xBA": "肽",
    "\x86\xBB": "肱",
    "\x86\xBC": "肫",
    "\x86\xBD": "肿",
    "\x86\xBE": "肭",
    "\x86\xBF": "胀",
    "\x86\xC0": "朋",
    "\x86\xC1": "肷",
    "\x86\xC2": "股",
    "\x86\xC3": "肮",
    "\x86\xC4": "肪",
    "\x86\xC5": "肥",
    "\x86\xC6": "服",
    "\x86\xC7": "胁",
    "\x86\xC8": "周",
    "\x86\xC9": "剁",
    "\x86\xCA": "昏",
    "\x86\xCB": "迩",
    "\x86\xCC": "郇",
    "\x86\xCD": "鱼",
    "\x86\xCE": "兔",
    "\x86\xCF": "狉",
    "\x86\xD0": "狙",
    "\x86\xD1": "狎",
    "\x86\xD2": "狐",
    "\x86\xD3": "忽",
    "\x86\xD4": "狝",
    "\x86\xD5": "狗",
    "\x86\xD6": "狍",
    "\x86\xD7": "狞",
    "\x86\xD8": "狒",
    "\x86\xD9": "咎",
    "\x86\xDA": "备",
    "\x86\xDB": "炙",
    "\x86\xDC": "枭",
    "\x86\xDD": "饯",
    "\x86\xDE": "饰",
    "\x86\xDF": "饱",
    "\x86\xE0": "饲",
    "\x86\xE1": "饳",
    "\x86\xE2": "饴",
    "\x86\xE3": "冽",
    "\x86\xE4": "变",
    "\x86\xE5": "京",
    "\x86\xE6": "享",
    "\x86\xE7": "冼",
    "\x86\xE8": "庞",
    "\x86\xE9": "店",
    "\x86\xEA": "夜",
    "\x86\xEB": "庙",
    "\x86\xEC": "府",
    "\x86\xED": "底",
    "\x86\xEE": "庖",
    "\x86\xEF": "疟",
    "\x86\xF0": "疠",
    "\x86\xF1": "疝",
    "\x86\xF2": "疙",
    "\x86\xF3": "疚",
    "\x86\xF4": "疡",
    "\x86\xF5": "剂",
    "\x86\xF6": "卒",
    "\x86\xF7": "郊",
    "\x86\xF8": "兖",
    "\x86\xF9": "庚",
    "\x86\xFA": "废",
    "\x86\xFB": "净",
    "\x86\xFC": "妾",
    "\x86\xFD": "盲",
    "\x86\xFE": "放",
    "\x86\xFF": "於",
    "\x87\x01": "刻",
    "\x87\x02": "劾",
    "\x87\x03": "育",
    "\x87\x04": "氓",
    "\x87\x05": "闸",
    "\x87\x06": "闹",
    "\x87\x07": "郑",
    "\x87\x08": "券",
    "\x87\x09": "卷",
    "\x87\x0A": "单",
    "\x87\x0B": "炜",
    "\x87\x0C": "炬",
    "\x87\x0D": "炖",
    "\x87\x0E": "炒",
    "\x87\x0F": "炝",
    "\x87\x10": "炊",
    "\x87\x11": "炕",
    "\x87\x12": "炎",
    "\x87\x13": "炉",
    "\x87\x14": "炔",
    "\x87\x15": "沫",
    "\x87\x16": "浅",
    "\x87\x17": "法",
    "\x87\x18": "泔",
    "\x87\x19": "泄",
    "\x87\x1A": "沽",
    "\x87\x1B": "沭",
    "\x87\x1C": "河",
    "\x87\x1D": "泷",
    "\x87\x1E": "沾",
    "\x87\x1F": "泸",
    "\x87\x20": "沮",
    "\x87\x21": "泪",
    "\x87\x22": "油",
    "\x87\x23": "泱",
    "\x87\x24": "泅",
    "\x87\x25": "泗",
    "\x87\x26": "泊",
    "\x87\x27": "泠",
    "\x87\x28": "泜",
    "\x87\x29": "泺",
    "\x87\x2A": "泃",
    "\x87\x2B": "沿",
    "\x87\x2C": "泖",
    "\x87\x2D": "泡",
    "\x87\x2E": "注",
    "\x87\x2F": "泣",
    "\x87\x30": "泫",
    "\x87\x31": "泮",
    "\x87\x32": "泞",
    "\x87\x33": "沱",
    "\x87\x34": "泻",
    "\x87\x35": "泌",
    "\x87\x36": "泳",
    "\x87\x37": "泥",
    "\x87\x38": "泯",
    "\x87\x39": "沸",
    "\x87\x3A": "泓",
    "\x87\x3B": "沼",
    "\x87\x3C": "波",
    "\x87\x3D": "泼",
    "\x87\x3E": "泽",
    "\x87\x3F": "泾",
    "\x87\x40": "治",
    "\x87\x41": "怔",
    "\x87\x42": "怯",
    "\x87\x43": "怙",
    "\x87\x44": "怵",
    "\x87\x45": "怖",
    "\x87\x46": "怦",
    "\x87\x47": "怛",
    "\x87\x48": "怏",
    "\x87\x49": "性",
    "\x87\x4A": "怍",
    "\x87\x4B": "怕",
    "\x87\x4C": "怜",
    "\x87\x4D": "怩",
    "\x87\x4E": "怫",
    "\x87\x4F": "怊",
    "\x87\x50": "怿",
    "\x87\x51": "怪",
    "\x87\x52": "怡",
    "\x87\x53": "学",
    "\x87\x54": "宝",
    "\x87\x55": "宗",
    "\x87\x56": "定",
    "\x87\x57": "宕",
    "\x87\x58": "宠",
    "\x87\x59": "宜",
    "\x87\x5A": "审",
    "\x87\x5B": "宙",
    "\x87\x5C": "官",
    "\x87\x5D": "空",
    "\x87\x5E": "帘",
    "\x87\x5F": "穸",
    "\x87\x60": "穹",
    "\x87\x61": "宛",
    "\x87\x62": "实",
    "\x87\x63": "宓",
    "\x87\x64": "诓",
    "\x87\x65": "诔",
    "\x87\x66": "试",
    "\x87\x67": "郎",
    "\x87\x68": "诖",
    "\x87\x69": "诗",
    "\x87\x6A": "诘",
    "\x87\x6B": "戾",
    "\x87\x6C": "肩",
    "\x87\x6D": "房",
    "\x87\x6E": "诙",
    "\x87\x6F": "戽",
    "\x87\x70": "诚",
    "\x87\x71": "郓",
    "\x87\x72": "衬",
    "\x87\x73": "衫",
    "\x87\x74": "衩",
    "\x87\x75": "祆",
    "\x87\x76": "祎",
    "\x87\x77": "祉",
    "\x87\x78": "视",
    "\x87\x79": "祈",
    "\x87\x7A": "诛",
    "\x87\x7B": "诜",
    "\x87\x7C": "话",
    "\x87\x7D": "诞",
    "\x87\x7E": "诟",
    "\x87\x7F": "诠",
    "\x87\x80": "诡",
    "\x87\x81": "询",
    "\x87\x82": "诣",
    "\x87\x83": "诤",
    "\x87\x84": "该",
    "\x87\x85": "详",
    "\x87\x86": "诧",
    "\x87\x87": "诨",
    "\x87\x88": "诩",
    "\x87\x89": "建",
    "\x87\x8A": "肃",
    "\x87\x8B": "隶",
    "\x87\x8C": "录",
    "\x87\x8D": "帚",
    "\x87\x8E": "屉",
    "\x87\x8F": "居",
    "\x87\x90": "届",
    "\x87\x91": "刷",
    "\x87\x92": "鸤",
    "\x87\x93": "屈",
    "\x87\x94": "弧",
    "\x87\x95": "弥",
    "\x87\x96": "弦",
    "\x87\x97": "承",
    "\x87\x98": "孟",
    "\x87\x99": "陋",
    "\x87\x9A": "戕",
    "\x87\x9B": "陌",
    "\x87\x9C": "孤",
    "\x87\x9D": "孢",
    "\x87\x9E": "陕",
    "\x87\x9F": "亟",
    "\x87\xA0": "降",
    "\x87\xA1": "函",
    "\x87\xA2": "陔",
    "\x87\xA3": "限",
    "\x87\xA4": "卺",
    "\x87\xA5": "妹",
    "\x87\xA6": "姑",
    "\x87\xA7": "姐",
    "\x87\xA8": "妲",
    "\x87\xA9": "妯",
    "\x87\xAA": "姓",
    "\x87\xAB": "姗",
    "\x87\xAC": "妮",
    "\x87\xAD": "始",
    "\x87\xAE": "帑",
    "\x87\xAF": "弩",
    "\x87\xB0": "孥",
    "\x87\xB1": "驽",
    "\x87\xB2": "姆",
    "\x87\xB3": "虱",
    "\x87\xB4": "迦",
    "\x87\xB5": "迢",
    "\x87\xB6": "驾",
    "\x87\xB7": "叁",
    "\x87\xB8": "参",
    "\x87\xB9": "迨",
    "\x87\xBA": "艰",
    "\x87\xBB": "线",
    "\x87\xBC": "绀",
    "\x87\xBD": "绁",
    "\x87\xBE": "绂",
    "\x87\xBF": "练",
    "\x87\xC0": "驵",
    "\x87\xC1": "组",
    "\x87\xC2": "绅",
    "\x87\xC3": "细",
    "\x87\xC4": "驶",
    "\x87\xC5": "织",
    "\x87\xC6": "驷",
    "\x87\xC7": "驸",
    "\x87\xC8": "驹",
    "\x87\xC9": "终",
    "\x87\xCA": "绉",
    "\x87\xCB": "驺",
    "\x87\xCC": "驻",
    "\x87\xCD": "绊",
    "\x87\xCE": "驼",
    "\x87\xCF": "绋",
    "\x87\xD0": "绌",
    "\x87\xD1": "绍",
    "\x87\xD2": "驿",
    "\x87\xD3": "绎",
    "\x87\xD4": "经",
    "\x87\xD5": "骀",
    "\x87\xD6": "贯",
    "\x87\xD7": "甾",
    "\x87\xD8": "砉",
    "\x87\xD9": "耔",
    "\x87\xDA": "契",
    "\x87\xDB": "贰",
    "\x87\xDC": "奏",
    "\x87\xDD": "春",
    "\x87\xDE": "帮",
    "\x87\xDF": "珏",
    "\x87\xE0": "珐",
    "\x87\xE1": "珂",
    "\x87\xE2": "珑",
    "\x87\xE3": "玷",
    "\x87\xE4": "玳",
    "\x87\xE5": "珀",
    "\x87\xE6": "顸",
    "\x87\xE7": "珍",
    "\x87\xE8": "玲",
    "\x87\xE9": "珊",
    "\x87\xEA": "珉",
    "\x87\xEB": "珈",
    "\x87\xEC": "玻",
    "\x87\xED": "毒",
    "\x87\xEE": "型",
    "\x87\xEF": "韨",
    "\x87\xF0": "拭",
    "\x87\xF1": "挂",
    "\x87\xF2": "封",
    "\x87\xF3": "持",
    "\x87\xF4": "拮",
    "\x87\xF5": "拷",
    "\x87\xF6": "拱",
    "\x87\xF7": "垭",
    "\x87\xF8": "挝",
    "\x87\xF9": "垣",
    "\x87\xFA": "项",
    "\x87\xFB": "垮",
    "\x87\xFC": "挎",
    "\x87\xFD": "垯",
    "\x87\xFE": "挞",
    "\x87\xFF": "城",
    "\x88\x01": "挟",
    "\x88\x02": "挠",
    "\x88\x03": "垤",
    "\x88\x04": "政",
    "\x88\x05": "赴",
    "\x88\x06": "赵",
    "\x88\x07": "赳",
    "\x88\x08": "贲",
    "\x88\x09": "垱",
    "\x88\x0A": "挡",
    "\x88\x0B": "拽",
    "\x88\x0C": "垌",
    "\x88\x0D": "哉",
    "\x88\x0E": "垲",
    "\x88\x0F": "挺",
    "\x88\x10": "括",
    "\x88\x11": "挢",
    "\x88\x12": "埏",
    "\x88\x13": "郝",
    "\x88\x14": "垍",
    "\x88\x15": "垧",
    "\x88\x16": "垢",
    "\x88\x17": "拴",
    "\x88\x18": "拾",
    "\x88\x19": "挑",
    "\x88\x1A": "垛",
    "\x88\x1B": "指",
    "\x88\x1C": "垫",
    "\x88\x1D": "挣",
    "\x88\x1E": "挤",
    "\x88\x1F": "垓",
    "\x88\x20": "垟",
    "\x88\x21": "拼",
    "\x88\x22": "垞",
    "\x88\x23": "挖",
    "\x88\x24": "按",
    "\x88\x25": "挥",
    "\x88\x26": "挦",
    "\x88\x27": "挪",
    "\x88\x28": "垠",
    "\x88\x29": "拯",
    "\x88\x2A": "拶",
    "\x88\x2B": "某",
    "\x88\x2C": "甚",
    "\x88\x2D": "荆",
    "\x88\x2E": "茸",
    "\x88\x2F": "革",
    "\x88\x30": "茜",
    "\x88\x31": "茬",
    "\x88\x32": "荐",
    "\x88\x33": "荙",
    "\x88\x34": "巷",
    "\x88\x35": "荚",
    "\x88\x36": "荑",
    "\x88\x37": "贳",
    "\x88\x38": "荛",
    "\x88\x39": "荜",
    "\x88\x3A": "茈",
    "\x88\x3B": "带",
    "\x88\x3C": "草",
    "\x88\x3D": "茧",
    "\x88\x3E": "茼",
    "\x88\x3F": "莒",
    "\x88\x40": "茵",
    "\x88\x41": "茴",
    "\x88\x42": "茱",
    "\x88\x43": "莛",
    "\x88\x44": "荞",
    "\x88\x45": "茯",
    "\x88\x46": "荏",
    "\x88\x47": "荇",
    "\x88\x48": "荃",
    "\x88\x49": "荟",
    "\x88\x4A": "茶",
    "\x88\x4B": "荀",
    "\x88\x4C": "茗",
    "\x88\x4D": "荠",
    "\x88\x4E": "茭",
    "\x88\x4F": "茨",
    "\x88\x50": "荒",
    "\x88\x51": "垩",
    "\x88\x52": "茳",
    "\x88\x53": "茫",
    "\x88\x54": "荡",
    "\x88\x55": "荣",
    "\x88\x56": "荤",
    "\x88\x57": "荥",
    "\x88\x58": "荦",
    "\x88\x59": "荧",
    "\x88\x5A": "荨",
    "\x88\x5B": "茛",
    "\x88\x5C": "故",
    "\x88\x5D": "荩",
    "\x88\x5E": "胡",
    "\x88\x5F": "荪",
    "\x88\x60": "荫",
    "\x88\x61": "茹",
    "\x88\x62": "荔",
    "\x88\x63": "南",
    "\x88\x64": "荬",
    "\x88\x65": "荭",
    "\x88\x66": "药",
    "\x88\x67": "柰",
    "\x88\x68": "标",
    "\x88\x69": "栈",
    "\x88\x6A": "柑",
    "\x88\x6B": "枯",
    "\x88\x6C": "栉",
    "\x88\x6D": "柯",
    "\x88\x6E": "柄",
    "\x88\x6F": "柘",
    "\x88\x70": "栊",
    "\x88\x71": "柩",
    "\x88\x72": "枰",
    "\x88\x73": "栋",
    "\x88\x74": "栌",
    "\x88\x75": "相",
    "\x88\x76": "查",
    "\x88\x77": "柙",
    "\x88\x78": "枵",
    "\x88\x79": "柚",
    "\x88\x7A": "枳",
    "\x88\x7B": "柞",
    "\x88\x7C": "柏",
    "\x88\x7D": "柝",
    "\x88\x7E": "栀",
    "\x88\x7F": "柃",
    "\x88\x80": "柢",
    "\x88\x81": "栎",
    "\x88\x82": "枸",
    "\x88\x83": "栅",
    "\x88\x84": "柳",
    "\x88\x85": "柱",
    "\x88\x86": "柿",
    "\x88\x87": "栏",
    "\x88\x88": "柈",
    "\x88\x89": "柠",
    "\x88\x8A": "柁",
    "\x88\x8B": "枷",
    "\x88\x8C": "柽",
    "\x88\x8D": "树",
    "\x88\x8E": "勃",
    "\x88\x8F": "剌",
    "\x88\x90": "郚",
    "\x88\x91": "剅",
    "\x88\x92": "要",
    "\x88\x93": "酊",
    "\x88\x94": "郦",
    "\x88\x95": "柬",
    "\x88\x96": "咸",
    "\x88\x97": "威",
    "\x88\x98": "歪",
    "\x88\x99": "甭",
    "\x88\x9A": "研",
    "\x88\x9B": "砖",
    "\x88\x9C": "厘",
    "\x88\x9D": "砗",
    "\x88\x9E": "厚",
    "\x88\x9F": "砑",
    "\x88\xA0": "砘",
    "\x88\xA1": "砒",
    "\x88\xA2": "砌",
    "\x88\xA3": "砂",
    "\x88\xA4": "泵",
    "\x88\xA5": "砚",
    "\x88\xA6": "斫",
    "\x88\xA7": "砭",
    "\x88\xA8": "砜",
    "\x88\xA9": "砍",
    "\x88\xAA": "面",
    "\x88\xAB": "耐",
    "\x88\xAC": "耍",
    "\x88\xAD": "奎",
    "\x88\xAE": "耷",
    "\x88\xAF": "牵",
    "\x88\xB0": "鸥",
    "\x88\xB1": "虺",
    "\x88\xB2": "残",
    "\x88\xB3": "殂",
    "\x88\xB4": "殃",
    "\x88\xB5": "殇",
    "\x88\xB6": "殄",
    "\x88\xB7": "殆",
    "\x88\xB8": "轱",
    "\x88\xB9": "轲",
    "\x88\xBA": "轳",
    "\x88\xBB": "轴",
    "\x88\xBC": "轵",
    "\x88\xBD": "轶",
    "\x88\xBE": "轷",
    "\x88\xBF": "轸",
    "\x88\xC0": "轹",
    "\x88\xC1": "轺",
    "\x88\xC2": "轻",
    "\x88\xC3": "鸦",
    "\x88\xC4": "虿",
    "\x88\xC5": "皆",
    "\x88\xC6": "毖",
    "\x88\xC7": "韭",
    "\x88\xC8": "背",
    "\x88\xC9": "战",
    "\x88\xCA": "觇",
    "\x88\xCB": "点",
    "\x88\xCC": "虐",
    "\x88\xCD": "临",
    "\x88\xCE": "览",
    "\x88\xCF": "竖",
    "\x88\xD0": "尜",
    "\x88\xD1": "省",
    "\x88\xD2": "削",
    "\x88\xD3": "尝",
    "\x88\xD4": "哐",
    "\x88\xD5": "昧",
    "\x88\xD6": "眄",
    "\x88\xD7": "眍",
    "\x88\xD8": "盹",
    "\x88\xD9": "是",
    "\x88\xDA": "郢",
    "\x88\xDB": "眇",
    "\x88\xDC": "眊",
    "\x88\xDD": "盼",
    "\x88\xDE": "眨",
    "\x88\xDF": "昽",
    "\x88\xE0": "眈",
    "\x88\xE1": "哇",
    "\x88\xE2": "咭",
    "\x88\xE3": "哄",
    "\x88\xE4": "哑",
    "\x88\xE5": "显",
    "\x88\xE6": "冒",
    "\x88\xE7": "映",
    "\x88\xE8": "禺",
    "\x88\xE9": "哂",
    "\x88\xEA": "星",
    "\x88\xEB": "昨",
    "\x88\xEC": "咴",
    "\x88\xED": "曷",
    "\x88\xEE": "昴",
    "\x88\xEF": "咧",
    "\x88\xF0": "昱",
    "\x88\xF1": "昵",
    "\x88\xF2": "咦",
    "\x88\xF3": "哓",
    "\x88\xF4": "昭",
    "\x88\xF5": "哔",
    "\x88\xF6": "畎",
    "\x88\xF7": "畏",
    "\x88\xF8": "毗",
    "\x88\xF9": "趴",
    "\x88\xFA": "呲",
    "\x88\xFB": "胄",
    "\x88\xFC": "胃",
    "\x88\xFD": "贵",
    "\x88\xFE": "畋",
    "\x88\xFF": "畈",
    "\x89\x01": "界",
    "\x89\x02": "虹",
    "\x89\x03": "虾",
    "\x89\x04": "虼",
    "\x89\x05": "虻",
    "\x89\x06": "蚁",
    "\x89\x07": "思",
    "\x89\x08": "蚂",
    "\x89\x09": "盅",
    "\x89\x0A": "咣",
    "\x89\x0B": "虽",
    "\x89\x0C": "品",
    "\x89\x0D": "咽",
    "\x89\x0E": "骂",
    "\x89\x0F": "哕",
    "\x89\x10": "剐",
    "\x89\x11": "郧",
    "\x89\x12": "勋",
    "\x89\x13": "咻",
    "\x89\x14": "哗",
    "\x89\x15": "囿",
    "\x89\x16": "咱",
    "\x89\x17": "咿",
    "\x89\x18": "响",
    "\x89\x19": "哌",
    "\x89\x1A": "哙",
    "\x89\x1B": "哈",
    "\x89\x1C": "哚",
    "\x89\x1D": "咯",
    "\x89\x1E": "哆",
    "\x89\x1F": "咬",
    "\x89\x20": "咳",
    "\x89\x21": "咩",
    "\x89\x22": "咪",
    "\x89\x23": "咤",
    "\x89\x24": "哝",
    "\x89\x25": "哪",
    "\x89\x26": "哏",
    "\x89\x27": "哞",
    "\x89\x28": "哟",
    "\x89\x29": "峙",
    "\x89\x2A": "炭",
    "\x89\x2B": "峡",
    "\x89\x2C": "峣",
    "\x89\x2D": "罘",
    "\x89\x2E": "帧",
    "\x89\x2F": "罚",
    "\x89\x30": "峒",
    "\x89\x31": "峤",
    "\x89\x32": "峋",
    "\x89\x33": "峥",
    "\x89\x34": "峧",
    "\x89\x35": "帡",
    "\x89\x36": "贱",
    "\x89\x37": "贴",
    "\x89\x38": "贶",
    "\x89\x39": "贻",
    "\x89\x3A": "骨",
    "\x89\x3B": "幽",
    "\x89\x3C": "钘",
    "\x89\x3D": "钙",
    "\x89\x3E": "钚",
    "\x89\x3F": "钛",
    "\x89\x40": "钝",
    "\x89\x41": "钞",
    "\x89\x42": "钟",
    "\x89\x43": "钡",
    "\x89\x44": "钠",
    "\x89\x45": "钢",
    "\x89\x46": "钣",
    "\x89\x47": "钤",
    "\x89\x48": "钥",
    "\x89\x49": "钦",
    "\x89\x4A": "钧",
    "\x89\x4B": "钨",
    "\x89\x4C": "钩",
    "\x89\x4D": "钪",
    "\x89\x4E": "钫",
    "\x89\x4F": "钬",
    "\x89\x50": "钭",
    "\x89\x51": "钮",
    "\x89\x52": "钯",
    "\x89\x53": "卸",
    "\x89\x54": "缸",
    "\x89\x55": "拜",
    "\x89\x56": "看",
    "\x89\x57": "矩",
    "\x89\x58": "矧",
    "\x89\x59": "毡",
    "\x89\x5A": "氡",
    "\x89\x5B": "氟",
    "\x89\x5C": "氢",
    "\x89\x5D": "牯",
    "\x89\x5E": "怎",
    "\x89\x5F": "郜",
    "\x89\x60": "牲",
    "\x89\x61": "选",
    "\x89\x62": "适",
    "\x89\x63": "秕",
    "\x89\x64": "秒",
    "\x89\x65": "香",
    "\x89\x66": "种",
    "\x89\x67": "秭",
    "\x89\x68": "秋",
    "\x89\x69": "科",
    "\x89\x6A": "重",
    "\x89\x6B": "复",
    "\x89\x6C": "竽",
    "\x89\x6D": "竿",
    "\x89\x6E": "笈",
    "\x89\x6F": "笃",
    "\x89\x70": "俦",
    "\x89\x71": "段",
    "\x89\x72": "俨",
    "\x89\x73": "俅",
    "\x89\x74": "便",
    "\x89\x75": "俩",
    "\x89\x76": "俪",
    "\x89\x77": "叟",
    "\x89\x78": "垡",
    "\x89\x79": "贷",
    "\x89\x7A": "牮",
    "\x89\x7B": "顺",
    "\x89\x7C": "修",
    "\x89\x7D": "俏",
    "\x89\x7E": "俣",
    "\x89\x7F": "俚",
    "\x89\x80": "保",
    "\x89\x81": "俜",
    "\x89\x82": "促",
    "\x89\x83": "俄",
    "\x89\x84": "俐",
    "\x89\x85": "侮",
    "\x89\x86": "俭",
    "\x89\x87": "俗",
    "\x89\x88": "俘",
    "\x89\x89": "信",
    "\x89\x8A": "皇",
    "\x89\x8B": "泉",
    "\x89\x8C": "皈",
    "\x89\x8D": "鬼",
    "\x89\x8E": "侵",
    "\x89\x8F": "禹",
    "\x89\x90": "侯",
    "\x89\x91": "追",
    "\x89\x92": "俑",
    "\x89\x93": "俟",
    "\x89\x94": "俊",
    "\x89\x95": "盾",
    "\x89\x96": "逅",
    "\x89\x97": "待",
    "\x89\x98": "徊",
    "\x89\x99": "徇",
    "\x89\x9A": "徉",
    "\x89\x9B": "衍",
    "\x89\x9C": "律",
    "\x89\x9D": "很",
    "\x89\x9E": "须",
    "\x89\x9F": "舢",
    "\x89\xA0": "舣",
    "\x89\xA1": "叙",
    "\x89\xA2": "俞",
    "\x89\xA3": "弇",
    "\x89\xA4": "郗",
    "\x89\xA5": "剑",
    "\x89\xA6": "逃",
    "\x89\xA7": "俎",
    "\x89\xA8": "卻",
    "\x89\xA9": "爰",
    "\x89\xAA": "郛",
    "\x89\xAB": "食",
    "\x89\xAC": "瓴",
    "\x89\xAD": "盆",
    "\x89\xAE": "胚",
    "\x89\xAF": "胧",
    "\x89\xB0": "胨",
    "\x89\xB1": "胩",
    "\x89\xB2": "胪",
    "\x89\xB3": "胆",
    "\x89\xB4": "胛",
    "\x89\xB5": "胂",
    "\x89\xB6": "胜",
    "\x89\xB7": "胙",
    "\x89\xB8": "胍",
    "\x89\xB9": "胗",
    "\x89\xBA": "胝",
    "\x89\xBB": "朐",
    "\x89\xBC": "胞",
    "\x89\xBD": "胖",
    "\x89\xBE": "脉",
    "\x89\xBF": "胫",
    "\x89\xC0": "胎",
    "\x89\xC1": "鸨",
    "\x89\xC2": "匍",
    "\x89\xC3": "勉",
    "\x89\xC4": "狨",
    "\x89\xC5": "狭",
    "\x89\xC6": "狮",
    "\x89\xC7": "独",
    "\x89\xC8": "狯",
    "\x89\xC9": "狰",
    "\x89\xCA": "狡",
    "\x89\xCB": "飐",
    "\x89\xCC": "飑",
    "\x89\xCD": "狩",
    "\x89\xCE": "狱",
    "\x89\xCF": "狠",
    "\x89\xD0": "狲",
    "\x89\xD1": "訇",
    "\x89\xD2": "訄",
    "\x89\xD3": "逄",
    "\x89\xD4": "昝",
    "\x89\xD5": "贸",
    "\x89\xD6": "怨",
    "\x89\xD7": "急",
    "\x89\xD8": "饵",
    "\x89\xD9": "饶",
    "\x89\xDA": "蚀",
    "\x89\xDB": "饷",
    "\x89\xDC": "饸",
    "\x89\xDD": "饹",
    "\x89\xDE": "饺",
    "\x89\xDF": "饻",
    "\x89\xE0": "胤",
    "\x89\xE1": "饼",
    "\x89\xE2": "峦",
    "\x89\xE3": "弯",
    "\x89\xE4": "孪",
    "\x89\xE5": "娈",
    "\x89\xE6": "将",
    "\x89\xE7": "奖",
    "\x89\xE8": "哀",
    "\x89\xE9": "亭",
    "\x89\xEA": "亮",
    "\x89\xEB": "庤",
    "\x89\xEC": "度",
    "\x89\xED": "弈",
    "\x89\xEE": "奕",
    "\x89\xEF": "迹",
    "\x89\xF0": "庭",
    "\x89\xF1": "庥",
    "\x89\xF2": "疬",
    "\x89\xF3": "疣",
    "\x89\xF4": "疥",
    "\x89\xF5": "疭",
    "\x89\xF6": "疮",
    "\x89\xF7": "疯",
    "\x89\xF8": "疫",
    "\x89\xF9": "疢",
    "\x89\xFA": "疤",
    "\x89\xFB": "庠",
    "\x89\xFC": "咨",
    "\x89\xFD": "姿",
    "\x89\xFE": "亲",
    "\x89\xFF": "竑",
    "\x8A\x01": "音",
    "\x8A\x02": "彦",
    "\x8A\x03": "飒",
    "\x8A\x04": "帝",
    "\x8A\x05": "施",
    "\x8A\x06": "闺",
    "\x8A\x07": "闻",
    "\x8A\x08": "闼",
    "\x8A\x09": "闽",
    "\x8A\x0A": "闾",
    "\x8A\x0B": "闿",
    "\x8A\x0C": "阀",
    "\x8A\x0D": "阁",
    "\x8A\x0E": "阂",
    "\x8A\x0F": "差",
    "\x8A\x10": "养",
    "\x8A\x11": "美",
    "\x8A\x12": "羑",
    "\x8A\x13": "姜",
    "\x8A\x14": "迸",
    "\x8A\x15": "叛",
    "\x8A\x16": "送",
    "\x8A\x17": "类",
    "\x8A\x18": "籼",
    "\x8A\x19": "迷",
    "\x8A\x1A": "籽",
    "\x8A\x1B": "娄",
    "\x8A\x1C": "前",
    "\x8A\x1D": "酋",
    "\x8A\x1E": "首",
    "\x8A\x1F": "逆",
    "\x8A\x20": "兹",
    "\x8A\x21": "总",
    "\x8A\x22": "炳",
    "\x8A\x23": "炻",
    "\x8A\x24": "炼",
    "\x8A\x25": "炟",
    "\x8A\x26": "炽",
    "\x8A\x27": "炯",
    "\x8A\x28": "炸",
    "\x8A\x29": "烀",
    "\x8A\x2A": "烁",
    "\x8A\x2B": "炮",
    "\x8A\x2C": "炷",
    "\x8A\x2D": "炫",
    "\x8A\x2E": "烂",
    "\x8A\x2F": "烃",
    "\x8A\x30": "剃",
    "\x8A\x31": "洼",
    "\x8A\x32": "洁",
    "\x8A\x33": "洱",
    "\x8A\x34": "洪",
    "\x8A\x35": "洹",
    "\x8A\x36": "洒",
    "\x8A\x37": "洧",
    "\x8A\x38": "洌",
    "\x8A\x39": "浃",
    "\x8A\x3A": "柒",
    "\x8A\x3B": "浇",
    "\x8A\x3C": "泚",
    "\x8A\x3D": "浈",
    "\x8A\x3E": "浉",
    "\x8A\x3F": "浊",
    "\x8A\x40": "洞",
    "\x8A\x41": "洇",
    "\x8A\x42": "洄",
    "\x8A\x43": "测",
    "\x8A\x44": "洙",
    "\x8A\x45": "洗",
    "\x8A\x46": "活",
    "\x8A\x47": "洑",
    "\x8A\x48": "涎",
    "\x8A\x49": "洎",
    "\x8A\x4A": "洫",
    "\x8A\x4B": "派",
    "\x8A\x4C": "浍",
    "\x8A\x4D": "洽",
    "\x8A\x4E": "洮",
    "\x8A\x4F": "染",
    "\x8A\x50": "洵",
    "\x8A\x51": "洚",
    "\x8A\x52": "洺",
    "\x8A\x53": "洛",
    "\x8A\x54": "浏",
    "\x8A\x55": "济",
    "\x8A\x56": "洨",
    "\x8A\x57": "浐",
    "\x8A\x58": "洋",
    "\x8A\x59": "洴",
    "\x8A\x5A": "洣",
    "\x8A\x5B": "洲",
    "\x8A\x5C": "浑",
    "\x8A\x5D": "浒",
    "\x8A\x5E": "浓",
    "\x8A\x5F": "津",
    "\x8A\x60": "浔",
    "\x8A\x61": "浕",
    "\x8A\x62": "洳",
    "\x8A\x63": "恸",
    "\x8A\x64": "恃",
    "\x8A\x65": "恒",
    "\x8A\x66": "恹",
    "\x8A\x67": "恢",
    "\x8A\x68": "恍",
    "\x8A\x69": "恫",
    "\x8A\x6A": "恺",
    "\x8A\x6B": "恻",
    "\x8A\x6C": "恬",
    "\x8A\x6D": "恤",
    "\x8A\x6E": "恰",
    "\x8A\x6F": "恂",
    "\x8A\x70": "恪",
    "\x8A\x71": "恼",
    "\x8A\x72": "恽",
    "\x8A\x73": "恨",
    "\x8A\x74": "举",
    "\x8A\x75": "觉",
    "\x8A\x76": "宣",
    "\x8A\x77": "宦",
    "\x8A\x78": "宥",
    "\x8A\x79": "宬",
    "\x8A\x7A": "室",
    "\x8A\x7B": "宫",
    "\x8A\x7C": "宪",
    "\x8A\x7D": "突",
    "\x8A\x7E": "穿",
    "\x8A\x7F": "窀",
    "\x8A\x80": "窃",
    "\x8A\x81": "客",
    "\x8A\x82": "诫",
    "\x8A\x83": "冠",
    "\x8A\x84": "诬",
    "\x8A\x85": "语",
    "\x8A\x86": "扁",
    "\x8A\x87": "扃",
    "\x8A\x88": "袆",
    "\x8A\x89": "衲",
    "\x8A\x8A": "衽",
    "\x8A\x8B": "袄",
    "\x8A\x8C": "衿",
    "\x8A\x8D": "袂",
    "\x8A\x8E": "祛",
    "\x8A\x8F": "祜",
    "\x8A\x90": "祓",
    "\x8A\x91": "祖",
    "\x8A\x92": "神",
    "\x8A\x93": "祝",
    "\x8A\x94": "祚",
    "\x8A\x95": "诮",
    "\x8A\x96": "祗",
    "\x8A\x97": "祢",
    "\x8A\x98": "祠",
    "\x8A\x99": "误",
    "\x8A\x9A": "诰",
    "\x8A\x9B": "诱",
    "\x8A\x9C": "诲",
    "\x8A\x9D": "诳",
    "\x8A\x9E": "鸩",
    "\x8A\x9F": "说",
    "\x8A\xA0": "昶",
    "\x8A\xA1": "诵",
    "\x8A\xA2": "郡",
    "\x8A\xA3": "垦",
    "\x8A\xA4": "退",
    "\x8A\xA5": "既",
    "\x8A\xA6": "屋",
    "\x8A\xA7": "昼",
    "\x8A\xA8": "咫",
    "\x8A\xA9": "屏",
    "\x8A\xAA": "屎",
    "\x8A\xAB": "弭",
    "\x8A\xAC": "费",
    "\x8A\xAD": "陡",
    "\x8A\xAE": "逊",
    "\x8A\xAF": "牁",
    "\x8A\xB0": "眉",
    "\x8A\xB1": "胥",
    "\x8A\xB2": "孩",
    "\x8A\xB3": "陛",
    "\x8A\xB4": "陟",
    "\x8A\xB5": "陧",
    "\x8A\xB6": "陨",
    "\x8A\xB7": "除",
    "\x8A\xB8": "险",
    "\x8A\xB9": "院",
    "\x8A\xBA": "娃",
    "\x8A\xBB": "姞",
    "\x8A\xBC": "姥",
    "\x8A\xBD": "娅",
    "\x8A\xBE": "姨",
    "\x8A\xBF": "娆",
    "\x8A\xC0": "姻",
    "\x8A\xC1": "姝",
    "\x8A\xC2": "娇",
    "\x8A\xC3": "姚",
    "\x8A\xC4": "姽",
    "\x8A\xC5": "姣",
    "\x8A\xC6": "姘",
    "\x8A\xC7": "姹",
    "\x8A\xC8": "娜",
    "\x8A\xC9": "怒",
    "\x8A\xCA": "架",
    "\x8A\xCB": "贺",
    "\x8A\xCC": "盈",
    "\x8A\xCD": "怼",
    "\x8A\xCE": "羿",
    "\x8A\xCF": "勇",
    "\x8A\xD0": "炱",
    "\x8A\xD1": "怠",
    "\x8A\xD2": "癸",
    "\x8A\xD3": "蚤",
    "\x8A\xD4": "柔",
    "\x8A\xD5": "矜",
    "\x8A\xD6": "垒",
    "\x8A\xD7": "绑",
    "\x8A\xD8": "绒",
    "\x8A\xD9": "结",
    "\x8A\xDA": "绔",
    "\x8A\xDB": "骁",
    "\x8A\xDC": "绕",
    "\x8A\xDD": "骄",
    "\x8A\xDE": "骅",
    "\x8A\xDF": "绗",
    "\x8A\xE0": "绘",
    "\x8A\xE1": "给",
    "\x8A\xE2": "绚",
    "\x8A\xE3": "彖",
    "\x8A\xE4": "绛",
    "\x8A\xE5": "络",
    "\x8A\xE6": "骆",
    "\x8A\xE7": "绝",
    "\x8A\xE8": "绞",
    "\x8A\xE9": "骇",
    "\x8A\xEA": "统",
    "\x8A\xEB": "骈",
    "\x8A\xEC": "耕",
    "\x8A\xED": "耘",
    "\x8A\xEE": "耖",
    "\x8A\xEF": "耗",
    "\x8A\xF0": "耙",
    "\x8A\xF1": "艳",
    "\x8A\xF2": "挈",
    "\x8A\xF3": "恝",
    "\x8A\xF4": "泰",
    "\x8A\xF5": "秦",
    "\x8A\xF6": "珥",
    "\x8A\xF7": "珙",
    "\x8A\xF8": "顼",
    "\x8A\xF9": "珰",
    "\x8A\xFA": "珠",
    "\x8A\xFB": "珽",
    "\x8A\xFC": "珩",
    "\x8A\xFD": "珧",
    "\x8A\xFE": "珣",
    "\x8A\xFF": "珞",
    "\x8B\x01": "琤",
    "\x8B\x02": "班",
    "\x8B\x03": "珲",
    "\x8B\x04": "敖",
    "\x8B\x05": "素",
    "\x8B\x06": "匿",
    "\x8B\x07": "蚕",
    "\x8B\x08": "顽",
    "\x8B\x09": "盏",
    "\x8B\x0A": "匪",
    "\x8B\x0B": "恚",
    "\x8B\x0C": "捞",
    "\x8B\x0D": "栽",
    "\x8B\x0E": "捕",
    "\x8B\x0F": "埔",
    "\x8B\x10": "埂",
    "\x8B\x11": "捂",
    "\x8B\x12": "振",
    "\x8B\x13": "载",
    "\x8B\x14": "赶",
    "\x8B\x15": "起",
    "\x8B\x16": "盐",
    "\x8B\x17": "捎",
    "\x8B\x18": "捍",
    "\x8B\x19": "埕",
    "\x8B\x1A": "捏",
    "\x8B\x1B": "埘",
    "\x8B\x1C": "埋",
    "\x8B\x1D": "捉",
    "\x8B\x1E": "捆",
    "\x8B\x1F": "捐",
    "\x8B\x20": "埚",
    "\x8B\x21": "埙",
    "\x8B\x22": "损",
    "\x8B\x23": "袁",
    "\x8B\x24": "挹",
    "\x8B\x25": "捌",
    "\x8B\x26": "都",
    "\x8B\x27": "哲",
    "\x8B\x28": "逝",
    "\x8B\x29": "耆",
    "\x8B\x2A": "耄",
    "\x8B\x2B": "捡",
    "\x8B\x2C": "挫",
    "\x8B\x2D": "捋",
    "\x8B\x2E": "埒",
    "\x8B\x2F": "换",
    "\x8B\x30": "挽",
    "\x8B\x31": "贽",
    "\x8B\x32": "挚",
    "\x8B\x33": "热",
    "\x8B\x34": "恐",
    "\x8B\x35": "捣",
    "\x8B\x36": "垸",
    "\x8B\x37": "壶",
    "\x8B\x38": "捃",
    "\x8B\x39": "捅",
    "\x8B\x3A": "盍",
    "\x8B\x3B": "埃",
    "\x8B\x3C": "挨",
    "\x8B\x3D": "耻",
    "\x8B\x3E": "耿",
    "\x8B\x3F": "耽",
    "\x8B\x40": "聂",
    "\x8B\x41": "莰",
    "\x8B\x42": "茝",
    "\x8B\x43": "荸",
    "\x8B\x44": "莆",
    "\x8B\x45": "恭",
    "\x8B\x46": "莽",
    "\x8B\x47": "莱",
    "\x8B\x48": "莲",
    "\x8B\x49": "莳",
    "\x8B\x4A": "莫",
    "\x8B\x4B": "莴",
    "\x8B\x4C": "莪",
    "\x8B\x4D": "莉",
    "\x8B\x4E": "莠",
    "\x8B\x4F": "莓",
    "\x8B\x50": "荷",
    "\x8B\x51": "莜",
    "\x8B\x52": "莅",
    "\x8B\x53": "荼",
    "\x8B\x54": "莶",
    "\x8B\x55": "莩",
    "\x8B\x56": "荽",
    "\x8B\x57": "获",
    "\x8B\x58": "莸",
    "\x8B\x59": "荻",
    "\x8B\x5A": "莘",
    "\x8B\x5B": "晋",
    "\x8B\x5C": "恶",
    "\x8B\x5D": "莎",
    "\x8B\x5E": "莞",
    "\x8B\x5F": "莹",
    "\x8B\x60": "莨",
    "\x8B\x61": "莺",
    "\x8B\x62": "真",
    "\x8B\x63": "莙",
    "\x8B\x64": "鸪",
    "\x8B\x65": "莼",
    "\x8B\x66": "框",
    "\x8B\x67": "梆",
    "\x8B\x68": "桂",
    "\x8B\x69": "桔",
    "\x8B\x6A": "栲",
    "\x8B\x6B": "栳",
    "\x8B\x6C": "郴",
    "\x8B\x6D": "桓",
    "\x8B\x6E": "栖",
    "\x8B\x6F": "桡",
    "\x8B\x70": "桎",
    "\x8B\x71": "桢",
    "\x8B\x72": "桄",
    "\x8B\x73": "档",
    "\x8B\x74": "桐",
    "\x8B\x75": "桤",
    "\x8B\x76": "株",
    "\x8B\x77": "梃",
    "\x8B\x78": "栝",
    "\x8B\x79": "桥",
    "\x8B\x7A": "桕",
    "\x8B\x7B": "桦",
    "\x8B\x7C": "桁",
    "\x8B\x7D": "栓",
    "\x8B\x7E": "桧",
    "\x8B\x7F": "桃",
    "\x8B\x80": "桅",
    "\x8B\x81": "栒",
    "\x8B\x82": "格",
    "\x8B\x83": "桩",
    "\x8B\x84": "校",
    "\x8B\x85": "核",
    "\x8B\x86": "样",
    "\x8B\x87": "栟",
    "\x8B\x88": "桉",
    "\x8B\x89": "根",
    "\x8B\x8A": "栩",
    "\x8B\x8B": "逑",
    "\x8B\x8C": "索",
    "\x8B\x8D": "逋",
    "\x8B\x8E": "彧",
    "\x8B\x8F": "哥",
    "\x8B\x90": "速",
    "\x8B\x91": "鬲",
    "\x8B\x92": "豇",
    "\x8B\x93": "逗",
    "\x8B\x94": "栗",
    "\x8B\x95": "贾",
    "\x8B\x96": "酐",
    "\x8B\x97": "酎",
    "\x8B\x98": "酌",
    "\x8B\x99": "配",
    "\x8B\x9A": "酏",
    "\x8B\x9B": "逦",
    "\x8B\x9C": "翅",
    "\x8B\x9D": "辱",
    "\x8B\x9E": "唇",
    "\x8B\x9F": "厝",
    "\x8B\xA0": "孬",
    "\x8B\xA1": "夏",
    "\x8B\xA2": "砝",
    "\x8B\xA3": "砹",
    "\x8B\xA4": "砸",
    "\x8B\xA5": "砺",
    "\x8B\xA6": "砰",
    "\x8B\xA7": "砧",
    "\x8B\xA8": "砷",
    "\x8B\xA9": "砟",
    "\x8B\xAA": "砼",
    "\x8B\xAB": "砥",
    "\x8B\xAC": "砾",
    "\x8B\xAD": "砣",
    "\x8B\xAE": "础",
    "\x8B\xAF": "破",
    "\x8B\xB0": "硁",
    "\x8B\xB1": "恧",
    "\x8B\xB2": "原",
    "\x8B\xB3": "套",
    "\x8B\xB4": "剞",
    "\x8B\xB5": "逐",
    "\x8B\xB6": "砻",
    "\x8B\xB7": "烈",
    "\x8B\xB8": "殊",
    "\x8B\xB9": "殉",
    "\x8B\xBA": "顾",
    "\x8B\xBB": "轼",
    "\x8B\xBC": "轾",
    "\x8B\xBD": "轿",
    "\x8B\xBE": "辀",
    "\x8B\xBF": "辁",
    "\x8B\xC0": "辂",
    "\x8B\xC1": "较",
    "\x8B\xC2": "鸫",
    "\x8B\xC3": "顿",
    "\x8B\xC4": "趸",
    "\x8B\xC5": "毙",
    "\x8B\xC6": "致",
    "\x8B\xC7": "剕",
    "\x8B\xC8": "龀",
    "\x8B\xC9": "柴",
    "\x8B\xCA": "桌",
    "\x8B\xCB": "鸬",
    "\x8B\xCC": "虔",
    "\x8B\xCD": "虑",
    "\x8B\xCE": "监",
    "\x8B\xCF": "紧",
    "\x8B\xD0": "逍",
    "\x8B\xD1": "党",
    "\x8B\xD2": "眬",
    "\x8B\xD3": "唛",
    "\x8B\xD4": "逞",
    "\x8B\xD5": "晒",
    "\x8B\xD6": "晟",
    "\x8B\xD7": "眩",
    "\x8B\xD8": "眠",
    "\x8B\xD9": "晓",
    "\x8B\xDA": "眙",
    "\x8B\xDB": "唝",
    "\x8B\xDC": "哧",
    "\x8B\xDD": "哳",
    "\x8B\xDE": "哮",
    "\x8B\xDF": "唠",
    "\x8B\xE0": "鸭",
    "\x8B\xE1": "晃",
    "\x8B\xE2": "哺",
    "\x8B\xE3": "哽",
    "\x8B\xE4": "唔",
    "\x8B\xE5": "晔",
    "\x8B\xE6": "晌",
    "\x8B\xE7": "晁",
    "\x8B\xE8": "剔",
    "\x8B\xE9": "晏",
    "\x8B\xEA": "晖",
    "\x8B\xEB": "晕",
    "\x8B\xEC": "鸮",
    "\x8B\xED": "趵",
    "\x8B\xEE": "趿",
    "\x8B\xEF": "畛",
    "\x8B\xF0": "蚌",
    "\x8B\xF1": "蚨",
    "\x8B\xF2": "蚜",
    "\x8B\xF3": "蚍",
    "\x8B\xF4": "蚋",
    "\x8B\xF5": "蚬",
    "\x8B\xF6": "畔",
    "\x8B\xF7": "蚝",
    "\x8B\xF8": "蚧",
    "\x8B\xF9": "蚣",
    "\x8B\xFA": "蚊",
    "\x8B\xFB": "蚪",
    "\x8B\xFC": "蚓",
    "\x8B\xFD": "哨",
    "\x8B\xFE": "唢",
    "\x8B\xFF": "哩",
    "\x8C\x01": "圃",
    "\x8C\x02": "哭",
    "\x8C\x03": "圄",
    "\x8C\x04": "哦",
    "\x8C\x05": "唣",
    "\x8C\x06": "唏",
    "\x8C\x07": "恩",
    "\x8C\x08": "盎",
    "\x8C\x09": "唑",
    "\x8C\x0A": "鸯",
    "\x8C\x0B": "唤",
    "\x8C\x0C": "唁",
    "\x8C\x0D": "哼",
    "\x8C\x0E": "唧",
    "\x8C\x0F": "啊",
    "\x8C\x10": "唉",
    "\x8C\x11": "唆",
    "\x8C\x12": "帱",
    "\x8C\x13": "崂",
    "\x8C\x14": "崃",
    "\x8C\x15": "罡",
    "\x8C\x16": "罢",
    "\x8C\x17": "罟",
    "\x8C\x18": "峭",
    "\x8C\x19": "峨",
    "\x8C\x1A": "峪",
    "\x8C\x1B": "峰",
    "\x8C\x1C": "圆",
    "\x8C\x1D": "觊",
    "\x8C\x1E": "峻",
    "\x8C\x1F": "贼",
    "\x8C\x20": "贿",
    "\x8C\x21": "赂",
    "\x8C\x22": "赃",
    "\x8C\x23": "赅",
    "\x8C\x24": "赆",
    "\x8C\x25": "钰",
    "\x8C\x26": "钱",
    "\x8C\x27": "钲",
    "\x8C\x28": "钳",
    "\x8C\x29": "钴",
    "\x8C\x2A": "钵",
    "\x8C\x2B": "钷",
    "\x8C\x2C": "钹",
    "\x8C\x2D": "钺",
    "\x8C\x2E": "钻",
    "\x8C\x2F": "钼",
    "\x8C\x30": "钽",
    "\x8C\x31": "钾",
    "\x8C\x32": "钿",
    "\x8C\x33": "铀",
    "\x8C\x34": "铁",
    "\x8C\x35": "铂",
    "\x8C\x36": "铃",
    "\x8C\x37": "铄",
    "\x8C\x38": "铅",
    "\x8C\x39": "铆",
    "\x8C\x3A": "铈",
    "\x8C\x3B": "铉",
    "\x8C\x3C": "铊",
    "\x8C\x3D": "铋",
    "\x8C\x3E": "铌",
    "\x8C\x3F": "铍",
    "\x8C\x40": "铎",
    "\x8C\x41": "眚",
    "\x8C\x42": "缺",
    "\x8C\x43": "氩",
    "\x8C\x44": "氤",
    "\x8C\x45": "氦",
    "\x8C\x46": "氧",
    "\x8C\x47": "氨",
    "\x8C\x48": "毪",
    "\x8C\x49": "特",
    "\x8C\x4A": "牺",
    "\x8C\x4B": "造",
    "\x8C\x4C": "乘",
    "\x8C\x4D": "敌",
    "\x8C\x4E": "舐",
    "\x8C\x4F": "秣",
    "\x8C\x50": "秫",
    "\x8C\x51": "秤",
    "\x8C\x52": "租",
    "\x8C\x53": "秧",
    "\x8C\x54": "积",
    "\x8C\x55": "盉",
    "\x8C\x56": "秩",
    "\x8C\x57": "称",
    "\x8C\x58": "秘",
    "\x8C\x59": "透",
    "\x8C\x5A": "笄",
    "\x8C\x5B": "笕",
    "\x8C\x5C": "笔",
    "\x8C\x5D": "笑",
    "\x8C\x5E": "笊",
    "\x8C\x5F": "笫",
    "\x8C\x60": "笏",
    "\x8C\x61": "笋",
    "\x8C\x62": "笆",
    "\x8C\x63": "俸",
    "\x8C\x64": "倩",
    "\x8C\x65": "债",
    "\x8C\x66": "俵",
    "\x8C\x67": "倻",
    "\x8C\x68": "借",
    "\x8C\x69": "偌",
    "\x8C\x6A": "值",
    "\x8C\x6B": "倚",
    "\x8C\x6C": "俺",
    "\x8C\x6D": "倾",
    "\x8C\x6E": "倒",
    "\x8C\x6F": "俳",
    "\x8C\x70": "俶",
    "\x8C\x71": "倬",
    "\x8C\x72": "倏",
    "\x8C\x73": "倘",
    "\x8C\x74": "俱",
    "\x8C\x75": "倡",
    "\x8C\x76": "候",
    "\x8C\x77": "赁",
    "\x8C\x78": "恁",
    "\x8C\x79": "倭",
    "\x8C\x7A": "倪",
    "\x8C\x7B": "俾",
    "\x8C\x7C": "倜",
    "\x8C\x7D": "隼",
    "\x8C\x7E": "隽",
    "\x8C\x7F": "倞",
    "\x8C\x80": "俯",
    "\x8C\x81": "倍",
    "\x8C\x82": "倦",
    "\x8C\x83": "倓",
    "\x8C\x84": "倌",
    "\x8C\x85": "倥",
    "\x8C\x86": "臬",
    "\x8C\x87": "健",
    "\x8C\x88": "臭",
    "\x8C\x89": "射",
    "\x8C\x8A": "皋",
    "\x8C\x8B": "躬",
    "\x8C\x8C": "息",
    "\x8C\x8D": "郫",
    "\x8C\x8E": "倨",
    "\x8C\x8F": "倔",
    "\x8C\x90": "衄",
    "\x8C\x91": "颀",
    "\x8C\x92": "徒",
    "\x8C\x93": "徕",
    "\x8C\x94": "徐",
    "\x8C\x95": "殷",
    "\x8C\x96": "舰",
    "\x8C\x97": "舨",
    "\x8C\x98": "舱",
    "\x8C\x99": "般",
    "\x8C\x9A": "航",
    "\x8C\x9B": "舫",
    "\x8C\x9C": "瓞",
    "\x8C\x9D": "途",
    "\x8C\x9E": "拿",
    "\x8C\x9F": "釜",
    "\x8C\xA0": "耸",
    "\x8C\xA1": "爹",
    "\x8C\xA2": "舀",
    "\x8C\xA3": "爱",
    "\x8C\xA4": "豺",
    "\x8C\xA5": "豹",
    "\x8C\xA6": "奚",
    "\x8C\xA7": "鬯",
    "\x8C\xA8": "衾",
    "\x8C\xA9": "鸰",
    "\x8C\xAA": "颁",
    "\x8C\xAB": "颂",
    "\x8C\xAC": "翁",
    "\x8C\xAD": "胯",
    "\x8C\xAE": "胰",
    "\x8C\xAF": "胱",
    "\x8C\xB0": "胴",
    "\x8C\xB1": "胭",
    "\x8C\xB2": "脍",
    "\x8C\xB3": "脎",
    "\x8C\xB4": "脆",
    "\x8C\xB5": "脂",
    "\x8C\xB6": "胸",
    "\x8C\xB7": "胳",
    "\x8C\xB8": "脏",
    "\x8C\xB9": "脐",
    "\x8C\xBA": "胶",
    "\x8C\xBB": "脑",
    "\x8C\xBC": "胲",
    "\x8C\xBD": "胼",
    "\x8C\xBE": "朕",
    "\x8C\xBF": "脒",
    "\x8C\xC0": "胺",
    "\x8C\xC1": "脓",
    "\x8C\xC2": "鸱",
    "\x8C\xC3": "玺",
    "\x8C\xC4": "鱽",
    "\x8C\xC5": "鸲",
    "\x8C\xC6": "逛",
    "\x8C\xC7": "狴",
    "\x8C\xC8": "狸",
    "\x8C\xC9": "狷",
    "\x8C\xCA": "猁",
    "\x8C\xCB": "狳",
    "\x8C\xCC": "猃",
    "\x8C\xCD": "狺",
    "\x8C\xCE": "逖",
    "\x8C\xCF": "狼",
    "\x8C\xD0": "卿",
    "\x8C\xD1": "狻",
    "\x8C\xD2": "逢",
    "\x8C\xD3": "桀",
    "\x8C\xD4": "鸵",
    "\x8C\xD5": "留",
    "\x8C\xD6": "袅",
    "\x8C\xD7": "眢",
    "\x8C\xD8": "鸳",
    "\x8C\xD9": "皱",
    "\x8C\xDA": "饽",
    "\x8C\xDB": "饿",
    "\x8C\xDC": "馀",
    "\x8C\xDD": "馁",
    "\x8C\xDE": "凌",
    "\x8C\xDF": "凇",
    "\x8C\xE0": "凄",
    "\x8C\xE1": "栾",
    "\x8C\xE2": "挛",
    "\x8C\xE3": "恋",
    "\x8C\xE4": "桨",
    "\x8C\xE5": "浆",
    "\x8C\xE6": "衰",
    "\x8C\xE7": "勍",
    "\x8C\xE8": "衷",
    "\x8C\xE9": "高",
    "\x8C\xEA": "亳",
    "\x8C\xEB": "郭",
    "\x8C\xEC": "席",
    "\x8C\xED": "准",
    "\x8C\xEE": "座",
    "\x8C\xEF": "脊",
    "\x8C\xF0": "症",
    "\x8C\xF1": "疳",
    "\x8C\xF2": "疴",
    "\x8C\xF3": "病",
    "\x8C\xF4": "疽",
    "\x8C\xF5": "疸",
    "\x8C\xF6": "疾",
    "\x8C\xF7": "痄",
    "\x8C\xF8": "斋",
    "\x8C\xF9": "疹",
    "\x8C\xFA": "痈",
    "\x8C\xFB": "疼",
    "\x8C\xFC": "疱",
    "\x8C\xFD": "疰",
    "\x8C\xFE": "痃",
    "\x8C\xFF": "痂",
    "\x8D\x01": "疲",
    "\x8D\x02": "痉",
    "\x8D\x03": "效",
    "\x8D\x04": "离",
    "\x8D\x05": "衮",
    "\x8D\x06": "紊",
    "\x8D\x07": "唐",
    "\x8D\x08": "凋",
    "\x8D\x09": "颃",
    "\x8D\x0A": "瓷",
    "\x8D\x0B": "资",
    "\x8D\x0C": "恣",
    "\x8D\x0D": "凉",
    "\x8D\x0E": "站",
    "\x8D\x0F": "剖",
    "\x8D\x10": "竞",
    "\x8D\x11": "部",
    "\x8D\x12": "旁",
    "\x8D\x13": "旆",
    "\x8D\x14": "旄",
    "\x8D\x15": "旅",
    "\x8D\x16": "旃",
    "\x8D\x17": "畜",
    "\x8D\x18": "阃",
    "\x8D\x19": "阄",
    "\x8D\x1A": "阅",
    "\x8D\x1B": "阆",
    "\x8D\x1C": "羞",
    "\x8D\x1D": "羔",
    "\x8D\x1E": "恙",
    "\x8D\x1F": "瓶",
    "\x8D\x20": "桊",
    "\x8D\x21": "拳",
    "\x8D\x22": "敉",
    "\x8D\x23": "粉",
    "\x8D\x24": "料",
    "\x8D\x25": "粑",
    "\x8D\x26": "益",
    "\x8D\x27": "兼",
    "\x8D\x28": "朔",
    "\x8D\x29": "郸",
    "\x8D\x2A": "烤",
    "\x8D\x2B": "烘",
    "\x8D\x2C": "烜",
    "\x8D\x2D": "烦",
    "\x8D\x2E": "烧",
    "\x8D\x2F": "烛",
    "\x8D\x30": "烟",
    "\x8D\x31": "烨",
    "\x8D\x32": "烩",
    "\x8D\x33": "烙",
    "\x8D\x34": "烊",
    "\x8D\x35": "剡",
    "\x8D\x36": "郯",
    "\x8D\x37": "烬",
    "\x8D\x38": "递",
    "\x8D\x39": "涛",
    "\x8D\x3A": "浙",
    "\x8D\x3B": "涝",
    "\x8D\x3C": "浡",
    "\x8D\x3D": "浦",
    "\x8D\x3E": "涑",
    "\x8D\x3F": "浯",
    "\x8D\x40": "酒",
    "\x8D\x41": "涞",
    "\x8D\x42": "涟",
    "\x8D\x43": "涉",
    "\x8D\x44": "娑",
    "\x8D\x45": "消",
    "\x8D\x46": "涅",
    "\x8D\x47": "涠",
    "\x8D\x48": "浞",
    "\x8D\x49": "涓",
    "\x8D\x4A": "涢",
    "\x8D\x4B": "涡",
    "\x8D\x4C": "浥",
    "\x8D\x4D": "涔",
    "\x8D\x4E": "浩",
    "\x8D\x4F": "海",
    "\x8D\x50": "浜",
    "\x8D\x51": "涂",
    "\x8D\x52": "浠",
    "\x8D\x53": "浴",
    "\x8D\x54": "浮",
    "\x8D\x55": "涣",
    "\x8D\x56": "浼",
    "\x8D\x57": "涤",
    "\x8D\x58": "流",
    "\x8D\x59": "润",
    "\x8D\x5A": "涧",
    "\x8D\x5B": "涕",
    "\x8D\x5C": "浣",
    "\x8D\x5D": "浪",
    "\x8D\x5E": "浸",
    "\x8D\x5F": "涨",
    "\x8D\x60": "烫",
    "\x8D\x61": "涩",
    "\x8D\x62": "涌",
    "\x8D\x63": "涘",
    "\x8D\x64": "浚",
    "\x8D\x65": "悖",
    "\x8D\x66": "悚",
    "\x8D\x67": "悟",
    "\x8D\x68": "悭",
    "\x8D\x69": "悄",
    "\x8D\x6A": "悍",
    "\x8D\x6B": "悝",
    "\x8D\x6C": "悃",
    "\x8D\x6D": "悒",
    "\x8D\x6E": "悔",
    "\x8D\x6F": "悯",
    "\x8D\x70": "悦",
    "\x8D\x71": "悌",
    "\x8D\x72": "悢",
    "\x8D\x73": "悛",
    "\x8D\x74": "害",
    "\x8D\x75": "宽",
    "\x8D\x76": "宸",
    "\x8D\x77": "家",
    "\x8D\x78": "宵",
    "\x8D\x79": "宴",
    "\x8D\x7A": "宾",
    "\x8D\x7B": "窍",
    "\x8D\x7C": "窅",
    "\x8D\x7D": "窄",
    "\x8D\x7E": "容",
    "\x8D\x7F": "窈",
    "\x8D\x80": "剜",
    "\x8D\x81": "宰",
    "\x8D\x82": "案",
    "\x8D\x83": "请",
    "\x8D\x84": "朗",
    "\x8D\x85": "诸",
    "\x8D\x86": "诹",
    "\x8D\x87": "诺",
    "\x8D\x88": "读",
    "\x8D\x89": "扅",
    "\x8D\x8A": "诼",
    "\x8D\x8B": "冢",
    "\x8D\x8C": "扇",
    "\x8D\x8D": "诽",
    "\x8D\x8E": "袜",
    "\x8D\x8F": "袪",
    "\x8D\x90": "袒",
    "\x8D\x91": "袖",
    "\x8D\x92": "袗",
    "\x8D\x93": "袍",
    "\x8D\x94": "袢",
    "\x8D\x95": "被",
    "\x8D\x96": "袯",
    "\x8D\x97": "祯",
    "\x8D\x98": "祧",
    "\x8D\x99": "祥",
    "\x8D\x9A": "课",
    "\x8D\x9B": "冥",
    "\x8D\x9C": "诿",
    "\x8D\x9D": "谀",
    "\x8D\x9E": "谁",
    "\x8D\x9F": "谂",
    "\x8D\xA0": "调",
    "\x8D\xA1": "冤",
    "\x8D\xA2": "谄",
    "\x8D\xA3": "谅",
    "\x8D\xA4": "谆",
    "\x8D\xA5": "谇",
    "\x8D\xA6": "谈",
    "\x8D\xA7": "谊",
    "\x8D\xA8": "剥",
    "\x8D\xA9": "恳",
    "\x8D\xAA": "展",
    "\x8D\xAB": "剧",
    "\x8D\xAC": "屑",
    "\x8D\xAD": "屐",
    "\x8D\xAE": "屙",
    "\x8D\xAF": "弱",
    "\x8D\xB0": "陵",
    "\x8D\xB1": "陬",
    "\x8D\xB2": "勐",
    "\x8D\xB3": "奘",
    "\x8D\xB4": "疍",
    "\x8D\xB5": "牂",
    "\x8D\xB6": "蚩",
    "\x8D\xB7": "祟",
    "\x8D\xB8": "陲",
    "\x8D\xB9": "陴",
    "\x8D\xBA": "陶",
    "\x8D\xBB": "陷",
    "\x8D\xBC": "陪",
    "\x8D\xBD": "烝",
    "\x8D\xBE": "姬",
    "\x8D\xBF": "娠",
    "\x8D\xC0": "娱",
    "\x8D\xC1": "娌",
    "\x8D\xC2": "娉",
    "\x8D\xC3": "娟",
    "\x8D\xC4": "娲",
    "\x8D\xC5": "恕",
    "\x8D\xC6": "娥",
    "\x8D\xC7": "娩",
    "\x8D\xC8": "娴",
    "\x8D\xC9": "娣",
    "\x8D\xCA": "娘",
    "\x8D\xCB": "娓",
    "\x8D\xCC": "婀",
    "\x8D\xCD": "砮",
    "\x8D\xCE": "哿",
    "\x8D\xCF": "畚",
    "\x8D\xD0": "通",
    "\x8D\xD1": "能",
    "\x8D\xD2": "难",
    "\x8D\xD3": "逡",
    "\x8D\xD4": "预",
    "\x8D\xD5": "桑",
    "\x8D\xD6": "剟",
    "\x8D\xD7": "绠",
    "\x8D\xD8": "骊",
    "\x8D\xD9": "绡",
    "\x8D\xDA": "骋",
    "\x8D\xDB": "绢",
    "\x8D\xDC": "绣",
    "\x8D\xDD": "验",
    "\x8D\xDE": "绤",
    "\x8D\xDF": "绥",
    "\x8D\xE0": "绦",
    "\x8D\xE1": "骍",
    "\x8D\xE2": "继",
    "\x8D\xE3": "绨",
    "\x8D\xE4": "骎",
    "\x8D\xE5": "骏",
    "\x8D\xE6": "邕",
    "\x8D\xE7": "鸶",
    "\x8D\xE8": "彗",
    "\x8D\xE9": "耜",
    "\x8D\xEA": "焘",
    "\x8D\xEB": "舂",
    "\x8D\xEC": "琎",
    "\x8D\xED": "球",
    "\x8D\xEE": "琏",
    "\x8D\xEF": "琐",
    "\x8D\xF0": "理",
    "\x8D\xF1": "琇",
    "\x8D\xF2": "麸",
    "\x8D\xF3": "琉",
    "\x8D\xF4": "琅",
    "\x8D\xF5": "捧",
    "\x8D\xF6": "掭",
    "\x8D\xF7": "堵",
    "\x8D\xF8": "揶",
    "\x8D\xF9": "措",
    "\x8D\xFA": "描",
    "\x8D\xFB": "埴",
    "\x8D\xFC": "域",
    "\x8D\xFD": "捺",
    "\x8D\xFE": "掎",
    "\x8D\xFF": "埼",
    "\x8E\x01": "掩",
    "\x8E\x02": "埯",
    "\x8E\x03": "捷",
    "\x8E\x04": "捯",
    "\x8E\x05": "排",
    "\x8E\x06": "焉",
    "\x8E\x07": "掉",
    "\x8E\x08": "掳",
    "\x8E\x09": "掴",
    "\x8E\x0A": "埸",
    "\x8E\x0B": "堌",
    "\x8E\x0C": "捶",
    "\x8E\x0D": "赦",
    "\x8E\x0E": "赧",
    "\x8E\x0F": "推",
    "\x8E\x10": "堆",
    "\x8E\x11": "捭",
    "\x8E\x12": "埠",
    "\x8E\x13": "晢",
    "\x8E\x14": "掀",
    "\x8E\x15": "逵",
    "\x8E\x16": "授",
    "\x8E\x17": "捻",
    "\x8E\x18": "埝",
    "\x8E\x19": "堋",
    "\x8E\x1A": "教",
    "\x8E\x1B": "堍",
    "\x8E\x1C": "掏",
    "\x8E\x1D": "掐",
    "\x8E\x1E": "掬",
    "\x8E\x1F": "鸷",
    "\x8E\x20": "掠",
    "\x8E\x21": "掂",
    "\x8E\x22": "掖",
    "\x8E\x23": "培",
    "\x8E\x24": "掊",
    "\x8E\x25": "接",
    "\x8E\x26": "堉",
    "\x8E\x27": "掷",
    "\x8E\x28": "掸",
    "\x8E\x29": "控",
    "\x8E\x2A": "捩",
    "\x8E\x2B": "掮",
    "\x8E\x2C": "探",
    "\x8E\x2D": "悫",
    "\x8E\x2E": "埭",
    "\x8E\x2F": "埽",
    "\x8E\x30": "据",
    "\x8E\x31": "掘",
    "\x8E\x32": "掺",
    "\x8E\x33": "掇",
    "\x8E\x34": "掼",
    "\x8E\x35": "职",
    "\x8E\x36": "聃",
    "\x8E\x37": "基",
    "\x8E\x38": "聆",
    "\x8E\x39": "勘",
    "\x8E\x3A": "聊",
    "\x8E\x3B": "聍",
    "\x8E\x3C": "娶",
    "\x8E\x3D": "菁",
    "\x8E\x3E": "菝",
    "\x8E\x3F": "著",
    "\x8E\x40": "菱",
    "\x8E\x41": "萁",
    "\x8E\x42": "菥",
    "\x8E\x43": "菘",
    "\x8E\x44": "堇",
    "\x8E\x45": "勒",
    "\x8E\x46": "黄",
    "\x8E\x47": "萘",
    "\x8E\x48": "萋",
    "\x8E\x49": "勩",
    "\x8E\x4A": "菲",
    "\x8E\x4B": "菽",
    "\x8E\x4C": "菖",
    "\x8E\x4D": "萌",
    "\x8E\x4E": "萜",
    "\x8E\x4F": "萝",
    "\x8E\x50": "菌",
    "\x8E\x51": "萎",
    "\x8E\x52": "萸",
    "\x8E\x53": "萑",
    "\x8E\x54": "菂",
    "\x8E\x55": "菜",
    "\x8E\x56": "棻",
    "\x8E\x57": "菔",
    "\x8E\x58": "菟",
    "\x8E\x59": "萄",
    "\x8E\x5A": "萏",
    "\x8E\x5B": "菊",
    "\x8E\x5C": "萃",
    "\x8E\x5D": "菩",
    "\x8E\x5E": "菼",
    "\x8E\x5F": "菏",
    "\x8E\x60": "萍",
    "\x8E\x61": "菹",
    "\x8E\x62": "菠",
    "\x8E\x63": "菪",
    "\x8E\x64": "菅",
    "\x8E\x65": "菀",
    "\x8E\x66": "萤",
    "\x8E\x67": "营",
    "\x8E\x68": "萦",
    "\x8E\x69": "乾",
    "\x8E\x6A": "萧",
    "\x8E\x6B": "菰",
    "\x8E\x6C": "菡",
    "\x8E\x6D": "萨",
    "\x8E\x6E": "菇",
    "\x8E\x6F": "械",
    "\x8E\x70": "梽",
    "\x8E\x71": "彬",
    "\x8E\x72": "梵",
    "\x8E\x73": "梦",
    "\x8E\x74": "婪",
    "\x8E\x75": "梗",
    "\x8E\x76": "梧",
    "\x8E\x77": "梾",
    "\x8E\x78": "梢",
    "\x8E\x79": "梏",
    "\x8E\x7A": "梅",
    "\x8E\x7B": "觋",
    "\x8E\x7C": "检",
    "\x8E\x7D": "桴",
    "\x8E\x7E": "桷",
    "\x8E\x7F": "梓",
    "\x8E\x80": "梳",
    "\x8E\x81": "棁",
    "\x8E\x82": "梯",
    "\x8E\x83": "桫",
    "\x8E\x84": "棂",
    "\x8E\x85": "桶",
    "\x8E\x86": "梭",
    "\x8E\x87": "救",
    "\x8E\x88": "啬",
    "\x8E\x89": "郾",
    "\x8E\x8A": "匮",
    "\x8E\x8B": "曹",
    "\x8E\x8C": "敕",
    "\x8E\x8D": "副",
    "\x8E\x8E": "豉",
    "\x8E\x8F": "票",
    "\x8E\x90": "鄄",
    "\x8E\x91": "酝",
    "\x8E\x92": "酞",
    "\x8E\x93": "酗",
    "\x8E\x94": "酚",
    "\x8E\x95": "厢",
    "\x8E\x96": "厣",
    "\x8E\x97": "戚",
    "\x8E\x98": "戛",
    "\x8E\x99": "硎",
    "\x8E\x9A": "硅",
    "\x8E\x9B": "硭",
    "\x8E\x9C": "硒",
    "\x8E\x9D": "硕",
    "\x8E\x9E": "硖",
    "\x8E\x9F": "硗",
    "\x8E\xA0": "硐",
    "\x8E\xA1": "硚",
    "\x8E\xA2": "硇",
    "\x8E\xA3": "硌",
    "\x8E\xA4": "鸸",
    "\x8E\xA5": "瓠",
    "\x8E\xA6": "匏",
    "\x8E\xA7": "奢",
    "\x8E\xA8": "盔",
    "\x8E\xA9": "爽",
    "\x8E\xAA": "厩",
    "\x8E\xAB": "聋",
    "\x8E\xAC": "龚",
    "\x8E\xAD": "袭",
    "\x8E\xAE": "殒",
    "\x8E\xAF": "殓",
    "\x8E\xB0": "殍",
    "\x8E\xB1": "盛",
    "\x8E\xB2": "赉",
    "\x8E\xB3": "匾",
    "\x8E\xB4": "雩",
    "\x8E\xB5": "雪",
    "\x8E\xB6": "辄",
    "\x8E\xB7": "辅",
    "\x8E\xB8": "辆",
    "\x8E\xB9": "堑",
    "\x8E\xBA": "龁",
    "\x8E\xBB": "颅",
    "\x8E\xBC": "虚",
    "\x8E\xBD": "彪",
    "\x8E\xBE": "雀",
    "\x8E\xBF": "堂",
    "\x8E\xC0": "常",
    "\x8E\xC1": "眶",
    "\x8E\xC2": "眭",
    "\x8E\xC3": "唪",
    "\x8E\xC4": "眦",
    "\x8E\xC5": "啧",
    "\x8E\xC6": "匙",
    "\x8E\xC7": "晡",
    "\x8E\xC8": "晤",
    "\x8E\xC9": "晨",
    "\x8E\xCA": "眺",
    "\x8E\xCB": "眵",
    "\x8E\xCC": "睁",
    "\x8E\xCD": "眯",
    "\x8E\xCE": "眼",
    "\x8E\xCF": "眸",
    "\x8E\xD0": "悬",
    "\x8E\xD1": "野",
    "\x8E\xD2": "圊",
    "\x8E\xD3": "啪",
    "\x8E\xD4": "啦",
    "\x8E\xD5": "喏",
    "\x8E\xD6": "喵",
    "\x8E\xD7": "啉",
    "\x8E\xD8": "勖",
    "\x8E\xD9": "曼",
    "\x8E\xDA": "晦",
    "\x8E\xDB": "晞",
    "\x8E\xDC": "晗",
    "\x8E\xDD": "晚",
    "\x8E\xDE": "冕",
    "\x8E\xDF": "啄",
    "\x8E\xE0": "啭",
    "\x8E\xE1": "啡",
    "\x8E\xE2": "畦",
    "\x8E\xE3": "趼",
    "\x8E\xE4": "趺",
    "\x8E\xE5": "距",
    "\x8E\xE6": "趾",
    "\x8E\xE7": "啃",
    "\x8E\xE8": "跃",
    "\x8E\xE9": "啮",
    "\x8E\xEA": "跄",
    "\x8E\xEB": "略",
    "\x8E\xEC": "蚶",
    "\x8E\xED": "蛄",
    "\x8E\xEE": "蛎",
    "\x8E\xEF": "蛆",
    "\x8E\xF0": "蚰",
    "\x8E\xF1": "蚺",
    "\x8E\xF2": "蛊",
    "\x8E\xF3": "圉",
    "\x8E\xF4": "蚱",
    "\x8E\xF5": "蚯",
    "\x8E\xF6": "蛉",
    "\x8E\xF7": "蛀",
    "\x8E\xF8": "蛇",
    "\x8E\xF9": "蛏",
    "\x8E\xFA": "蚴",
    "\x8E\xFB": "唬",
    "\x8E\xFC": "累",
    "\x8E\xFD": "鄂",
    "\x8E\xFE": "唱",
    "\x8E\xFF": "患",
    "\x8F\x01": "啰",
    "\x8F\x02": "唾",
    "\x8F\x03": "唯",
    "\x8F\x04": "啤",
    "\x8F\x05": "啥",
    "\x8F\x06": "啁",
    "\x8F\x07": "啕",
    "\x8F\x08": "唿",
    "\x8F\x09": "啐",
    "\x8F\x0A": "唼",
    "\x8F\x0B": "唷",
    "\x8F\x0C": "啴",
    "\x8F\x0D": "啖",
    "\x8F\x0E": "啵",
    "\x8F\x0F": "啶",
    "\x8F\x10": "啷",
    "\x8F\x11": "唳",
    "\x8F\x12": "啸",
    "\x8F\x13": "啜",
    "\x8F\x14": "帻",
    "\x8F\x15": "崖",
    "\x8F\x16": "崎",
    "\x8F\x17": "崦",
    "\x8F\x18": "崭",
    "\x8F\x19": "逻",
    "\x8F\x1A": "帼",
    "\x8F\x1B": "崮",
    "\x8F\x1C": "崔",
    "\x8F\x1D": "帷",
    "\x8F\x1E": "崟",
    "\x8F\x1F": "崤",
    "\x8F\x20": "崩",
    "\x8F\x21": "崞",
    "\x8F\x22": "崇",
    "\x8F\x23": "崆",
    "\x8F\x24": "崛",
    "\x8F\x25": "赇",
    "\x8F\x26": "赈",
    "\x8F\x27": "婴",
    "\x8F\x28": "赊",
    "\x8F\x29": "圈",
    "\x8F\x2A": "铐",
    "\x8F\x2B": "铑",
    "\x8F\x2C": "铒",
    "\x8F\x2D": "铕",
    "\x8F\x2E": "铗",
    "\x8F\x2F": "铘",
    "\x8F\x30": "铙",
    "\x8F\x31": "铚",
    "\x8F\x32": "铛",
    "\x8F\x33": "铜",
    "\x8F\x34": "铝",
    "\x8F\x35": "铞",
    "\x8F\x36": "铟",
    "\x8F\x37": "铠",
    "\x8F\x38": "铡",
    "\x8F\x39": "铢",
    "\x8F\x3A": "铣",
    "\x8F\x3B": "铤",
    "\x8F\x3C": "铥",
    "\x8F\x3D": "铧",
    "\x8F\x3E": "铨",
    "\x8F\x3F": "铩",
    "\x8F\x40": "铪",
    "\x8F\x41": "铫",
    "\x8F\x42": "铭",
    "\x8F\x43": "铬",
    "\x8F\x44": "铮",
    "\x8F\x45": "铯",
    "\x8F\x46": "铰",
    "\x8F\x47": "铱",
    "\x8F\x48": "铲",
    "\x8F\x49": "铳",
    "\x8F\x4A": "铴",
    "\x8F\x4B": "铵",
    "\x8F\x4C": "银",
    "\x8F\x4D": "铷",
    "\x8F\x4E": "矫",
    "\x8F\x4F": "氪",
    "\x8F\x50": "牾",
    "\x8F\x51": "甜",
    "\x8F\x52": "鸹",
    "\x8F\x53": "秸",
    "\x8F\x54": "梨",
    "\x8F\x55": "犁",
    "\x8F\x56": "稆",
    "\x8F\x57": "秽",
    "\x8F\x58": "移",
    "\x8F\x59": "秾",
    "\x8F\x5A": "逶",
    "\x8F\x5B": "笺",
    "\x8F\x5C": "筇",
    "\x8F\x5D": "笨",
    "\x8F\x5E": "笸",
    "\x8F\x5F": "笼",
    "\x8F\x60": "笪",
    "\x8F\x61": "笛",
    "\x8F\x62": "笙",
    "\x8F\x63": "笮",
    "\x8F\x64": "符",
    "\x8F\x65": "笱",
    "\x8F\x66": "笠",
    "\x8F\x67": "笥",
    "\x8F\x68": "第",
    "\x8F\x69": "笳",
    "\x8F\x6A": "笤",
    "\x8F\x6B": "笾",
    "\x8F\x6C": "笞",
    "\x8F\x6D": "敏",
    "\x8F\x6E": "偾",
    "\x8F\x6F": "做",
    "\x8F\x70": "鸺",
    "\x8F\x71": "偃",
    "\x8F\x72": "偕",
    "\x8F\x73": "袋",
    "\x8F\x74": "悠",
    "\x8F\x75": "偿",
    "\x8F\x76": "偶",
    "\x8F\x77": "偈",
    "\x8F\x78": "偎",
    "\x8F\x79": "偲",
    "\x8F\x7A": "傀",
    "\x8F\x7B": "偷",
    "\x8F\x7C": "您",
    "\x8F\x7D": "偬",
    "\x8F\x7E": "售",
    "\x8F\x7F": "停",
    "\x8F\x80": "偻",
    "\x8F\x81": "偏",
    "\x8F\x82": "躯",
    "\x8F\x83": "皑",
    "\x8F\x84": "兜",
    "\x8F\x85": "皎",
    "\x8F\x86": "假",
    "\x8F\x87": "衅",
    "\x8F\x88": "鸻",
    "\x8F\x89": "徘",
    "\x8F\x8A": "徙",
    "\x8F\x8B": "徜",
    "\x8F\x8C": "得",
    "\x8F\x8D": "衔",
    "\x8F\x8E": "舸",
    "\x8F\x8F": "舻",
    "\x8F\x90": "舳",
    "\x8F\x91": "盘",
    "\x8F\x92": "舴",
    "\x8F\x93": "舶",
    "\x8F\x94": "船",
    "\x8F\x95": "鸼",
    "\x8F\x96": "舷",
    "\x8F\x97": "舵",
    "\x8F\x98": "斜",
    "\x8F\x99": "龛",
    "\x8F\x9A": "盒",
    "\x8F\x9B": "鸽",
    "\x8F\x9C": "瓻",
    "\x8F\x9D": "敛",
    "\x8F\x9E": "悉",
    "\x8F\x9F": "欲",
    "\x8F\xA0": "彩",
    "\x8F\xA1": "领",
    "\x8F\xA2": "翎",
    "\x8F\xA3": "脚",
    "\x8F\xA4": "脖",
    "\x8F\xA5": "脯",
    "\x8F\xA6": "豚",
    "\x8F\xA7": "脶",
    "\x8F\xA8": "脸",
    "\x8F\xA9": "脞",
    "\x8F\xAA": "脬",
    "\x8F\xAB": "脱",
    "\x8F\xAC": "脘",
    "\x8F\xAD": "脲",
    "\x8F\xAE": "脧",
    "\x8F\xAF": "匐",
    "\x8F\xB0": "鱾",
    "\x8F\xB1": "象",
    "\x8F\xB2": "够",
    "\x8F\xB3": "逸",
    "\x8F\xB4": "猜",
    "\x8F\xB5": "猪",
    "\x8F\xB6": "猎",
    "\x8F\xB7": "猫",
    "\x8F\xB8": "猗",
    "\x8F\xB9": "凰",
    "\x8F\xBA": "猖",
    "\x8F\xBB": "猡",
    "\x8F\xBC": "猊",
    "\x8F\xBD": "猞",
    "\x8F\xBE": "猄",
    "\x8F\xBF": "猝",
    "\x8F\xC0": "斛",
    "\x8F\xC1": "觖",
    "\x8F\xC2": "猕",
    "\x8F\xC3": "猛",
    "\x8F\xC4": "馗",
    "\x8F\xC5": "祭",
    "\x8F\xC6": "馃",
    "\x8F\xC7": "馄",
    "\x8F\xC8": "馅",
    "\x8F\xC9": "馆",
    "\x8F\xCA": "凑",
    "\x8F\xCB": "减",
    "\x8F\xCC": "鸾",
    "\x8F\xCD": "毫",
    "\x8F\xCE": "孰",
    "\x8F\xCF": "烹",
    "\x8F\xD0": "庶",
    "\x8F\xD1": "庹",
    "\x8F\xD2": "麻",
    "\x8F\xD3": "庵",
    "\x8F\xD4": "庼",
    "\x8F\xD5": "庾",
    "\x8F\xD6": "庳",
    "\x8F\xD7": "痔",
    "\x8F\xD8": "痍",
    "\x8F\xD9": "疵",
    "\x8F\xDA": "痊",
    "\x8F\xDB": "痒",
    "\x8F\xDC": "痕",
    "\x8F\xDD": "廊",
    "\x8F\xDE": "康",
    "\x8F\xDF": "庸",
    "\x8F\xE0": "鹿",
    "\x8F\xE1": "盗",
    "\x8F\xE2": "章",
    "\x8F\xE3": "竟",
    "\x8F\xE4": "翊",
    "\x8F\xE5": "商",
    "\x8F\xE6": "旌",
    "\x8F\xE7": "族",
    "\x8F\xE8": "旎",
    "\x8F\xE9": "旋",
    "\x8F\xEA": "望",
    "\x8F\xEB": "袤",
    "\x8F\xEC": "率",
    "\x8F\xED": "阇",
    "\x8F\xEE": "阈",
    "\x8F\xEF": "阉",
    "\x8F\xF0": "阊",
    "\x8F\xF1": "阋",
    "\x8F\xF2": "阌",
    "\x8F\xF3": "阍",
    "\x8F\xF4": "阎",
    "\x8F\xF5": "阏",
    "\x8F\xF6": "阐",
    "\x8F\xF7": "着",
    "\x8F\xF8": "羚",
    "\x8F\xF9": "羝",
    "\x8F\xFA": "羟",
    "\x8F\xFB": "盖",
    "\x8F\xFC": "眷",
    "\x8F\xFD": "粝",
    "\x8F\xFE": "粘",
    "\x8F\xFF": "粗",
    "\x90\x01": "粕",
    "\x90\x02": "粒",
    "\x90\x03": "断",
    "\x90\x04": "剪",
    "\x90\x05": "兽",
    "\x90\x06": "焐",
    "\x90\x07": "焊",
    "\x90\x08": "烯",
    "\x90\x09": "焓",
    "\x90\x0A": "焕",
    "\x90\x0B": "烽",
    "\x90\x0C": "焖",
    "\x90\x0D": "烷",
    "\x90\x0E": "烺",
    "\x90\x0F": "焌",
    "\x90\x10": "清",
    "\x90\x11": "渍",
    "\x90\x12": "添",
    "\x90\x13": "渚",
    "\x90\x14": "鸿",
    "\x90\x15": "淇",
    "\x90\x16": "淋",
    "\x90\x17": "淅",
    "\x90\x18": "淞",
    "\x90\x19": "渎",
    "\x90\x1A": "涯",
    "\x90\x1B": "淹",
    "\x90\x1C": "涿",
    "\x90\x1D": "渠",
    "\x90\x1E": "渐",
    "\x90\x1F": "淑",
    "\x90\x20": "淖",
    "\x90\x21": "挲",
    "\x90\x22": "淌",
    "\x90\x23": "淏",
    "\x90\x24": "混",
    "\x90\x25": "淠",
    "\x90\x26": "涸",
    "\x90\x27": "渑",
    "\x90\x28": "淮",
    "\x90\x29": "淦",
    "\x90\x2A": "淆",
    "\x90\x2B": "渊",
    "\x90\x2C": "淫",
    "\x90\x2D": "淝",
    "\x90\x2E": "渔",
    "\x90\x2F": "淘",
    "\x90\x30": "淳",
    "\x90\x31": "液",
    "\x90\x32": "淬",
    "\x90\x33": "涪",
    "\x90\x34": "淤",
    "\x90\x35": "淡",
    "\x90\x36": "淙",
    "\x90\x37": "淀",
    "\x90\x38": "涫",
    "\x90\x39": "深",
    "\x90\x3A": "渌",
    "\x90\x3B": "涮",
    "\x90\x3C": "涵",
    "\x90\x3D": "婆",
    "\x90\x3E": "梁",
    "\x90\x3F": "渗",
    "\x90\x40": "淄",
    "\x90\x41": "情",
    "\x90\x42": "惬",
    "\x90\x43": "悻",
    "\x90\x44": "惜",
    "\x90\x45": "惭",
    "\x90\x46": "悱",
    "\x90\x47": "悼",
    "\x90\x48": "惝",
    "\x90\x49": "惧",
    "\x90\x4A": "惕",
    "\x90\x4B": "惘",
    "\x90\x4C": "悸",
    "\x90\x4D": "惟",
    "\x90\x4E": "惆",
    "\x90\x4F": "惚",
    "\x90\x50": "惊",
    "\x90\x51": "惇",
    "\x90\x52": "惦",
    "\x90\x53": "悴",
    "\x90\x54": "惮",
    "\x90\x55": "惋",
    "\x90\x56": "惨",
    "\x90\x57": "惯",
    "\x90\x58": "寇",
    "\x90\x59": "寅",
    "\x90\x5A": "寄",
    "\x90\x5B": "寂",
    "\x90\x5C": "逭",
    "\x90\x5D": "宿",
    "\x90\x5E": "窒",
    "\x90\x5F": "窑",
    "\x90\x60": "窕",
    "\x90\x61": "密",
    "\x90\x62": "谋",
    "\x90\x63": "谌",
    "\x90\x64": "谍",
    "\x90\x65": "谎",
    "\x90\x66": "谏",
    "\x90\x67": "扈",
    "\x90\x68": "皲",
    "\x90\x69": "谐",
    "\x90\x6A": "谑",
    "\x90\x6B": "裆",
    "\x90\x6C": "袱",
    "\x90\x6D": "袼",
    "\x90\x6E": "裈",
    "\x90\x6F": "裉",
    "\x90\x70": "祷",
    "\x90\x71": "祸",
    "\x90\x72": "祲",
    "\x90\x73": "谒",
    "\x90\x74": "谓",
    "\x90\x75": "谔",
    "\x90\x76": "谕",
    "\x90\x77": "谖",
    "\x90\x78": "谗",
    "\x90\x79": "谙",
    "\x90\x7A": "谚",
    "\x90\x7B": "谛",
    "\x90\x7C": "谜",
    "\x90\x7D": "谝",
    "\x90\x7E": "敝",
    "\x90\x7F": "逮",
    "\x90\x80": "逯",
    "\x90\x81": "敢",
    "\x90\x82": "尉",
    "\x90\x83": "屠",
    "\x90\x84": "艴",
    "\x90\x85": "弹",
    "\x90\x86": "隋",
    "\x90\x87": "堕",
    "\x90\x88": "郿",
    "\x90\x89": "随",
    "\x90\x8A": "蛋",
    "\x90\x8B": "隅",
    "\x90\x8C": "隈",
    "\x90\x8D": "粜",
    "\x90\x8E": "隍",
    "\x90\x8F": "隗",
    "\x90\x90": "隆",
    "\x90\x91": "隐",
    "\x90\x92": "婧",
    "\x90\x93": "婊",
    "\x90\x94": "婞",
    "\x90\x95": "婳",
    "\x90\x96": "婕",
    "\x90\x97": "娼",
    "\x90\x98": "婢",
    "\x90\x99": "婚",
    "\x90\x9A": "婵",
    "\x90\x9B": "婶",
    "\x90\x9C": "婉",
    "\x90\x9D": "胬",
    "\x90\x9E": "袈",
    "\x90\x9F": "颇",
    "\x90\xA0": "颈",
    "\x90\xA1": "翌",
    "\x90\xA2": "恿",
    "\x90\xA3": "欸",
    "\x90\xA4": "绩",
    "\x90\xA5": "绪",
    "\x90\xA6": "绫",
    "\x90\xA7": "骐",
    "\x90\xA8": "续",
    "\x90\xA9": "骑",
    "\x90\xAA": "绮",
    "\x90\xAB": "绯",
    "\x90\xAC": "绰",
    "\x90\xAD": "骒",
    "\x90\xAE": "绲",
    "\x90\xAF": "绳",
    "\x90\xB0": "骓",
    "\x90\xB1": "维",
    "\x90\xB2": "绵",
    "\x90\xB3": "绶",
    "\x90\xB4": "绷",
    "\x90\xB5": "绸",
    "\x90\xB6": "绹",
    "\x90\xB7": "绺",
    "\x90\xB8": "绻",
    "\x90\xB9": "综",
    "\x90\xBA": "绽",
    "\x90\xBB": "绾",
    "\x90\xBC": "绿",
    "\x90\xBD": "骖",
    "\x90\xBE": "缀",
    "\x90\xBF": "缁",
    "\x90\xC0": "巢",
    "\x90\xC1": "耠",
    "\x90\xC2": "琫",
    "\x90\xC3": "琵",
    "\x90\xC4": "琴",
    "\x90\xC5": "琶",
    "\x90\xC6": "琪",
    "\x90\xC7": "瑛",
    "\x90\xC8": "琳",
    "\x90\xC9": "琦",
    "\x90\xCA": "琢",
    "\x90\xCB": "琥",
    "\x90\xCC": "琨",
    "\x90\xCD": "靓",
    "\x90\xCE": "琼",
    "\x90\xCF": "斑",
    "\x90\xD0": "琰",
    "\x90\xD1": "琮",
    "\x90\xD2": "琯",
    "\x90\xD3": "琬",
    "\x90\xD4": "琛",
    "\x90\xD5": "琚",
    "\x90\xD6": "辇",
    "\x90\xD7": "替",
    "\x90\xD8": "鼋",
    "\x90\xD9": "揳",
    "\x90\xDA": "揍",
    "\x90\xDB": "款",
    "\x90\xDC": "堪",
    "\x90\xDD": "堞",
    "\x90\xDE": "搽",
    "\x90\xDF": "塔",
    "\x90\xE0": "搭",
    "\x90\xE1": "塃",
    "\x90\xE2": "揸",
    "\x90\xE3": "堰",
    "\x90\xE4": "揠",
    "\x90\xE5": "堙",
    "\x90\xE6": "揩",
    "\x90\xE7": "越",
    "\x90\xE8": "趄",
    "\x90\xE9": "趁",
    "\x90\xEA": "趋",
    "\x90\xEB": "超",
    "\x90\xEC": "揽",
    "\x90\xED": "提",
    "\x90\xEE": "堤",
    "\x90\xEF": "揖",
    "\x90\xF0": "博",
    "\x90\xF1": "揾",
    "\x90\xF2": "颉",
    "\x90\xF3": "揭",
    "\x90\xF4": "喜",
    "\x90\xF5": "彭",
    "\x90\xF6": "揣",
    "\x90\xF7": "塄",
    "\x90\xF8": "揿",
    "\x90\xF9": "插",
    "\x90\xFA": "揪",
    "\x90\xFB": "搜",
    "\x90\xFC": "煮",
    "\x90\xFD": "堠",
    "\x90\xFE": "耋",
    "\x90\xFF": "揄",
    "\x91\x01": "援",
    "\x91\x02": "搀",
    "\x91\x03": "蛰",
    "\x91\x04": "蛩",
    "\x91\x05": "絷",
    "\x91\x06": "塆",
    "\x91\x07": "裁",
    "\x91\x08": "揞",
    "\x91\x09": "搁",
    "\x91\x0A": "搓",
    "\x91\x0B": "搂",
    "\x91\x0C": "搅",
    "\x91\x0D": "揎",
    "\x91\x0E": "壹",
    "\x91\x0F": "握",
    "\x91\x10": "摒",
    "\x91\x11": "揆",
    "\x91\x12": "搔",
    "\x91\x13": "揉",
    "\x91\x14": "掾",
    "\x91\x15": "葜",
    "\x91\x16": "聒",
    "\x91\x17": "斯",
    "\x91\x18": "期",
    "\x91\x19": "欺",
    "\x91\x1A": "联",
    "\x91\x1B": "葑",
    "\x91\x1C": "葚",
    "\x91\x1D": "葫",
    "\x91\x1E": "靰",
    "\x91\x1F": "靸",
    "\x91\x20": "散",
    "\x91\x21": "葳",
    "\x91\x22": "惹",
    "\x91\x23": "蒇",
    "\x91\x24": "葬",
    "\x91\x25": "蒈",
    "\x91\x26": "募",
    "\x91\x27": "葺",
    "\x91\x28": "葛",
    "\x91\x29": "蒉",
    "\x91\x2A": "葸",
    "\x91\x2B": "萼",
    "\x91\x2C": "蓇",
    "\x91\x2D": "萩",
    "\x91\x2E": "董",
    "\x91\x2F": "葆",
    "\x91\x30": "葩",
    "\x91\x31": "葡",
    "\x91\x32": "敬",
    "\x91\x33": "葱",
    "\x91\x34": "蒋",
    "\x91\x35": "葶",
    "\x91\x36": "蒂",
    "\x91\x37": "蒌",
    "\x91\x38": "葓",
    "\x91\x39": "蒎",
    "\x91\x3A": "落",
    "\x91\x3B": "萱",
    "\x91\x3C": "葖",
    "\x91\x3D": "韩",
    "\x91\x3E": "戟",
    "\x91\x3F": "朝",
    "\x91\x40": "葭",
    "\x91\x41": "辜",
    "\x91\x42": "葵",
    "\x91\x43": "棒",
    "\x91\x44": "楮",
    "\x91\x45": "棱",
    "\x91\x46": "棋",
    "\x91\x47": "椰",
    "\x91\x48": "植",
    "\x91\x49": "森",
    "\x91\x4A": "棼",
    "\x91\x4B": "焚",
    "\x91\x4C": "椟",
    "\x91\x4D": "椅",
    "\x91\x4E": "椒",
    "\x91\x4F": "棹",
    "\x91\x50": "棵",
    "\x91\x51": "棍",
    "\x91\x52": "椤",
    "\x91\x53": "棰",
    "\x91\x54": "椎",
    "\x91\x55": "棉",
    "\x91\x56": "椑",
    "\x91\x57": "鹀",
    "\x91\x58": "赍",
    "\x91\x59": "棚",
    "\x91\x5A": "椋",
    "\x91\x5B": "椁",
    "\x91\x5C": "棬",
    "\x91\x5D": "棕",
    "\x91\x5E": "棺",
    "\x91\x5F": "榔",
    "\x91\x60": "楗",
    "\x91\x61": "棣",
    "\x91\x62": "椐",
    "\x91\x63": "椭",
    "\x91\x64": "鹁",
    "\x91\x65": "惠",
    "\x91\x66": "惑",
    "\x91\x67": "逼",
    "\x91\x68": "覃",
    "\x91\x69": "粟",
    "\x91\x6A": "棘",
    "\x91\x6B": "酣",
    "\x91\x6C": "酤",
    "\x91\x6D": "酢",
    "\x91\x6E": "酥",
    "\x91\x6F": "酡",
    "\x91\x70": "酦",
    "\x91\x71": "鹂",
    "\x91\x72": "觌",
    "\x91\x73": "厨",
    "\x91\x74": "厦",
    "\x91\x75": "硬",
    "\x91\x76": "硝",
    "\x91\x77": "硪",
    "\x91\x78": "硷",
    "\x91\x79": "确",
    "\x91\x7A": "硫",
    "\x91\x7B": "雁",
    "\x91\x7C": "厥",
    "\x91\x7D": "殖",
    "\x91\x7E": "裂",
    "\x91\x7F": "雄",
    "\x91\x80": "殚",
    "\x91\x81": "殛",
    "\x91\x82": "颊",
    "\x91\x83": "雳",
    "\x91\x84": "雯",
    "\x91\x85": "辊",
    "\x91\x86": "辋",
    "\x91\x87": "椠",
    "\x91\x88": "暂",
    "\x91\x89": "辌",
    "\x91\x8A": "辍",
    "\x91\x8B": "辎",
    "\x91\x8C": "雅",
    "\x91\x8D": "翘",
    "\x91\x8E": "辈",
    "\x91\x8F": "斐",
    "\x91\x90": "悲",
    "\x91\x91": "紫",
    "\x91\x92": "黹",
    "\x91\x93": "辉",
    "\x91\x94": "敞",
    "\x91\x95": "棠",
    "\x91\x96": "牚",
    "\x91\x97": "赏",
    "\x91\x98": "掌",
    "\x91\x99": "晴",
    "\x91\x9A": "睐",
    "\x91\x9B": "暑",
    "\x91\x9C": "最",
    "\x91\x9D": "晰",
    "\x91\x9E": "量",
    "\x91\x9F": "睑",
    "\x91\xA0": "睇",
    "\x91\xA1": "鼎",
    "\x91\xA2": "睃",
    "\x91\xA3": "喷",
    "\x91\xA4": "戢",
    "\x91\xA5": "喋",
    "\x91\xA6": "嗒",
    "\x91\xA7": "喃",
    "\x91\xA8": "喳",
    "\x91\xA9": "晶",
    "\x91\xAA": "喇",
    "\x91\xAB": "遇",
    "\x91\xAC": "喊",
    "\x91\xAD": "喱",
    "\x91\xAE": "喹",
    "\x91\xAF": "遏",
    "\x91\xB0": "晷",
    "\x91\xB1": "晾",
    "\x91\xB2": "景",
    "\x91\xB3": "喈",
    "\x91\xB4": "畴",
    "\x91\xB5": "践",
    "\x91\xB6": "跖",
    "\x91\xB7": "跋",
    "\x91\xB8": "跌",
    "\x91\xB9": "跗",
    "\x91\xBA": "跞",
    "\x91\xBB": "跚",
    "\x91\xBC": "跑",
    "\x91\xBD": "跎",
    "\x91\xBE": "跏",
    "\x91\xBF": "跛",
    "\x91\xC0": "跆",
    "\x91\xC1": "遗",
    "\x91\xC2": "蛙",
    "\x91\xC3": "蛱",
    "\x91\xC4": "蛲",
    "\x91\xC5": "蛭",
    "\x91\xC6": "蛳",
    "\x91\xC7": "蛐",
    "\x91\xC8": "蛔",
    "\x91\xC9": "蛛",
    "\x91\xCA": "蜓",
    "\x91\xCB": "蛞",
    "\x91\xCC": "蜒",
    "\x91\xCD": "蛤",
    "\x91\xCE": "蛴",
    "\x91\xCF": "蛟",
    "\x91\xD0": "蛘",
    "\x91\xD1": "蛑",
    "\x91\xD2": "畯",
    "\x91\xD3": "喁",
    "\x91\xD4": "喝",
    "\x91\xD5": "鹃",
    "\x91\xD6": "喂",
    "\x91\xD7": "喟",
    "\x91\xD8": "斝",
    "\x91\xD9": "喘",
    "\x91\xDA": "啾",
    "\x91\xDB": "嗖",
    "\x91\xDC": "喤",
    "\x91\xDD": "喉",
    "\x91\xDE": "喻",
    "\x91\xDF": "喑",
    "\x91\xE0": "啼",
    "\x91\xE1": "嗟",
    "\x91\xE2": "喽",
    "\x91\xE3": "嗞",
    "\x91\xE4": "喧",
    "\x91\xE5": "喀",
    "\x91\xE6": "喔",
    "\x91\xE7": "喙",
    "\x91\xE8": "嵌",
    "\x91\xE9": "嵘",
    "\x91\xEA": "嵖",
    "\x91\xEB": "幅",
    "\x91\xEC": "崴",
    "\x91\xED": "遄",
    "\x91\xEE": "詈",
    "\x91\xEF": "帽",
    "\x91\xF0": "嵎",
    "\x91\xF1": "崽",
    "\x91\xF2": "嵚",
    "\x91\xF3": "嵬",
    "\x91\xF4": "嵛",
    "\x91\xF5": "翙",
    "\x91\xF6": "嵯",
    "\x91\xF7": "嵝",
    "\x91\xF8": "嵫",
    "\x91\xF9": "幄",
    "\x91\xFA": "嵋",
    "\x91\xFB": "赋",
    "\x91\xFC": "赌",
    "\x91\xFD": "赎",
    "\x91\xFE": "赐",
    "\x91\xFF": "赑",
    "\x92\x01": "赔",
    "\x92\x02": "黑",
    "\x92\x03": "铸",
    "\x92\x04": "铹",
    "\x92\x05": "铺",
    "\x92\x06": "铻",
    "\x92\x07": "铼",
    "\x92\x08": "铽",
    "\x92\x09": "链",
    "\x92\x0A": "铿",
    "\x92\x0B": "销",
    "\x92\x0C": "锁",
    "\x92\x0D": "锃",
    "\x92\x0E": "锄",
    "\x92\x0F": "锂",
    "\x92\x10": "锅",
    "\x92\x11": "锆",
    "\x92\x12": "锇",
    "\x92\x13": "锈",
    "\x92\x14": "锉",
    "\x92\x15": "锊",
    "\x92\x16": "锋",
    "\x92\x17": "锌",
    "\x92\x18": "锎",
    "\x92\x19": "锏",
    "\x92\x1A": "锐",
    "\x92\x1B": "锑",
    "\x92\x1C": "锒",
    "\x92\x1D": "锓",
    "\x92\x1E": "锔",
    "\x92\x1F": "锕",
    "\x92\x20": "甥",
    "\x92\x21": "掣",
    "\x92\x22": "掰",
    "\x92\x23": "短",
    "\x92\x24": "智",
    "\x92\x25": "矬",
    "\x92\x26": "氰",
    "\x92\x27": "毳",
    "\x92\x28": "毯",
    "\x92\x29": "氮",
    "\x92\x2A": "毽",
    "\x92\x2B": "氯",
    "\x92\x2C": "犊",
    "\x92\x2D": "犄",
    "\x92\x2E": "犋",
    "\x92\x2F": "鹄",
    "\x92\x30": "犍",
    "\x92\x31": "鹅",
    "\x92\x32": "颋",
    "\x92\x33": "剩",
    "\x92\x34": "嵇",
    "\x92\x35": "稍",
    "\x92\x36": "程",
    "\x92\x37": "稀",
    "\x92\x38": "黍",
    "\x92\x39": "稃",
    "\x92\x3A": "税",
    "\x92\x3B": "稂",
    "\x92\x3C": "筐",
    "\x92\x3D": "等",
    "\x92\x3E": "筘",
    "\x92\x3F": "筑",
    "\x92\x40": "策",
    "\x92\x41": "筚",
    "\x92\x42": "筛",
    "\x92\x43": "筜",
    "\x92\x44": "筒",
    "\x92\x45": "筅",
    "\x92\x46": "筏",
    "\x92\x47": "筵",
    "\x92\x48": "筌",
    "\x92\x49": "答",
    "\x92\x4A": "筋",
    "\x92\x4B": "筝",
    "\x92\x4C": "傣",
    "\x92\x4D": "傲",
    "\x92\x4E": "傅",
    "\x92\x4F": "傈",
    "\x92\x50": "舄",
    "\x92\x51": "牍",
    "\x92\x52": "牌",
    "\x92\x53": "傥",
    "\x92\x54": "堡",
    "\x92\x55": "集",
    "\x92\x56": "焦",
    "\x92\x57": "傍",
    "\x92\x58": "傧",
    "\x92\x59": "储",
    "\x92\x5A": "遑",
    "\x92\x5B": "皓",
    "\x92\x5C": "皖",
    "\x92\x5D": "粤",
    "\x92\x5E": "奥",
    "\x92\x5F": "傩",
    "\x92\x60": "遁",
    "\x92\x61": "街",
    "\x92\x62": "惩",
    "\x92\x63": "御",
    "\x92\x64": "徨",
    "\x92\x65": "循",
    "\x92\x66": "舾",
    "\x92\x67": "艇",
    "\x92\x68": "舒",
    "\x92\x69": "畲",
    "\x92\x6A": "弑",
    "\x92\x6B": "逾",
    "\x92\x6C": "颌",
    "\x92\x6D": "翕",
    "\x92\x6E": "釉",
    "\x92\x6F": "番",
    "\x92\x70": "释",
    "\x92\x71": "鹆",
    "\x92\x72": "禽",
    "\x92\x73": "舜",
    "\x92\x74": "貂",
    "\x92\x75": "腈",
    "\x92\x76": "腊",
    "\x92\x77": "腌",
    "\x92\x78": "腓",
    "\x92\x79": "腆",
    "\x92\x7A": "腴",
    "\x92\x7B": "脾",
    "\x92\x7C": "腋",
    "\x92\x7D": "腑",
    "\x92\x7E": "腙",
    "\x92\x7F": "腚",
    "\x92\x80": "腔",
    "\x92\x81": "腕",
    "\x92\x82": "腱",
    "\x92\x83": "腒",
    "\x92\x84": "鱿",
    "\x92\x85": "鲀",
    "\x92\x86": "鲁",
    "\x92\x87": "鲂",
    "\x92\x88": "鲃",
    "\x92\x89": "颍",
    "\x92\x8A": "猢",
    "\x92\x8B": "猹",
    "\x92\x8C": "猩",
    "\x92\x8D": "猥",
    "\x92\x8E": "猬",
    "\x92\x8F": "猾",
    "\x92\x90": "猴",
    "\x92\x91": "飓",
    "\x92\x92": "觞",
    "\x92\x93": "觚",
    "\x92\x94": "猸",
    "\x92\x95": "猱",
    "\x92\x96": "惫",
    "\x92\x97": "飧",
    "\x92\x98": "然",
    "\x92\x99": "馇",
    "\x92\x9A": "馈",
    "\x92\x9B": "馉",
    "\x92\x9C": "馊",
    "\x92\x9D": "馋",
    "\x92\x9E": "亵",
    "\x92\x9F": "装",
    "\x92\xA0": "蛮",
    "\x92\xA1": "脔",
    "\x92\xA2": "就",
    "\x92\xA3": "敦",
    "\x92\xA4": "裒",
    "\x92\xA5": "廋",
    "\x92\xA6": "斌",
    "\x92\xA7": "痣",
    "\x92\xA8": "痨",
    "\x92\xA9": "痦",
    "\x92\xAA": "痘",
    "\x92\xAB": "痞",
    "\x92\xAC": "痢",
    "\x92\xAD": "痤",
    "\x92\xAE": "痪",
    "\x92\xAF": "痫",
    "\x92\xB0": "痧",
    "\x92\xB1": "痛",
    "\x92\xB2": "鄌",
    "\x92\xB3": "赓",
    "\x92\xB4": "竦",
    "\x92\xB5": "童",
    "\x92\xB6": "瓿",
    "\x92\xB7": "竣",
    "\x92\xB8": "啻",
    "\x92\xB9": "颏",
    "\x92\xBA": "鹇",
    "\x92\xBB": "阑",
    "\x92\xBC": "阒",
    "\x92\xBD": "阔",
    "\x92\xBE": "阕",
    "\x92\xBF": "善",
    "\x92\xC0": "翔",
    "\x92\xC1": "羡",
    "\x92\xC2": "普",
    "\x92\xC3": "粪",
    "\x92\xC4": "粞",
    "\x92\xC5": "尊",
    "\x92\xC6": "奠",
    "\x92\xC7": "遒",
    "\x92\xC8": "道",
    "\x92\xC9": "遂",
    "\x92\xCA": "孳",
    "\x92\xCB": "曾",
    "\x92\xCC": "焯",
    "\x92\xCD": "焜",
    "\x92\xCE": "焰",
    "\x92\xCF": "焙",
    "\x92\xD0": "焱",
    "\x92\xD1": "鹈",
    "\x92\xD2": "湛",
    "\x92\xD3": "港",
    "\x92\xD4": "渫",
    "\x92\xD5": "滞",
    "\x92\xD6": "湖",
    "\x92\xD7": "湘",
    "\x92\xD8": "渣",
    "\x92\xD9": "渤",
    "\x92\xDA": "湮",
    "\x92\xDB": "湎",
    "\x92\xDC": "湝",
    "\x92\xDD": "湨",
    "\x92\xDE": "湜",
    "\x92\xDF": "渺",
    "\x92\xE0": "湿",
    "\x92\xE1": "温",
    "\x92\xE2": "渴",
    "\x92\xE3": "渭",
    "\x92\xE4": "溃",
    "\x92\xE5": "湍",
    "\x92\xE6": "溅",
    "\x92\xE7": "滑",
    "\x92\xE8": "湃",
    "\x92\xE9": "湫",
    "\x92\xEA": "溲",
    "\x92\xEB": "湟",
    "\x92\xEC": "溆",
    "\x92\xED": "渝",
    "\x92\xEE": "湲",
    "\x92\xEF": "湾",
    "\x92\xF0": "渡",
    "\x92\xF1": "游",
    "\x92\xF2": "溠",
    "\x92\xF3": "溇",
    "\x92\xF4": "湔",
    "\x92\xF5": "滋",
    "\x92\xF6": "湉",
    "\x92\xF7": "渲",
    "\x92\xF8": "溉",
    "\x92\xF9": "渥",
    "\x92\xFA": "湄",
    "\x92\xFB": "滁",
    "\x92\xFC": "愤",
    "\x92\xFD": "慌",
    "\x92\xFE": "惰",
    "\x92\xFF": "愠",
    "\x93\x01": "惺",
    "\x93\x02": "愦",
    "\x93\x03": "愕",
    "\x93\x04": "惴",
    "\x93\x05": "愣",
    "\x93\x06": "愀",
    "\x93\x07": "愎",
    "\x93\x08": "惶",
    "\x93\x09": "愧",
    "\x93\x0A": "愉",
    "\x93\x0B": "愔",
    "\x93\x0C": "慨",
    "\x93\x0D": "喾",
    "\x93\x0E": "割",
    "\x93\x0F": "寒",
    "\x93\x10": "富",
    "\x93\x11": "寓",
    "\x93\x12": "窜",
    "\x93\x13": "窝",
    "\x93\x14": "窖",
    "\x93\x15": "窗",
    "\x93\x16": "窘",
    "\x93\x17": "寐",
    "\x93\x18": "谟",
    "\x93\x19": "扉",
    "\x93\x1A": "遍",
    "\x93\x1B": "棨",
    "\x93\x1C": "雇",
    "\x93\x1D": "扊",
    "\x93\x1E": "裢",
    "\x93\x1F": "裎",
    "\x93\x20": "裣",
    "\x93\x21": "裕",
    "\x93\x22": "裤",
    "\x93\x23": "裥",
    "\x93\x24": "裙",
    "\x93\x25": "祾",
    "\x93\x26": "祺",
    "\x93\x27": "祼",
    "\x93\x28": "谠",
    "\x93\x29": "禅",
    "\x93\x2A": "禄",
    "\x93\x2B": "幂",
    "\x93\x2C": "谡",
    "\x93\x2D": "谢",
    "\x93\x2E": "谣",
    "\x93\x2F": "谤",
    "\x93\x30": "谥",
    "\x93\x31": "谦",
    "\x93\x32": "谧",
    "\x93\x33": "塈",
    "\x93\x34": "遐",
    "\x93\x35": "犀",
    "\x93\x36": "属",
    "\x93\x37": "屡",
    "\x93\x38": "孱",
    "\x93\x39": "弼",
    "\x93\x3A": "强",
    "\x93\x3B": "粥",
    "\x93\x3C": "巽",
    "\x93\x3D": "疏",
    "\x93\x3E": "隔",
    "\x93\x3F": "骘",
    "\x93\x40": "隙",
    "\x93\x41": "隘",
    "\x93\x42": "媒",
    "\x93\x43": "媪",
    "\x93\x44": "絮",
    "\x93\x45": "嫂",
    "\x93\x46": "媛",
    "\x93\x47": "婷",
    "\x93\x48": "媚",
    "\x93\x49": "婿",
    "\x93\x4A": "巯",
    "\x93\x4B": "毵",
    "\x93\x4C": "翚",
    "\x93\x4D": "登",
    "\x93\x4E": "皴",
    "\x93\x4F": "婺",
    "\x93\x50": "骛",
    "\x93\x51": "缂",
    "\x93\x52": "缃",
    "\x93\x53": "缄",
    "\x93\x54": "缅",
    "\x93\x55": "彘",
    "\x93\x56": "缆",
    "\x93\x57": "缇",
    "\x93\x58": "缈",
    "\x93\x59": "缉",
    "\x93\x5A": "缌",
    "\x93\x5B": "缎",
    "\x93\x5C": "缏",
    "\x93\x5D": "缑",
    "\x93\x5E": "缒",
    "\x93\x5F": "缓",
    "\x93\x60": "缔",
    "\x93\x61": "缕",
    "\x93\x62": "骗",
    "\x93\x63": "编",
    "\x93\x64": "缗",
    "\x93\x65": "骙",
    "\x93\x66": "骚",
    "\x93\x67": "缘",
    "\x93\x68": "飨",
    "\x93\x69": "耢",
    "\x93\x6A": "瑟",
    "\x93\x6B": "瑚",
    "\x93\x6C": "鹉",
    "\x93\x6D": "瑁",
    "\x93\x6E": "瑞",
    "\x93\x6F": "瑰",
    "\x93\x70": "瑀",
    "\x93\x71": "瑜",
    "\x93\x72": "瑗",
    "\x93\x73": "瑄",
    "\x93\x74": "瑕",
    "\x93\x75": "遨",
    "\x93\x76": "骜",
    "\x93\x77": "瑙",
    "\x93\x78": "遘",
    "\x93\x79": "韫",
    "\x93\x7A": "魂",
    "\x93\x7B": "髡",
    "\x93\x7C": "肆",
    "\x93\x7D": "摄",
    "\x93\x7E": "摸",
    "\x93\x7F": "填",
    "\x93\x80": "搏",
    "\x93\x81": "塥",
    "\x93\x82": "塬",
    "\x93\x83": "鄢",
    "\x93\x84": "趔",
    "\x93\x85": "趑",
    "\x93\x86": "摅",
    "\x93\x87": "塌",
    "\x93\x88": "摁",
    "\x93\x89": "鼓",
    "\x93\x8A": "摆",
    "\x93\x8B": "赪",
    "\x93\x8C": "携",
    "\x93\x8D": "塮",
    "\x93\x8E": "蜇",
    "\x93\x8F": "搋",
    "\x93\x90": "搬",
    "\x93\x91": "摇",
    "\x93\x92": "搞",
    "\x93\x93": "搪",
    "\x93\x94": "塘",
    "\x93\x95": "搒",
    "\x93\x96": "搐",
    "\x93\x97": "搛",
    "\x93\x98": "搠",
    "\x93\x99": "摈",
    "\x93\x9A": "彀",
    "\x93\x9B": "毂",
    "\x93\x9C": "搌",
    "\x93\x9D": "搦",
    "\x93\x9E": "摊",
    "\x93\x9F": "搡",
    "\x93\xA0": "聘",
    "\x93\xA1": "蓁",
    "\x93\xA2": "戡",
    "\x93\xA3": "斟",
    "\x93\xA4": "蒜",
    "\x93\xA5": "蓍",
    "\x93\xA6": "鄞",
    "\x93\xA7": "勤",
    "\x93\xA8": "靴",
    "\x93\xA9": "靳",
    "\x93\xAA": "靶",
    "\x93\xAB": "鹊",
    "\x93\xAC": "蓐",
    "\x93\xAD": "蓝",
    "\x93\xAE": "墓",
    "\x93\xAF": "幕",
    "\x93\xB0": "蓦",
    "\x93\xB1": "鹋",
    "\x93\xB2": "蒽",
    "\x93\xB3": "蓓",
    "\x93\xB4": "蓖",
    "\x93\xB5": "蓊",
    "\x93\xB6": "蒯",
    "\x93\xB7": "蓟",
    "\x93\xB8": "蓬",
    "\x93\xB9": "蓑",
    "\x93\xBA": "蒿",
    "\x93\xBB": "蒺",
    "\x93\xBC": "蓠",
    "\x93\xBD": "蒟",
    "\x93\xBE": "蒡",
    "\x93\xBF": "蓄",
    "\x93\xC0": "蒹",
    "\x93\xC1": "蒴",
    "\x93\xC2": "蒲",
    "\x93\xC3": "蒗",
    "\x93\xC4": "蓉",
    "\x93\xC5": "蒙",
    "\x93\xC6": "蓂",
    "\x93\xC7": "蓥",
    "\x93\xC8": "颐",
    "\x93\xC9": "蒸",
    "\x93\xCA": "献",
    "\x93\xCB": "蓣",
    "\x93\xCC": "楔",
    "\x93\xCD": "椿",
    "\x93\xCE": "楠",
    "\x93\xCF": "禁",
    "\x93\xD0": "楂",
    "\x93\xD1": "楚",
    "\x93\xD2": "楝",
    "\x93\xD3": "楷",
    "\x93\xD4": "榄",
    "\x93\xD5": "想",
    "\x93\xD6": "楫",
    "\x93\xD7": "榀",
    "\x93\xD8": "楞",
    "\x93\xD9": "楸",
    "\x93\xDA": "椴",
    "\x93\xDB": "槐",
    "\x93\xDC": "槌",
    "\x93\xDD": "楯",
    "\x93\xDE": "榆",
    "\x93\xDF": "榇",
    "\x93\xE0": "榈",
    "\x93\xE1": "槎",
    "\x93\xE2": "楼",
    "\x93\xE3": "榉",
    "\x93\xE4": "楦",
    "\x93\xE5": "概",
    "\x93\xE6": "楣",
    "\x93\xE7": "楹",
    "\x93\xE8": "椽",
    "\x93\xE9": "裘",
    "\x93\xEA": "赖",
    "\x93\xEB": "剽",
    "\x93\xEC": "甄",
    "\x93\xED": "酮",
    "\x93\xEE": "酰",
    "\x93\xEF": "酯",
    "\x93\xF0": "酪",
    "\x93\xF1": "酩",
    "\x93\xF2": "酬",
    "\x93\xF3": "蜃",
    "\x93\xF4": "感",
    "\x93\xF5": "碛",
    "\x93\xF6": "碍",
    "\x93\xF7": "碘",
    "\x93\xF8": "碓",
    "\x93\xF9": "碑",
    "\x93\xFA": "硼",
    "\x93\xFB": "碉",
    "\x93\xFC": "碎",
    "\x93\xFD": "碚",
    "\x93\xFE": "碰",
    "\x93\xFF": "碇",
    "\x94\x01": "碗",
    "\x94\x02": "碌",
    "\x94\x03": "碜",
    "\x94\x04": "鹌",
    "\x94\x05": "尴",
    "\x94\x06": "雷",
    "\x94\x07": "零",
    "\x94\x08": "雾",
    "\x94\x09": "雹",
    "\x94\x0A": "辏",
    "\x94\x0B": "辐",
    "\x94\x0C": "辑",
    "\x94\x0D": "辒",
    "\x94\x0E": "输",
    "\x94\x0F": "督",
    "\x94\x10": "频",
    "\x94\x11": "龃",
    "\x94\x12": "龄",
    "\x94\x13": "龅",
    "\x94\x14": "龆",
    "\x94\x15": "觜",
    "\x94\x16": "訾",
    "\x94\x17": "粲",
    "\x94\x18": "虞",
    "\x94\x19": "鉴",
    "\x94\x1A": "睛",
    "\x94\x1B": "睹",
    "\x94\x1C": "睦",
    "\x94\x1D": "瞄",
    "\x94\x1E": "睚",
    "\x94\x1F": "嗪",
    "\x94\x20": "睫",
    "\x94\x21": "韪",
    "\x94\x22": "嗷",
    "\x94\x23": "嗉",
    "\x94\x24": "睡",
    "\x94\x25": "睨",
    "\x94\x26": "睢",
    "\x94\x27": "雎",
    "\x94\x28": "睥",
    "\x94\x29": "睬",
    "\x94\x2A": "嘟",
    "\x94\x2B": "嗜",
    "\x94\x2C": "嗑",
    "\x94\x2D": "嗫",
    "\x94\x2E": "嗬",
    "\x94\x2F": "嗔",
    "\x94\x30": "鄙",
    "\x94\x31": "嗦",
    "\x94\x32": "嗝",
    "\x94\x33": "愚",
    "\x94\x34": "戥",
    "\x94\x35": "嗄",
    "\x94\x36": "暖",
    "\x94\x37": "盟",
    "\x94\x38": "煦",
    "\x94\x39": "歇",
    "\x94\x3A": "暗",
    "\x94\x3B": "暅",
    "\x94\x3C": "暄",
    "\x94\x3D": "暇",
    "\x94\x3E": "照",
    "\x94\x3F": "遢",
    "\x94\x40": "暌",
    "\x94\x41": "畸",
    "\x94\x42": "跬",
    "\x94\x43": "跨",
    "\x94\x44": "跶",
    "\x94\x45": "跷",
    "\x94\x46": "跸",
    "\x94\x47": "跐",
    "\x94\x48": "跣",
    "\x94\x49": "跹",
    "\x94\x4A": "跳",
    "\x94\x4B": "跺",
    "\x94\x4C": "跪",
    "\x94\x4D": "路",
    "\x94\x4E": "跻",
    "\x94\x4F": "跤",
    "\x94\x50": "跟",
    "\x94\x51": "遣",
    "\x94\x52": "蛸",
    "\x94\x53": "蜈",
    "\x94\x54": "蜎",
    "\x94\x55": "蜗",
    "\x94\x56": "蛾",
    "\x94\x57": "蜊",
    "\x94\x58": "蜍",
    "\x94\x59": "蜉",
    "\x94\x5A": "蜂",
    "\x94\x5B": "蜣",
    "\x94\x5C": "蜕",
    "\x94\x5D": "畹",
    "\x94\x5E": "蛹",
    "\x94\x5F": "嗣",
    "\x94\x60": "嗯",
    "\x94\x61": "嗅",
    "\x94\x62": "嗥",
    "\x94\x63": "嗲",
    "\x94\x64": "嗳",
    "\x94\x65": "嗡",
    "\x94\x66": "嗌",
    "\x94\x67": "嗍",
    "\x94\x68": "嗨",
    "\x94\x69": "嗤",
    "\x94\x6A": "嗵",
    "\x94\x6B": "嗓",
    "\x94\x6C": "署",
    "\x94\x6D": "置",
    "\x94\x6E": "罨",
    "\x94\x6F": "罪",
    "\x94\x70": "罩",
    "\x94\x71": "蜀",
    "\x94\x72": "幌",
    "\x94\x73": "嵊",
    "\x94\x74": "嵩",
    "\x94\x75": "嵴",
    "\x94\x76": "骰",
    "\x94\x77": "锖",
    "\x94\x78": "锗",
    "\x94\x79": "错",
    "\x94\x7A": "锘",
    "\x94\x7B": "锚",
    "\x94\x7C": "锛",
    "\x94\x7D": "锜",
    "\x94\x7E": "锝",
    "\x94\x7F": "锞",
    "\x94\x80": "锟",
    "\x94\x81": "锡",
    "\x94\x82": "锢",
    "\x94\x83": "锣",
    "\x94\x84": "锤",
    "\x94\x85": "锥",
    "\x94\x86": "锦",
    "\x94\x87": "锧",
    "\x94\x88": "锨",
    "\x94\x89": "锪",
    "\x94\x8A": "锫",
    "\x94\x8B": "锩",
    "\x94\x8C": "锬",
    "\x94\x8D": "锭",
    "\x94\x8E": "键",
    "\x94\x8F": "锯",
    "\x94\x90": "锰",
    "\x94\x91": "锱",
    "\x94\x92": "矮",
    "\x94\x93": "雉",
    "\x94\x94": "氲",
    "\x94\x95": "犏",
    "\x94\x96": "辞",
    "\x94\x97": "歃",
    "\x94\x98": "稞",
    "\x94\x99": "稚",
    "\x94\x9A": "稗",
    "\x94\x9B": "稔",
    "\x94\x9C": "稠",
    "\x94\x9D": "颓",
    "\x94\x9E": "愁",
    "\x94\x9F": "筹",
    "\x94\xA0": "筠",
    "\x94\xA1": "筢",
    "\x94\xA2": "筮",
    "\x94\xA3": "筻",
    "\x94\xA4": "筲",
    "\x94\xA5": "筼",
    "\x94\xA6": "筱",
    "\x94\xA7": "签",
    "\x94\xA8": "简",
    "\x94\xA9": "筷",
    "\x94\xAA": "毁",
    "\x94\xAB": "舅",
    "\x94\xAC": "鼠",
    "\x94\xAD": "牒",
    "\x94\xAE": "煲",
    "\x94\xAF": "催",
    "\x94\xB0": "傻",
    "\x94\xB1": "像",
    "\x94\xB2": "躲",
    "\x94\xB3": "鹎",
    "\x94\xB4": "魁",
    "\x94\xB5": "敫",
    "\x94\xB6": "僇",
    "\x94\xB7": "衙",
    "\x94\xB8": "微",
    "\x94\xB9": "徭",
    "\x94\xBA": "愆",
    "\x94\xBB": "艄",
    "\x94\xBC": "觎",
    "\x94\xBD": "毹",
    "\x94\xBE": "愈",
    "\x94\xBF": "遥",
    "\x94\xC0": "貊",
    "\x94\xC1": "貅",
    "\x94\xC2": "貉",
    "\x94\xC3": "颔",
    "\x94\xC4": "腻",
    "\x94\xC5": "腠",
    "\x94\xC6": "腩",
    "\x94\xC7": "腰",
    "\x94\xC8": "腼",
    "\x94\xC9": "腽",
    "\x94\xCA": "腥",
    "\x94\xCB": "腮",
    "\x94\xCC": "腭",
    "\x94\xCD": "腹",
    "\x94\xCE": "腺",
    "\x94\xCF": "腧",
    "\x94\xD0": "鹏",
    "\x94\xD1": "塍",
    "\x94\xD2": "媵",
    "\x94\xD3": "腾",
    "\x94\xD4": "腿",
    "\x94\xD5": "詹",
    "\x94\xD6": "鲅",
    "\x94\xD7": "鲆",
    "\x94\xD8": "鲇",
    "\x94\xD9": "鲈",
    "\x94\xDA": "鲉",
    "\x94\xDB": "鲊",
    "\x94\xDC": "稣",
    "\x94\xDD": "鲋",
    "\x94\xDE": "鲌",
    "\x94\xDF": "鲍",
    "\x94\xE0": "鲏",
    "\x94\xE1": "鲐",
    "\x94\xE2": "肄",
    "\x94\xE3": "猿",
    "\x94\xE4": "颖",
    "\x94\xE5": "鹐",
    "\x94\xE6": "飔",
    "\x94\xE7": "飕",
    "\x94\xE8": "觥",
    "\x94\xE9": "触",
    "\x94\xEA": "解",
    "\x94\xEB": "遛",
    "\x94\xEC": "煞",
    "\x94\xED": "雏",
    "\x94\xEE": "馌",
    "\x94\xEF": "馍",
    "\x94\xF0": "馏",
    "\x94\xF1": "馐",
    "\x94\xF2": "酱",
    "\x94\xF3": "鹑",
    "\x94\xF4": "禀",
    "\x94\xF5": "亶",
    "\x94\xF6": "廒",
    "\x94\xF7": "瘃",
    "\x94\xF8": "痱",
    "\x94\xF9": "痹",
    "\x94\xFA": "痼",
    "\x94\xFB": "廓",
    "\x94\xFC": "痴",
    "\x94\xFD": "痿",
    "\x94\xFE": "瘐",
    "\x94\xFF": "瘁",
    "\x95\x01": "瘅",
    "\x95\x02": "痰",
    "\x95\x03": "瘆",
    "\x95\x04": "廉",
    "\x95\x05": "鄘",
    "\x95\x06": "麂",
    "\x95\x07": "裔",
    "\x95\x08": "靖",
    "\x95\x09": "新",
    "\x95\x0A": "鄣",
    "\x95\x0B": "歆",
    "\x95\x0C": "韵",
    "\x95\x0D": "意",
    "\x95\x0E": "旒",
    "\x95\x0F": "雍",
    "\x95\x10": "阖",
    "\x95\x11": "阗",
    "\x95\x12": "阘",
    "\x95\x13": "阙",
    "\x95\x14": "羧",
    "\x95\x15": "豢",
    "\x95\x16": "誊",
    "\x95\x17": "粳",
    "\x95\x18": "粮",
    "\x95\x19": "数",
    "\x95\x1A": "煎",
    "\x95\x1B": "猷",
    "\x95\x1C": "塑",
    "\x95\x1D": "慈",
    "\x95\x1E": "煤",
    "\x95\x1F": "煳",
    "\x95\x20": "煜",
    "\x95\x21": "煨",
    "\x95\x22": "煅",
    "\x95\x23": "煌",
    "\x95\x24": "煊",
    "\x95\x25": "煸",
    "\x95\x26": "煺",
    "\x95\x27": "滟",
    "\x95\x28": "溱",
    "\x95\x29": "溘",
    "\x95\x2A": "滠",
    "\x95\x2B": "满",
    "\x95\x2C": "漭",
    "\x95\x2D": "漠",
    "\x95\x2E": "滢",
    "\x95\x2F": "滇",
    "\x95\x30": "溥",
    "\x95\x31": "溧",
    "\x95\x32": "溽",
    "\x95\x33": "源",
    "\x95\x34": "滤",
    "\x95\x35": "滥",
    "\x95\x36": "裟",
    "\x95\x37": "溻",
    "\x95\x38": "溷",
    "\x95\x39": "溦",
    "\x95\x3A": "滗",
    "\x95\x3B": "滫",
    "\x95\x3C": "溴",
    "\x95\x3D": "滏",
    "\x95\x3E": "滔",
    "\x95\x3F": "溪",
    "\x95\x40": "滃",
    "\x95\x41": "溜",
    "\x95\x42": "滦",
    "\x95\x43": "漓",
    "\x95\x44": "滚",
    "\x95\x45": "溏",
    "\x95\x46": "滂",
    "\x95\x47": "溢",
    "\x95\x48": "溯",
    "\x95\x49": "滨",
    "\x95\x4A": "溶",
    "\x95\x4B": "滓",
    "\x95\x4C": "溟",
    "\x95\x4D": "滘",
    "\x95\x4E": "溺",
    "\x95\x4F": "滍",
    "\x95\x50": "粱",
    "\x95\x51": "滩",
    "\x95\x52": "滪",
    "\x95\x53": "愫",
    "\x95\x54": "慑",
    "\x95\x55": "慎",
    "\x95\x56": "慥",
    "\x95\x57": "慊",
    "\x95\x58": "誉",
    "\x95\x59": "鲎",
    "\x95\x5A": "塞",
    "\x95\x5B": "骞",
    "\x95\x5C": "寞",
    "\x95\x5D": "窥",
    "\x95\x5E": "窦",
    "\x95\x5F": "窠",
    "\x95\x60": "窣",
    "\x95\x61": "窟",
    "\x95\x62": "寝",
    "\x95\x63": "谨",
    "\x95\x64": "裱",
    "\x95\x65": "褂",
    "\x95\x66": "褚",
    "\x95\x67": "裸",
    "\x95\x68": "裼",
    "\x95\x69": "裨",
    "\x95\x6A": "裾",
    "\x95\x6B": "裰",
    "\x95\x6C": "禊",
    "\x95\x6D": "福",
    "\x95\x6E": "谩",
    "\x95\x6F": "谪",
    "\x95\x70": "谫",
    "\x95\x71": "谬",
    "\x95\x72": "群",
    "\x95\x73": "殿",
    "\x95\x74": "辟",
    "\x95\x75": "障",
    "\x95\x76": "媾",
    "\x95\x77": "嫫",
    "\x95\x78": "媳",
    "\x95\x79": "媲",
    "\x95\x7A": "嫒",
    "\x95\x7B": "嫉",
    "\x95\x7C": "嫌",
    "\x95\x7D": "嫁",
    "\x95\x7E": "嫔",
    "\x95\x7F": "媸",
    "\x95\x80": "叠",
    "\x95\x81": "缙",
    "\x95\x82": "缜",
    "\x95\x83": "缚",
    "\x95\x84": "缛",
    "\x95\x85": "辔",
    "\x95\x86": "缝",
    "\x95\x87": "骝",
    "\x95\x88": "缟",
    "\x95\x89": "缠",
    "\x95\x8A": "缡",
    "\x95\x8B": "缢",
    "\x95\x8C": "缣",
    "\x95\x8D": "缤",
    "\x95\x8E": "骟",
    "\x95\x8F": "剿",
    "\x95\x90": "耥",
    "\x95\x91": "璈",
    "\x95\x92": "静",
    "\x95\x93": "碧",
    "\x95\x94": "瑶",
    "\x95\x95": "璃",
    "\x95\x96": "瑭",
    "\x95\x97": "瑢",
    "\x95\x98": "獒",
    "\x95\x99": "赘",
    "\x95\x9A": "熬",
    "\x95\x9B": "觏",
    "\x95\x9C": "慝",
    "\x95\x9D": "嫠",
    "\x95\x9E": "韬",
    "\x95\x9F": "髦",
    "\x95\xA0": "墈",
    "\x95\xA1": "墙",
    "\x95\xA2": "摽",
    "\x95\xA3": "墟",
    "\x95\xA4": "撇",
    "\x95\xA5": "墁",
    "\x95\xA6": "撂",
    "\x95\xA7": "摞",
    "\x95\xA8": "嘉",
    "\x95\xA9": "摧",
    "\x95\xAA": "撄",
    "\x95\xAB": "赫",
    "\x95\xAC": "截",
    "\x95\xAD": "翥",
    "\x95\xAE": "踅",
    "\x95\xAF": "誓",
    "\x95\xB0": "銎",
    "\x95\xB1": "摭",
    "\x95\xB2": "墉",
    "\x95\xB3": "境",
    "\x95\xB4": "摘",
    "\x95\xB5": "墒",
    "\x95\xB6": "摔",
    "\x95\xB7": "榖",
    "\x95\xB8": "撖",
    "\x95\xB9": "摺",
    "\x95\xBA": "綦",
    "\x95\xBB": "聚",
    "\x95\xBC": "蔫",
    "\x95\xBD": "蔷",
    "\x95\xBE": "靺",
    "\x95\xBF": "靼",
    "\x95\xC0": "鞅",
    "\x95\xC1": "靽",
    "\x95\xC2": "鞁",
    "\x95\xC3": "靿",
    "\x95\xC4": "蔌",
    "\x95\xC5": "蔽",
    "\x95\xC6": "慕",
    "\x95\xC7": "暮",
    "\x95\xC8": "摹",
    "\x95\xC9": "蔓",
    "\x95\xCA": "蔑",
    "\x95\xCB": "甍",
    "\x95\xCC": "蔸",
    "\x95\xCD": "蓰",
    "\x95\xCE": "蔹",
    "\x95\xCF": "蔡",
    "\x95\xD0": "蔗",
    "\x95\xD1": "蔟",
    "\x95\xD2": "蔺",
    "\x95\xD3": "戬",
    "\x95\xD4": "蕖",
    "\x95\xD5": "蔻",
    "\x95\xD6": "蓿",
    "\x95\xD7": "蔼",
    "\x95\xD8": "斡",
    "\x95\xD9": "熙",
    "\x95\xDA": "蔚",
    "\x95\xDB": "鹕",
    "\x95\xDC": "兢",
    "\x95\xDD": "嘏",
    "\x95\xDE": "蓼",
    "\x95\xDF": "榛",
    "\x95\xE0": "榧",
    "\x95\xE1": "模",
    "\x95\xE2": "槚",
    "\x95\xE3": "槛",
    "\x95\xE4": "榻",
    "\x95\xE5": "榫",
    "\x95\xE6": "槜",
    "\x95\xE7": "榭",
    "\x95\xE8": "槔",
    "\x95\xE9": "榴",
    "\x95\xEA": "槁",
    "\x95\xEB": "榜",
    "\x95\xEC": "槟",
    "\x95\xED": "榨",
    "\x95\xEE": "榕",
    "\x95\xEF": "槠",
    "\x95\xF0": "榷",
    "\x95\xF1": "榍",
    "\x95\xF2": "歌",
    "\x95\xF3": "遭",
    "\x95\xF4": "僰",
    "\x95\xF5": "酵",
    "\x95\xF6": "酽",
    "\x95\xF7": "酾",
    "\x95\xF8": "酲",
    "\x95\xF9": "酷",
    "\x95\xFA": "酶",
    "\x95\xFB": "酴",
    "\x95\xFC": "酹",
    "\x95\xFD": "酿",
    "\x95\xFE": "酸",
    "\x95\xFF": "厮",
    "\x96\x01": "碶",
    "\x96\x02": "碡",
    "\x96\x03": "碟",
    "\x96\x04": "碴",
    "\x96\x05": "碱",
    "\x96\x06": "碣",
    "\x96\x07": "碳",
    "\x96\x08": "碲",
    "\x96\x09": "磋",
    "\x96\x0A": "磁",
    "\x96\x0B": "碹",
    "\x96\x0C": "碥",
    "\x96\x0D": "愿",
    "\x96\x0E": "劂",
    "\x96\x0F": "臧",
    "\x96\x10": "豨",
    "\x96\x11": "殡",
    "\x96\x12": "需",
    "\x96\x13": "霆",
    "\x96\x14": "霁",
    "\x96\x15": "辕",
    "\x96\x16": "辖",
    "\x96\x17": "辗",
    "\x96\x18": "蜚",
    "\x96\x19": "裴",
    "\x96\x1A": "翡",
    "\x96\x1B": "雌",
    "\x96\x1C": "龇",
    "\x96\x1D": "龈",
    "\x96\x1E": "睿",
    "\x96\x1F": "弊",
    "\x96\x20": "裳",
    "\x96\x21": "颗",
    "\x96\x22": "夥",
    "\x96\x23": "瞅",
    "\x96\x24": "瞍",
    "\x96\x25": "睽",
    "\x96\x26": "墅",
    "\x96\x27": "嘞",
    "\x96\x28": "嘈",
    "\x96\x29": "嗽",
    "\x96\x2A": "嘌",
    "\x96\x2B": "嘁",
    "\x96\x2C": "嘎",
    "\x96\x2D": "暧",
    "\x96\x2E": "暝",
    "\x96\x2F": "踌",
    "\x96\x30": "踉",
    "\x96\x31": "跽",
    "\x96\x32": "踊",
    "\x96\x33": "蜻",
    "\x96\x34": "蜞",
    "\x96\x35": "蜡",
    "\x96\x36": "蜥",
    "\x96\x37": "蜮",
    "\x96\x38": "蜾",
    "\x96\x39": "蝈",
    "\x96\x3A": "蜴",
    "\x96\x3B": "蝇",
    "\x96\x3C": "蜘",
    "\x96\x3D": "蜱",
    "\x96\x3E": "蜩",
    "\x96\x3F": "蜷",
    "\x96\x40": "蝉",
    "\x96\x41": "蜿",
    "\x96\x42": "螂",
    "\x96\x43": "蜢",
    "\x96\x44": "嘘",
    "\x96\x45": "嘡",
    "\x96\x46": "鹗",
    "\x96\x47": "嘣",
    "\x96\x48": "嘤",
    "\x96\x49": "嘚",
    "\x96\x4A": "嘛",
    "\x96\x4B": "嘀",
    "\x96\x4C": "嗾",
    "\x96\x4D": "嘧",
    "\x96\x4E": "罴",
    "\x96\x4F": "罱",
    "\x96\x50": "幔",
    "\x96\x51": "嶂",
    "\x96\x52": "幛",
    "\x96\x53": "赙",
    "\x96\x54": "罂",
    "\x96\x55": "赚",
    "\x96\x56": "骷",
    "\x96\x57": "骶",
    "\x96\x58": "鹘",
    "\x96\x59": "锲",
    "\x96\x5A": "锴",
    "\x96\x5B": "锶",
    "\x96\x5C": "锷",
    "\x96\x5D": "锸",
    "\x96\x5E": "锹",
    "\x96\x5F": "锻",
    "\x96\x60": "锽",
    "\x96\x61": "锾",
    "\x96\x62": "锵",
    "\x96\x63": "锿",
    "\x96\x64": "镀",
    "\x96\x65": "镁",
    "\x96\x66": "镂",
    "\x96\x67": "镃",
    "\x96\x68": "镄",
    "\x96\x69": "镅",
    "\x96\x6A": "舞",
    "\x96\x6B": "犒",
    "\x96\x6C": "舔",
    "\x96\x6D": "稳",
    "\x96\x6E": "熏",
    "\x96\x6F": "箐",
    "\x96\x70": "箦",
    "\x96\x71": "箧",
    "\x96\x72": "箍",
    "\x96\x73": "箸",
    "\x96\x74": "箨",
    "\x96\x75": "箕",
    "\x96\x76": "箬",
    "\x96\x77": "算",
    "\x96\x78": "箅",
    "\x96\x79": "箩",
    "\x96\x7A": "箪",
    "\x96\x7B": "箔",
    "\x96\x7C": "管",
    "\x96\x7D": "箜",
    "\x96\x7E": "箢",
    "\x96\x7F": "箫",
    "\x96\x80": "箓",
    "\x96\x81": "毓",
    "\x96\x82": "舆",
    "\x96\x83": "僖",
    "\x96\x84": "儆",
    "\x96\x85": "僳",
    "\x96\x86": "僚",
    "\x96\x87": "僭",
    "\x96\x88": "僬",
    "\x96\x89": "劁",
    "\x96\x8A": "僦",
    "\x96\x8B": "僮",
    "\x96\x8C": "僧",
    "\x96\x8D": "鼻",
    "\x96\x8E": "魄",
    "\x96\x8F": "魅",
    "\x96\x90": "魃",
    "\x96\x91": "魆",
    "\x96\x92": "睾",
    "\x96\x93": "艋",
    "\x96\x94": "鄱",
    "\x96\x95": "貌",
    "\x96\x96": "膜",
    "\x96\x97": "膊",
    "\x96\x98": "膈",
    "\x96\x99": "膀",
    "\x96\x9A": "膑",
    "\x96\x9B": "鲑",
    "\x96\x9C": "鲔",
    "\x96\x9D": "鲙",
    "\x96\x9E": "鲚",
    "\x96\x9F": "鲛",
    "\x96\xA0": "鲜",
    "\x96\xA1": "鲟",
    "\x96\xA2": "疑",
    "\x96\xA3": "獐",
    "\x96\xA4": "獍",
    "\x96\xA5": "飗",
    "\x96\xA6": "觫",
    "\x96\xA7": "雒",
    "\x96\xA8": "孵",
    "\x96\xA9": "夤",
    "\x96\xAA": "馑",
    "\x96\xAB": "馒",
    "\x96\xAC": "銮",
    "\x96\xAD": "裹",
    "\x96\xAE": "敲",
    "\x96\xAF": "豪",
    "\x96\xB0": "膏",
    "\x96\xB1": "塾",
    "\x96\xB2": "遮",
    "\x96\xB3": "麽",
    "\x96\xB4": "廙",
    "\x96\xB5": "腐",
    "\x96\xB6": "瘩",
    "\x96\xB7": "瘌",
    "\x96\xB8": "瘗",
    "\x96\xB9": "瘟",
    "\x96\xBA": "瘦",
    "\x96\xBB": "瘊",
    "\x96\xBC": "瘥",
    "\x96\xBD": "瘘",
    "\x96\xBE": "瘙",
    "\x96\xBF": "廖",
    "\x96\xC0": "辣",
    "\x96\xC1": "彰",
    "\x96\xC2": "竭",
    "\x96\xC3": "韶",
    "\x96\xC4": "端",
    "\x96\xC5": "旗",
    "\x96\xC6": "旖",
    "\x96\xC7": "膂",
    "\x96\xC8": "阚",
    "\x96\xC9": "鄯",
    "\x96\xCA": "鲞",
    "\x96\xCB": "精",
    "\x96\xCC": "粼",
    "\x96\xCD": "粹",
    "\x96\xCE": "粽",
    "\x96\xCF": "糁",
    "\x96\xD0": "歉",
    "\x96\xD1": "槊",
    "\x96\xD2": "鹚",
    "\x96\xD3": "熄",
    "\x96\xD4": "熘",
    "\x96\xD5": "熔",
    "\x96\xD6": "煽",
    "\x96\xD7": "熥",
    "\x96\xD8": "潢",
    "\x96\xD9": "潆",
    "\x96\xDA": "潇",
    "\x96\xDB": "漤",
    "\x96\xDC": "漆",
    "\x96\xDD": "漕",
    "\x96\xDE": "漱",
    "\x96\xDF": "漂",
    "\x96\xE0": "滹",
    "\x96\xE1": "漫",
    "\x96\xE2": "漯",
    "\x96\xE3": "漶",
    "\x96\xE4": "潋",
    "\x96\xE5": "潴",
    "\x96\xE6": "漪",
    "\x96\xE7": "漉",
    "\x96\xE8": "漳",
    "\x96\xE9": "滴",
    "\x96\xEA": "漩",
    "\x96\xEB": "漾",
    "\x96\xEC": "演",
    "\x96\xED": "澉",
    "\x96\xEE": "漏",
    "\x96\xEF": "潍",
    "\x96\xF0": "慢",
    "\x96\xF1": "慷",
    "\x96\xF2": "慵",
    "\x96\xF3": "寨",
    "\x96\xF4": "赛",
    "\x96\xF5": "搴",
    "\x96\xF6": "寡",
    "\x96\xF7": "窬",
    "\x96\xF8": "窨",
    "\x96\xF9": "窭",
    "\x96\xFA": "察",
    "\x96\xFB": "蜜",
    "\x96\xFC": "寤",
    "\x96\xFD": "寥",
    "\x96\xFE": "谭",
    "\x96\xFF": "肇",
    "\x97\x01": "綮",
    "\x97\x02": "谮",
    "\x97\x03": "褡",
    "\x97\x04": "褙",
    "\x97\x05": "褐",
    "\x97\x06": "褓",
    "\x97\x07": "褛",
    "\x97\x08": "褊",
    "\x97\x09": "褪",
    "\x97\x0A": "禚",
    "\x97\x0B": "谯",
    "\x97\x0C": "谰",
    "\x97\x0D": "谱",
    "\x97\x0E": "谲",
    "\x97\x0F": "暨",
    "\x97\x10": "屣",
    "\x97\x11": "鹛",
    "\x97\x12": "隧",
    "\x97\x13": "嫣",
    "\x97\x14": "嫱",
    "\x97\x15": "嫩",
    "\x97\x16": "嫖",
    "\x97\x17": "嫦",
    "\x97\x18": "嫚",
    "\x97\x19": "嫘",
    "\x97\x1A": "嫜",
    "\x97\x1B": "嫡",
    "\x97\x1C": "嫪",
    "\x97\x1D": "鼐",
    "\x97\x1E": "翟",
    "\x97\x1F": "翠",
    "\x97\x20": "熊",
    "\x97\x21": "凳",
    "\x97\x22": "瞀",
    "\x97\x23": "鹜",
    "\x97\x24": "骠",
    "\x97\x25": "缥",
    "\x97\x26": "缦",
    "\x97\x27": "缧",
    "\x97\x28": "骡",
    "\x97\x29": "缨",
    "\x97\x2A": "骢",
    "\x97\x2B": "缩",
    "\x97\x2C": "缪",
    "\x97\x2D": "缫",
    "\x97\x2E": "慧",
    "\x97\x2F": "耦",
    "\x97\x30": "耧",
    "\x97\x31": "瑾",
    "\x97\x32": "璜",
    "\x97\x33": "璀",
    "\x97\x34": "璎",
    "\x97\x35": "璁",
    "\x97\x36": "璋",
    "\x97\x37": "璇",
    "\x97\x38": "璆",
    "\x97\x39": "奭",
    "\x97\x3A": "撵",
    "\x97\x3B": "髯",
    "\x97\x3C": "髫",
    "\x97\x3D": "撷",
    "\x97\x3E": "撕",
    "\x97\x3F": "撒",
    "\x97\x40": "撅",
    "\x97\x41": "撩",
    "\x97\x42": "趣",
    "\x97\x43": "趟",
    "\x97\x44": "撑",
    "\x97\x45": "撮",
    "\x97\x46": "撬",
    "\x97\x47": "赭",
    "\x97\x48": "播",
    "\x97\x49": "墦",
    "\x97\x4A": "擒",
    "\x97\x4B": "撸",
    "\x97\x4C": "鋆",
    "\x97\x4D": "墩",
    "\x97\x4E": "撞",
    "\x97\x4F": "撤",
    "\x97\x50": "撙",
    "\x97\x51": "增",
    "\x97\x52": "撺",
    "\x97\x53": "墀",
    "\x97\x54": "撰",
    "\x97\x55": "聩",
    "\x97\x56": "聪",
    "\x97\x57": "觐",
    "\x97\x58": "鞋",
    "\x97\x59": "鞑",
    "\x97\x5A": "蕙",
    "\x97\x5B": "鞒",
    "\x97\x5C": "鞍",
    "\x97\x5D": "蕈",
    "\x97\x5E": "蕨",
    "\x97\x5F": "蕤",
    "\x97\x60": "蕞",
    "\x97\x61": "蕺",
    "\x97\x62": "瞢",
    "\x97\x63": "蕉",
    "\x97\x64": "劐",
    "\x97\x65": "蕃",
    "\x97\x66": "蕲",
    "\x97\x67": "蕰",
    "\x97\x68": "蕊",
    "\x97\x69": "赜",
    "\x97\x6A": "蔬",
    "\x97\x6B": "蕴",
    "\x97\x6C": "鼒",
    "\x97\x6D": "槿",
    "\x97\x6E": "横",
    "\x97\x6F": "樯",
    "\x97\x70": "槽",
    "\x97\x71": "槭",
    "\x97\x72": "樗",
    "\x97\x73": "樘",
    "\x97\x74": "樱",
    "\x97\x75": "樊",
    "\x97\x76": "橡",
    "\x97\x77": "槲",
    "\x97\x78": "樟",
    "\x97\x79": "橄",
    "\x97\x7A": "敷",
    "\x97\x7B": "鹝",
    "\x97\x7C": "豌",
    "\x97\x7D": "飘",
    "\x97\x7E": "醋",
    "\x97\x7F": "醌",
    "\x97\x80": "醇",
    "\x97\x81": "醉",
    "\x97\x82": "醅",
    "\x97\x83": "靥",
    "\x97\x84": "魇",
    "\x97\x85": "餍",
    "\x97\x86": "磕",
    "\x97\x87": "磊",
    "\x97\x88": "磔",
    "\x97\x89": "磙",
    "\x97\x8A": "磅",
    "\x97\x8B": "碾",
    "\x97\x8C": "磉",
    "\x97\x8D": "殣",
    "\x97\x8E": "慭",
    "\x97\x8F": "震",
    "\x97\x90": "霄",
    "\x97\x91": "霉",
    "\x97\x92": "霈",
    "\x97\x93": "辘",
    "\x97\x94": "龉",
    "\x97\x95": "龊",
    "\x97\x96": "觑",
    "\x97\x97": "憋",
    "\x97\x98": "瞌",
    "\x97\x99": "瞒",
    "\x97\x9A": "题",
    "\x97\x9B": "暴",
    "\x97\x9C": "瞎",
    "\x97\x9D": "瞑",
    "\x97\x9E": "嘻",
    "\x97\x9F": "嘭",
    "\x97\xA0": "噎",
    "\x97\xA1": "嘶",
    "\x97\xA2": "噶",
    "\x97\xA3": "嘲",
    "\x97\xA4": "颙",
    "\x97\xA5": "暹",
    "\x97\xA6": "嘹",
    "\x97\xA7": "影",
    "\x97\xA8": "踔",
    "\x97\xA9": "踝",
    "\x97\xAA": "踢",
    "\x97\xAB": "踏",
    "\x97\xAC": "踟",
    "\x97\xAD": "踬",
    "\x97\xAE": "踩",
    "\x97\xAF": "踮",
    "\x97\xB0": "踣",
    "\x97\xB1": "踯",
    "\x97\xB2": "踪",
    "\x97\xB3": "踺",
    "\x97\xB4": "踞",
    "\x97\xB5": "蝽",
    "\x97\xB6": "蝶",
    "\x97\xB7": "蝾",
    "\x97\xB8": "蝴",
    "\x97\xB9": "蝻",
    "\x97\xBA": "蝠",
    "\x97\xBB": "蝰",
    "\x97\xBC": "蝎",
    "\x97\xBD": "蝌",
    "\x97\xBE": "蝮",
    "\x97\xBF": "螋",
    "\x97\xC0": "蝗",
    "\x97\xC1": "蝓",
    "\x97\xC2": "蝣",
    "\x97\xC3": "蝼",
    "\x97\xC4": "蝤",
    "\x97\xC5": "蝙",
    "\x97\xC6": "噗",
    "\x97\xC7": "嘬",
    "\x97\xC8": "颚",
    "\x97\xC9": "嘿",
    "\x97\xCA": "噍",
    "\x97\xCB": "噢",
    "\x97\xCC": "噙",
    "\x97\xCD": "噜",
    "\x97\xCE": "噌",
    "\x97\xCF": "嘱",
    "\x97\xD0": "噀",
    "\x97\xD1": "噔",
    "\x97\xD2": "颛",
    "\x97\xD3": "幞",
    "\x97\xD4": "幡",
    "\x97\xD5": "嶓",
    "\x97\xD6": "幢",
    "\x97\xD7": "嶙",
    "\x97\xD8": "嶝",
    "\x97\xD9": "墨",
    "\x97\xDA": "骺",
    "\x97\xDB": "骼",
    "\x97\xDC": "骸",
    "\x97\xDD": "镊",
    "\x97\xDE": "镆",
    "\x97\xDF": "镇",
    "\x97\xE0": "镈",
    "\x97\xE1": "镉",
    "\x97\xE2": "镋",
    "\x97\xE3": "镌",
    "\x97\xE4": "镍",
    "\x97\xE5": "镎",
    "\x97\xE6": "镏",
    "\x97\xE7": "镐",
    "\x97\xE8": "镑",
    "\x97\xE9": "镒",
    "\x97\xEA": "镓",
    "\x97\xEB": "镔",
    "\x97\xEC": "靠",
    "\x97\xED": "稽",
    "\x97\xEE": "稷",
    "\x97\xEF": "稻",
    "\x97\xF0": "黎",
    "\x97\xF1": "稿",
    "\x97\xF2": "稼",
    "\x97\xF3": "箱",
    "\x97\xF4": "箴",
    "\x97\xF5": "篑",
    "\x97\xF6": "篁",
    "\x97\xF7": "篌",
    "\x97\xF8": "篓",
    "\x97\xF9": "箭",
    "\x97\xFA": "篇",
    "\x97\xFB": "篆",
    "\x97\xFC": "僵",
    "\x97\xFD": "牖",
    "\x97\xFE": "儇",
    "\x97\xFF": "儋",
    "\x98\x01": "躺",
    "\x98\x02": "僻",
    "\x98\x03": "德",
    "\x98\x04": "徵",
    "\x98\x05": "艘",
    "\x98\x06": "磐",
    "\x98\x07": "虢",
    "\x98\x08": "鹞",
    "\x98\x09": "鹟",
    "\x98\x0A": "膝",
    "\x98\x0B": "膘",
    "\x98\x0C": "膛",
    "\x98\x0D": "滕",
    "\x98\x0E": "鲠",
    "\x98\x0F": "鲡",
    "\x98\x10": "鲢",
    "\x98\x11": "鲣",
    "\x98\x12": "鲥",
    "\x98\x13": "鲤",
    "\x98\x14": "鲦",
    "\x98\x15": "鲧",
    "\x98\x16": "鲩",
    "\x98\x17": "鲪",
    "\x98\x18": "鲫",
    "\x98\x19": "鲬",
    "\x98\x1A": "橥",
    "\x98\x1B": "獗",
    "\x98\x1C": "獠",
    "\x98\x1D": "觯",
    "\x98\x1E": "鹠",
    "\x98\x1F": "馓",
    "\x98\x20": "馔",
    "\x98\x21": "熟",
    "\x98\x22": "摩",
    "\x98\x23": "麾",
    "\x98\x24": "褒",
    "\x98\x25": "廛",
    "\x98\x26": "鹡",
    "\x98\x27": "瘛",
    "\x98\x28": "瘼",
    "\x98\x29": "瘪",
    "\x98\x2A": "瘢",
    "\x98\x2B": "瘤",
    "\x98\x2C": "瘠",
    "\x98\x2D": "瘫",
    "\x98\x2E": "齑",
    "\x98\x2F": "凛",
    "\x98\x30": "颜",
    "\x98\x31": "毅",
    "\x98\x32": "羯",
    "\x98\x33": "羰",
    "\x98\x34": "糊",
    "\x98\x35": "糇",
    "\x98\x36": "遴",
    "\x98\x37": "糌",
    "\x98\x38": "糍",
    "\x98\x39": "糈",
    "\x98\x3A": "糅",
    "\x98\x3B": "翦",
    "\x98\x3C": "遵",
    "\x98\x3D": "鹣",
    "\x98\x3E": "熜",
    "\x98\x3F": "熵",
    "\x98\x40": "熠",
    "\x98\x41": "潜",
    "\x98\x42": "澍",
    "\x98\x43": "澎",
    "\x98\x44": "澌",
    "\x98\x45": "潵",
    "\x98\x46": "潮",
    "\x98\x47": "潸",
    "\x98\x48": "潭",
    "\x98\x49": "潦",
    "\x98\x4A": "鲨",
    "\x98\x4B": "潲",
    "\x98\x4C": "鋈",
    "\x98\x4D": "潟",
    "\x98\x4E": "澳",
    "\x98\x4F": "潘",
    "\x98\x50": "潼",
    "\x98\x51": "澈",
    "\x98\x52": "澜",
    "\x98\x53": "潽",
    "\x98\x54": "潺",
    "\x98\x55": "澄",
    "\x98\x56": "潏",
    "\x98\x57": "懂",
    "\x98\x58": "憬",
    "\x98\x59": "憔",
    "\x98\x5A": "懊",
    "\x98\x5B": "憧",
    "\x98\x5C": "憎",
    "\x98\x5D": "寮",
    "\x98\x5E": "窳",
    "\x98\x5F": "额",
    "\x98\x60": "谳",
    "\x98\x61": "翩",
    "\x98\x62": "褥",
    "\x98\x63": "褴",
    "\x98\x64": "褫",
    "\x98\x65": "禤",
    "\x98\x66": "谴",
    "\x98\x67": "鹤",
    "\x98\x68": "谵",
    "\x98\x69": "憨",
    "\x98\x6A": "熨",
    "\x98\x6B": "慰",
    "\x98\x6C": "劈",
    "\x98\x6D": "履",
    "\x98\x6E": "屦",
    "\x98\x6F": "嬉",
    "\x98\x70": "勰",
    "\x98\x71": "戮",
    "\x98\x72": "蝥",
    "\x98\x73": "豫",
    "\x98\x74": "缬",
    "\x98\x75": "缭",
    "\x98\x76": "缮",
    "\x98\x77": "缯",
    "\x98\x78": "骣",
    "\x98\x79": "畿",
    "\x98\x7A": "耩",
    "\x98\x7B": "耨",
    "\x98\x7C": "耪",
    "\x98\x7D": "璞",
    "\x98\x7E": "璟",
    "\x98\x7F": "靛",
    "\x98\x80": "璠",
    "\x98\x81": "璘",
    "\x98\x82": "聱",
    "\x98\x83": "螯",
    "\x98\x84": "髻",
    "\x98\x85": "髭",
    "\x98\x86": "髹",
    "\x98\x87": "擀",
    "\x98\x88": "撼",
    "\x98\x89": "擂",
    "\x98\x8A": "操",
    "\x98\x8B": "熹",
    "\x98\x8C": "甏",
    "\x98\x8D": "擐",
    "\x98\x8E": "擅",
    "\x98\x8F": "擞",
    "\x98\x90": "磬",
    "\x98\x91": "鄹",
    "\x98\x92": "颞",
    "\x98\x93": "蕻",
    "\x98\x94": "鞘",
    "\x98\x95": "燕",
    "\x98\x96": "黇",
    "\x98\x97": "颟",
    "\x98\x98": "薤",
    "\x98\x99": "蕾",
    "\x98\x9A": "薯",
    "\x98\x9B": "薨",
    "\x98\x9C": "薛",
    "\x98\x9D": "薇",
    "\x98\x9E": "檠",
    "\x98\x9F": "擎",
    "\x98\xA0": "薪",
    "\x98\xA1": "薏",
    "\x98\xA2": "蕹",
    "\x98\xA3": "薮",
    "\x98\xA4": "薄",
    "\x98\xA5": "颠",
    "\x98\xA6": "翰",
    "\x98\xA7": "噩",
    "\x98\xA8": "薜",
    "\x98\xA9": "薅",
    "\x98\xAA": "樾",
    "\x98\xAB": "橱",
    "\x98\xAC": "橛",
    "\x98\xAD": "橇",
    "\x98\xAE": "樵",
    "\x98\xAF": "檎",
    "\x98\xB0": "橹",
    "\x98\xB1": "橦",
    "\x98\xB2": "樽",
    "\x98\xB3": "樨",
    "\x98\xB4": "橙",
    "\x98\xB5": "橘",
    "\x98\xB6": "橼",
    "\x98\xB7": "墼",
    "\x98\xB8": "整",
    "\x98\xB9": "橐",
    "\x98\xBA": "融",
    "\x98\xBB": "翮",
    "\x98\xBC": "瓢",
    "\x98\xBD": "醛",
    "\x98\xBE": "醐",
    "\x98\xBF": "醍",
    "\x98\xC0": "醒",
    "\x98\xC1": "醚",
    "\x98\xC2": "醑",
    "\x98\xC3": "觱",
    "\x98\xC4": "磺",
    "\x98\xC5": "磲",
    "\x98\xC6": "赝",
    "\x98\xC7": "飙",
    "\x98\xC8": "殪",
    "\x98\xC9": "霖",
    "\x98\xCA": "霏",
    "\x98\xCB": "霓",
    "\x98\xCC": "霍",
    "\x98\xCD": "霎",
    "\x98\xCE": "錾",
    "\x98\xCF": "辙",
    "\x98\xD0": "辚",
    "\x98\xD1": "臻",
    "\x98\xD2": "冀",
    "\x98\xD3": "餐",
    "\x98\xD4": "遽",
    "\x98\xD5": "氅",
    "\x98\xD6": "瞥",
    "\x98\xD7": "瞟",
    "\x98\xD8": "瞠",
    "\x98\xD9": "瞰",
    "\x98\xDA": "嚄",
    "\x98\xDB": "嚆",
    "\x98\xDC": "噤",
    "\x98\xDD": "暾",
    "\x98\xDE": "曈",
    "\x98\xDF": "蹀",
    "\x98\xE0": "蹅",
    "\x98\xE1": "踶",
    "\x98\xE2": "踹",
    "\x98\xE3": "踵",
    "\x98\xE4": "踽",
    "\x98\xE5": "嘴",
    "\x98\xE6": "踱",
    "\x98\xE7": "蹄",
    "\x98\xE8": "蹉",
    "\x98\xE9": "蹁",
    "\x98\xEA": "蹂",
    "\x98\xEB": "螨",
    "\x98\xEC": "蟒",
    "\x98\xED": "蟆",
    "\x98\xEE": "螈",
    "\x98\xEF": "螅",
    "\x98\xF0": "螭",
    "\x98\xF1": "螗",
    "\x98\xF2": "螃",
    "\x98\xF3": "螠",
    "\x98\xF4": "螟",
    "\x98\xF5": "噱",
    "\x98\xF6": "器",
    "\x98\xF7": "噪",
    "\x98\xF8": "噬",
    "\x98\xF9": "噫",
    "\x98\xFA": "噻",
    "\x98\xFB": "噼",
    "\x98\xFC": "幪",
    "\x98\xFD": "罹",
    "\x98\xFE": "圜",
    "\x98\xFF": "鹦",
    "\x99\x01": "赠",
    "\x99\x02": "默",
    "\x99\x03": "黔",
    "\x99\x04": "镖",
    "\x99\x05": "镗",
    "\x99\x06": "镘",
    "\x99\x07": "镚",
    "\x99\x08": "镛",
    "\x99\x09": "镜",
    "\x99\x0A": "镝",
    "\x99\x0B": "镞",
    "\x99\x0C": "镠",
    "\x99\x0D": "氇",
    "\x99\x0E": "氆",
    "\x99\x0F": "赞",
    "\x99\x10": "憩",
    "\x99\x11": "穑",
    "\x99\x12": "穆",
    "\x99\x13": "穄",
    "\x99\x14": "篝",
    "\x99\x15": "篚",
    "\x99\x16": "篥",
    "\x99\x17": "篮",
    "\x99\x18": "篡",
    "\x99\x19": "簉",
    "\x99\x1A": "篦",
    "\x99\x1B": "篪",
    "\x99\x1C": "篷",
    "\x99\x1D": "篙",
    "\x99\x1E": "篱",
    "\x99\x1F": "盥",
    "\x99\x20": "儒",
    "\x99\x21": "劓",
    "\x99\x22": "翱",
    "\x99\x23": "魉",
    "\x99\x24": "魈",
    "\x99\x25": "邀",
    "\x99\x26": "徼",
    "\x99\x27": "衡",
    "\x99\x28": "歙",
    "\x99\x29": "盦",
    "\x99\x2A": "膨",
    "\x99\x2B": "膪",
    "\x99\x2C": "膳",
    "\x99\x2D": "螣",
    "\x99\x2E": "膦",
    "\x99\x2F": "膙",
    "\x99\x30": "雕",
    "\x99\x31": "鲭",
    "\x99\x32": "鲮",
    "\x99\x33": "鲯",
    "\x99\x34": "鲰",
    "\x99\x35": "鲱",
    "\x99\x36": "鲲",
    "\x99\x37": "鲳",
    "\x99\x38": "鲴",
    "\x99\x39": "鲵",
    "\x99\x3A": "鲷",
    "\x99\x3B": "鲸",
    "\x99\x3C": "鲺",
    "\x99\x3D": "鲹",
    "\x99\x3E": "鲻",
    "\x99\x3F": "獴",
    "\x99\x40": "獭",
    "\x99\x41": "獬",
    "\x99\x42": "邂",
    "\x99\x43": "憝",
    "\x99\x44": "亸",
    "\x99\x45": "鹧",
    "\x99\x46": "磨",
    "\x99\x47": "廨",
    "\x99\x48": "赟",
    "\x99\x49": "癀",
    "\x99\x4A": "瘭",
    "\x99\x4B": "瘰",
    "\x99\x4C": "廪",
    "\x99\x4D": "瘿",
    "\x99\x4E": "瘵",
    "\x99\x4F": "瘴",
    "\x99\x50": "癃",
    "\x99\x51": "瘾",
    "\x99\x52": "瘸",
    "\x99\x53": "瘳",
    "\x99\x54": "斓",
    "\x99\x55": "麇",
    "\x99\x56": "麈",
    "\x99\x57": "凝",
    "\x99\x58": "辨",
    "\x99\x59": "辩",
    "\x99\x5A": "嬴",
    "\x99\x5B": "壅",
    "\x99\x5C": "羲",
    "\x99\x5D": "糙",
    "\x99\x5E": "糗",
    "\x99\x5F": "糖",
    "\x99\x60": "糕",
    "\x99\x61": "甑",
    "\x99\x62": "燎",
    "\x99\x63": "燠",
    "\x99\x64": "燔",
    "\x99\x65": "燃",
    "\x99\x66": "燧",
    "\x99\x67": "燊",
    "\x99\x68": "燏",
    "\x99\x69": "濑",
    "\x99\x6A": "濒",
    "\x99\x6B": "濉",
    "\x99\x6C": "潞",
    "\x99\x6D": "澧",
    "\x99\x6E": "澡",
    "\x99\x6F": "澴",
    "\x99\x70": "激",
    "\x99\x71": "澹",
    "\x99\x72": "澥",
    "\x99\x73": "澶",
    "\x99\x74": "濂",
    "\x99\x75": "澼",
    "\x99\x76": "憷",
    "\x99\x77": "懒",
    "\x99\x78": "憾",
    "\x99\x79": "懈",
    "\x99\x7A": "黉",
    "\x99\x7B": "褰",
    "\x99\x7C": "寰",
    "\x99\x7D": "窸",
    "\x99\x7E": "窿",
    "\x99\x7F": "褶",
    "\x99\x80": "禧",
    "\x99\x81": "壁",
    "\x99\x82": "避",
    "\x99\x83": "嬖",
    "\x99\x84": "犟",
    "\x99\x85": "隰",
    "\x99\x86": "嬗",
    "\x99\x87": "鹨",
    "\x99\x88": "翯",
    "\x99\x89": "颡",
    "\x99\x8A": "缰",
    "\x99\x8B": "缱",
    "\x99\x8C": "缲",
    "\x99\x8D": "缳",
    "\x99\x8E": "缴",
    "\x99\x8F": "璨",
    "\x99\x90": "璩",
    "\x99\x91": "璐",
    "\x99\x92": "璪",
    "\x99\x93": "戴",
    "\x99\x94": "螫",
    "\x99\x95": "擤",
    "\x99\x96": "壕",
    "\x99\x97": "擦",
    "\x99\x98": "觳",
    "\x99\x99": "罄",
    "\x99\x9A": "擢",
    "\x99\x9B": "藉",
    "\x99\x9C": "薹",
    "\x99\x9D": "鞡",
    "\x99\x9E": "鞠",
    "\x99\x9F": "藏",
    "\x99\xA0": "薷",
    "\x99\xA1": "薰",
    "\x99\xA2": "藐",
    "\x99\xA3": "藓",
    "\x99\xA4": "藁",
    "\x99\xA5": "檬",
    "\x99\xA6": "檑",
    "\x99\xA7": "檄",
    "\x99\xA8": "檐",
    "\x99\xA9": "檩",
    "\x99\xAA": "檀",
    "\x99\xAB": "懋",
    "\x99\xAC": "醢",
    "\x99\xAD": "翳",
    "\x99\xAE": "繄",
    "\x99\xAF": "礁",
    "\x99\xB0": "礅",
    "\x99\xB1": "磷",
    "\x99\xB2": "磴",
    "\x99\xB3": "鹩",
    "\x99\xB4": "霜",
    "\x99\xB5": "霞",
    "\x99\xB6": "龋",
    "\x99\xB7": "龌",
    "\x99\xB8": "豳",
    "\x99\xB9": "壑",
    "\x99\xBA": "黻",
    "\x99\xBB": "瞭",
    "\x99\xBC": "瞧",
    "\x99\xBD": "瞬",
    "\x99\xBE": "瞳",
    "\x99\xBF": "瞵",
    "\x99\xC0": "瞩",
    "\x99\xC1": "瞪",
    "\x99\xC2": "嚏",
    "\x99\xC3": "曙",
    "\x99\xC4": "嚅",
    "\x99\xC5": "蹑",
    "\x99\xC6": "蹒",
    "\x99\xC7": "蹋",
    "\x99\xC8": "蹈",
    "\x99\xC9": "蹊",
    "\x99\xCA": "蹓",
    "\x99\xCB": "蹐",
    "\x99\xCC": "蟥",
    "\x99\xCD": "螬",
    "\x99\xCE": "螵",
    "\x99\xCF": "疃",
    "\x99\xD0": "螳",
    "\x99\xD1": "螺",
    "\x99\xD2": "蟋",
    "\x99\xD3": "蟑",
    "\x99\xD4": "蟀",
    "\x99\xD5": "嚎",
    "\x99\xD6": "嚓",
    "\x99\xD7": "羁",
    "\x99\xD8": "罽",
    "\x99\xD9": "罾",
    "\x99\xDA": "嶷",
    "\x99\xDB": "赡",
    "\x99\xDC": "黜",
    "\x99\xDD": "黝",
    "\x99\xDE": "髁",
    "\x99\xDF": "髀",
    "\x99\xE0": "镡",
    "\x99\xE1": "镢",
    "\x99\xE2": "镣",
    "\x99\xE3": "镤",
    "\x99\xE4": "镥",
    "\x99\xE5": "镦",
    "\x99\xE6": "镧",
    "\x99\xE7": "镨",
    "\x99\xE8": "镩",
    "\x99\xE9": "镪",
    "\x99\xEA": "镫",
    "\x99\xEB": "罅",
    "\x99\xEC": "穗",
    "\x99\xED": "黏",
    "\x99\xEE": "魏",
    "\x99\xEF": "簧",
    "\x99\xF0": "簌",
    "\x99\xF1": "篾",
    "\x99\xF2": "簃",
    "\x99\xF3": "篼",
    "\x99\xF4": "簏",
    "\x99\xF5": "簇",
    "\x99\xF6": "簖",
    "\x99\xF7": "簋",
    "\x99\xF8": "繁",
    "\x99\xF9": "鼢",
    "\x99\xFA": "黛",
    "\x99\xFB": "儡",
    "\x99\xFC": "鹪",
    "\x99\xFD": "鼾",
    "\x99\xFE": "皤",
    "\x99\xFF": "魍",
    "\x9A\x01": "徽",
    "\x9A\x02": "艚",
    "\x9A\x03": "龠",
    "\x9A\x04": "爵",
    "\x9A\x05": "繇",
    "\x9A\x06": "貘",
    "\x9A\x07": "邈",
    "\x9A\x08": "貔",
    "\x9A\x09": "臌",
    "\x9A\x0A": "朦",
    "\x9A\x0B": "臊",
    "\x9A\x0C": "膻",
    "\x9A\x0D": "臁",
    "\x9A\x0E": "臆",
    "\x9A\x0F": "臃",
    "\x9A\x10": "鲼",
    "\x9A\x11": "鲽",
    "\x9A\x12": "鲾",
    "\x9A\x13": "鳀",
    "\x9A\x14": "鳁",
    "\x9A\x15": "鳂",
    "\x9A\x16": "鳃",
    "\x9A\x17": "鳄",
    "\x9A\x18": "鳅",
    "\x9A\x19": "鳆",
    "\x9A\x1A": "鳇",
    "\x9A\x1B": "鳈",
    "\x9A\x1C": "鳉",
    "\x9A\x1D": "鳊",
    "\x9A\x1E": "獯",
    "\x9A\x1F": "螽",
    "\x9A\x20": "燮",
    "\x9A\x21": "鹫",
    "\x9A\x22": "襄",
    "\x9A\x23": "糜",
    "\x9A\x24": "縻",
    "\x9A\x25": "膺",
    "\x9A\x26": "癍",
    "\x9A\x27": "癌",
    "\x9A\x28": "麋",
    "\x9A\x29": "辫",
    "\x9A\x2A": "赢",
    "\x9A\x2B": "糟",
    "\x9A\x2C": "糠",
    "\x9A\x2D": "馘",
    "\x9A\x2E": "燥",
    "\x9A\x2F": "懑",
    "\x9A\x30": "濡",
    "\x9A\x31": "濮",
    "\x9A\x32": "濞",
    "\x9A\x33": "濠",
    "\x9A\x34": "濯",
    "\x9A\x35": "懦",
    "\x9A\x36": "豁",
    "\x9A\x37": "蹇",
    "\x9A\x38": "謇",
    "\x9A\x39": "邃",
    "\x9A\x3A": "襕",
    "\x9A\x3B": "襁",
    "\x9A\x3C": "臀",
    "\x9A\x3D": "檗",
    "\x9A\x3E": "甓",
    "\x9A\x3F": "臂",
    "\x9A\x40": "擘",
    "\x9A\x41": "孺",
    "\x9A\x42": "隳",
    "\x9A\x43": "嬷",
    "\x9A\x44": "翼",
    "\x9A\x45": "蟊",
    "\x9A\x46": "鹬",
    "\x9A\x47": "鍪",
    "\x9A\x48": "骤",
    "\x9A\x49": "鏊",
    "\x9A\x4A": "鳌",
    "\x9A\x4B": "鬹",
    "\x9A\x4C": "鬈",
    "\x9A\x4D": "鬃",
    "\x9A\x4E": "瞽",
    "\x9A\x4F": "藕",
    "\x9A\x50": "鞯",
    "\x9A\x51": "鞨",
    "\x9A\x52": "鞭",
    "\x9A\x53": "鞫",
    "\x9A\x54": "鞧",
    "\x9A\x55": "鞣",
    "\x9A\x56": "藜",
    "\x9A\x57": "藠",
    "\x9A\x58": "藤",
    "\x9A\x59": "藩",
    "\x9A\x5A": "鹲",
    "\x9A\x5B": "檫",
    "\x9A\x5C": "檵",
    "\x9A\x5D": "覆",
    "\x9A\x5E": "醪",
    "\x9A\x5F": "蹙",
    "\x9A\x60": "礞",
    "\x9A\x61": "礓",
    "\x9A\x62": "礌",
    "\x9A\x63": "燹",
    "\x9A\x64": "餮",
    "\x9A\x65": "蹩",
    "\x9A\x66": "瞿",
    "\x9A\x67": "瞻",
    "\x9A\x68": "曛",
    "\x9A\x69": "颢",
    "\x9A\x6A": "曜",
    "\x9A\x6B": "躇",
    "\x9A\x6C": "蹦",
    "\x9A\x6D": "鹭",
    "\x9A\x6E": "蹢",
    "\x9A\x6F": "蹜",
    "\x9A\x70": "蟛",
    "\x9A\x71": "蟪",
    "\x9A\x72": "蟠",
    "\x9A\x73": "蟮",
    "\x9A\x74": "嚚",
    "\x9A\x75": "嚣",
    "\x9A\x76": "鹮",
    "\x9A\x77": "黠",
    "\x9A\x78": "黟",
    "\x9A\x79": "髅",
    "\x9A\x7A": "髂",
    "\x9A\x7B": "镬",
    "\x9A\x7C": "镭",
    "\x9A\x7D": "镯",
    "\x9A\x7E": "镰",
    "\x9A\x7F": "镱",
    "\x9A\x80": "馥",
    "\x9A\x81": "簠",
    "\x9A\x82": "簟",
    "\x9A\x83": "簪",
    "\x9A\x84": "簦",
    "\x9A\x85": "鼫",
    "\x9A\x86": "鼬",
    "\x9A\x87": "鼩",
    "\x9A\x88": "雠",
    "\x9A\x89": "艟",
    "\x9A\x8A": "翻",
    "\x9A\x8B": "臑",
    "\x9A\x8C": "鳍",
    "\x9A\x8D": "鳎",
    "\x9A\x8E": "鳏",
    "\x9A\x8F": "鳐",
    "\x9A\x90": "鳑",
    "\x9A\x91": "鹱",
    "\x9A\x92": "鹰",
    "\x9A\x93": "癞",
    "\x9A\x94": "癔",
    "\x9A\x95": "癜",
    "\x9A\x96": "癖",
    "\x9A\x97": "糨",
    "\x9A\x98": "冁",
    "\x9A\x99": "瀑",
    "\x9A\x9A": "瀍",
    "\x9A\x9B": "瀌",
    "\x9A\x9C": "鎏",
    "\x9A\x9D": "懵",
    "\x9A\x9E": "襟",
    "\x9A\x9F": "璧",
    "\x9A\xA0": "戳",
    "\x9A\xA1": "彝",
    "\x9A\xA2": "邋",
    "\x9A\xA3": "鬏",
    "\x9A\xA4": "攉",
    "\x9A\xA5": "攒",
    "\x9A\xA6": "鞲",
    "\x9A\xA7": "鞴",
    "\x9A\xA8": "藿",
    "\x9A\xA9": "蘧",
    "\x9A\xAA": "孽",
    "\x9A\xAB": "蘅",
    "\x9A\xAC": "警",
    "\x9A\xAD": "蘑",
    "\x9A\xAE": "藻",
    "\x9A\xAF": "麓",
    "\x9A\xB0": "攀",
    "\x9A\xB1": "醭",
    "\x9A\xB2": "醮",
    "\x9A\xB3": "醯",
    "\x9A\xB4": "礤",
    "\x9A\xB5": "酃",
    "\x9A\xB6": "霪",
    "\x9A\xB7": "霭",
    "\x9A\xB8": "黼",
    "\x9A\xB9": "鳖",
    "\x9A\xBA": "曝",
    "\x9A\xBB": "嚯",
    "\x9A\xBC": "蹰",
    "\x9A\xBD": "蹶",
    "\x9A\xBE": "蹽",
    "\x9A\xBF": "蹼",
    "\x9A\xC0": "蹯",
    "\x9A\xC1": "蹴",
    "\x9A\xC2": "蹾",
    "\x9A\xC3": "蹲",
    "\x9A\xC4": "蹭",
    "\x9A\xC5": "蹿",
    "\x9A\xC6": "蹬",
    "\x9A\xC7": "蠖",
    "\x9A\xC8": "蠓",
    "\x9A\xC9": "蠋",
    "\x9A\xCA": "蟾",
    "\x9A\xCB": "蠊",
    "\x9A\xCC": "巅",
    "\x9A\xCD": "黢",
    "\x9A\xCE": "髋",
    "\x9A\xCF": "髌",
    "\x9A\xD0": "镲",
    "\x9A\xD1": "籀",
    "\x9A\xD2": "簸",
    "\x9A\xD3": "籁",
    "\x9A\xD4": "簿",
    "\x9A\xD5": "鳘",
    "\x9A\xD6": "齁",
    "\x9A\xD7": "魑",
    "\x9A\xD8": "艨",
    "\x9A\xD9": "鼗",
    "\x9A\xDA": "鳓",
    "\x9A\xDB": "鳔",
    "\x9A\xDC": "鳕",
    "\x9A\xDD": "鳗",
    "\x9A\xDE": "鳙",
    "\x9A\xDF": "鳚",
    "\x9A\xE0": "蟹",
    "\x9A\xE1": "颤",
    "\x9A\xE2": "靡",
    "\x9A\xE3": "癣",
    "\x9A\xE4": "麒",
    "\x9A\xE5": "鏖",
    "\x9A\xE6": "瓣",
    "\x9A\xE7": "蠃",
    "\x9A\xE8": "羸",
    "\x9A\xE9": "羹",
    "\x9A\xEA": "爆",
    "\x9A\xEB": "瀚",
    "\x9A\xEC": "瀣",
    "\x9A\xED": "瀛",
    "\x9A\xEE": "襦",
    "\x9A\xEF": "谶",
    "\x9A\xF0": "襞",
    "\x9A\xF1": "疆",
    "\x9A\xF2": "骥",
    "\x9A\xF3": "缵",
    "\x9A\xF4": "瓒",
    "\x9A\xF5": "鬓",
    "\x9A\xF6": "壤",
    "\x9A\xF7": "攘",
    "\x9A\xF8": "馨",
    "\x9A\xF9": "蘩",
    "\x9A\xFA": "蘖",
    "\x9A\xFB": "蘘",
    "\x9A\xFC": "醵",
    "\x9A\xFD": "醴",
    "\x9A\xFE": "霰",
    "\x9A\xFF": "颥",
    "\x9B\x01": "酆",
    "\x9B\x02": "耀",
    "\x9B\x03": "矍",
    "\x9B\x04": "曦",
    "\x9B\x05": "躁",
    "\x9B\x06": "躅",
    "\x9B\x07": "蠕",
    "\x9B\x08": "鼍",
    "\x9B\x09": "嚼",
    "\x9B\x0A": "嚷",
    "\x9B\x0B": "巍",
    "\x9B\x0C": "巉",
    "\x9B\x0D": "黩",
    "\x9B\x0E": "黥",
    "\x9B\x0F": "镳",
    "\x9B\x10": "镴",
    "\x9B\x11": "黧",
    "\x9B\x12": "籍",
    "\x9B\x13": "纂",
    "\x9B\x14": "鼯",
    "\x9B\x15": "犨",
    "\x9B\x16": "臜",
    "\x9B\x17": "鳜",
    "\x9B\x18": "鳝",
    "\x9B\x19": "鳞",
    "\x9B\x1A": "鳟",
    "\x9B\x1B": "獾",
    "\x9B\x1C": "魔",
    "\x9B\x1D": "糯",
    "\x9B\x1E": "灌",
    "\x9B\x1F": "瀹",
    "\x9B\x20": "瀵",
    "\x9B\x21": "譬",
    "\x9B\x22": "孀",
    "\x9B\x23": "骧",
    "\x9B\x24": "耰",
    "\x9B\x25": "蠢",
    "\x9B\x26": "瓘",
    "\x9B\x27": "鼙",
    "\x9B\x28": "醺",
    "\x9B\x29": "礴",
    "\x9B\x2A": "礳",
    "\x9B\x2B": "霸",
    "\x9B\x2C": "露",
    "\x9B\x2D": "霹",
    "\x9B\x2E": "颦",
    "\x9B\x2F": "曩",
    "\x9B\x30": "躏",
    "\x9B\x31": "黯",
    "\x9B\x32": "髓",
    "\x9B\x33": "鼱",
    "\x9B\x34": "鳡",
    "\x9B\x35": "鳢",
    "\x9B\x36": "癫",
    "\x9B\x37": "麝",
    "\x9B\x38": "赣",
    "\x9B\x39": "夔",
    "\x9B\x3A": "爝",
    "\x9B\x3B": "灏",
    "\x9B\x3C": "禳",
    "\x9B\x3D": "鐾",
    "\x9B\x3E": "羼",
    "\x9B\x3F": "蠡",
    "\x9B\x40": "耲",
    "\x9B\x41": "耱",
    "\x9B\x42": "懿",
    "\x9B\x43": "韂",
    "\x9B\x44": "蘸",
    "\x9B\x45": "鹳",
    "\x9B\x46": "糵",
    "\x9B\x47": "蘼",
    "\x9B\x48": "囊",
    "\x9B\x49": "霾",
    "\x9B\x4A": "氍",
    "\x9B\x4B": "饕",
    "\x9B\x4C": "躔",
    "\x9B\x4D": "躐",
    "\x9B\x4E": "髑",
    "\x9B\x4F": "镵",
    "\x9B\x50": "镶",
    "\x9B\x51": "穰",
    "\x9B\x52": "鳤",
    "\x9B\x53": "瓤",
    "\x9B\x54": "饔",
    "\x9B\x55": "鬻",
    "\x9B\x56": "鬟",
    "\x9B\x57": "趱",
    "\x9B\x58": "攫",
    "\x9B\x59": "攥",
    "\x9B\x5A": "颧",
    "\x9B\x5B": "躜",
    "\x9B\x5C": "罐",
    "\x9B\x5D": "鼹",
    "\x9B\x5E": "鼷",
    "\x9B\x5F": "癯",
    "\x9B\x60": "麟",
    "\x9B\x61": "蠲",
    "\x9B\x62": "矗",
    "\x9B\x63": "蠹",
    "\x9B\x64": "醾",
    "\x9B\x65": "躞",
    "\x9B\x66": "衢",
    "\x9B\x67": "鑫",
    "\x9B\x68": "灞",
    "\x9B\x69": "襻",
    "\x9B\x6A": "纛",
    "\x9B\x6B": "鬣",
    "\x9B\x6C": "攮",
    "\x9B\x6D": "囔",
    "\x9B\x6E": "馕",
    "\x9B\x6F": "戆",
    "\x9B\x70": "蠼",
    "\x9B\x71": "爨",
    "\x9B\x72": "齉"
}
REVERSE_FONT_MAPPING = dict(zip(FONT_MAPPING.values(), FONT_MAPPING.keys()))
CHINESE_CHARSET = "".join(list(FONT_MAPPING.values()))

# the communication is obfuscated using this fine mechanism
def xorarr(data: bytes):
    tbl = [22, 108, 20, 230, 46, 145, 13, 64, 33, 53, 213, 64, 19, 3, 233, 128]
    x = b""
    r = 0
    for byte in data:
        x += bytes([byte ^ tbl[r]])
        r = (r+1) % len(tbl)
    return x


# if this crc was used for communication to AND from the radio, then it
# would be a measure to increase reliability.
# but it's only used towards the radio, so it's for further obfuscation
def calculate_crc16_xmodem(data: bytes):
    poly = 0x1021
    crc = 0x0
    for byte in data:
        crc = crc ^ (byte << 8)
        for i in range(8):
            crc = crc << 1
            if (crc & 0x10000):
                crc = (crc ^ poly) & 0xFFFF
    return crc & 0xFFFF


def _send_command(serport, data: bytes):
    """Send a command to UV-K5 radio"""
    LOG.debug("Sending command (unobfuscated) len=0x%4.4x:\n%s" %
              (len(data), util.hexprint(data)))

    crc = calculate_crc16_xmodem(data)
    data2 = data + struct.pack("<H", crc)

    command = struct.pack(">HBB", 0xabcd, len(data), 0) + \
        xorarr(data2) + \
        struct.pack(">H", 0xdcba)
    if DEBUG_SHOW_OBFUSCATED_COMMANDS:
        LOG.debug("Sending command (obfuscated):\n%s" % util.hexprint(command))
    try:
        result = serport.write(command)
    except Exception:
        raise errors.RadioError("Error writing data to radio")
    return result


def _receive_reply(serport):
    header = serport.read(4)
    if len(header) != 4:
        LOG.warning("Header short read: [%s] len=%i" %
                    (util.hexprint(header), len(header)))
        raise errors.RadioError("Header short read")
    if header[0] != 0xAB or header[1] != 0xCD or header[3] != 0x00:
        LOG.warning("Bad response header: %s len=%i" %
                    (util.hexprint(header), len(header)))
        raise errors.RadioError("Bad response header")

    cmd = serport.read(int(header[2]))
    if len(cmd) != int(header[2]):
        LOG.warning("Body short read: [%s] len=%i" %
                    (util.hexprint(cmd), len(cmd)))
        raise errors.RadioError("Command body short read")

    footer = serport.read(4)

    if len(footer) != 4:
        LOG.warning("Footer short read: [%s] len=%i" %
                    (util.hexprint(footer), len(footer)))
        raise errors.RadioError("Footer short read")

    if footer[2] != 0xDC or footer[3] != 0xBA:
        LOG.debug(
                "Reply before bad response footer (obfuscated)"
                "len=0x%4.4x:\n%s" % (len(cmd), util.hexprint(cmd)))
        LOG.warning("Bad response footer: %s len=%i" %
                    (util.hexprint(footer), len(footer)))
        raise errors.RadioError("Bad response footer")

    if DEBUG_SHOW_OBFUSCATED_COMMANDS:
        LOG.debug("Received reply (obfuscated) len=0x%4.4x:\n%s" %
                  (len(cmd), util.hexprint(cmd)))

    cmd2 = xorarr(cmd)

    LOG.debug("Received reply (unobfuscated) len=0x%4.4x:\n%s" %
              (len(cmd2), util.hexprint(cmd2)))

    return cmd2


def _getstring(data: bytes, begin, maxlen):
    tmplen = min(maxlen+1, len(data))
    s = [data[i] for i in range(begin, tmplen)]
    for key, val in enumerate(s):
        if val < ord(' ') or val > ord('~'):
            break
    return ''.join(chr(x) for x in s[0:key])


def _sayhello(serport):
    hellopacket = b"\x14\x05\x04\x00\x6a\x39\x57\x64"

    tries = 5
    while True:
        LOG.debug("Sending hello packet")
        _send_command(serport, hellopacket)
        o = _receive_reply(serport)
        if (o):
            break
        tries -= 1
        if tries == 0:
            LOG.warning("Failed to initialise radio")
            raise errors.RadioError("Failed to initialize radio")
    firmware = _getstring(o, 4, 16)
    LOG.info("Found firmware: %s" % firmware)
    return firmware


def _readmem(serport, offset, length):
    LOG.debug("Sending readmem offset=0x%4.4x len=0x%4.4x" % (offset, length))

    readmem = b"\x1b\x05\x08\x00" + \
        struct.pack("<HBB", offset, length, 0) + \
        b"\x6a\x39\x57\x64"
    _send_command(serport, readmem)
    o = _receive_reply(serport)
    if DEBUG_SHOW_MEMORY_ACTIONS:
        LOG.debug("readmem Received data len=0x%4.4x:\n%s" %
                  (len(o), util.hexprint(o)))
    return o[8:]


def _writemem(serport, data, offset):
    LOG.debug("Sending writemem offset=0x%4.4x len=0x%4.4x" %
              (offset, len(data)))

    if DEBUG_SHOW_MEMORY_ACTIONS:
        LOG.debug("writemem sent data offset=0x%4.4x len=0x%4.4x:\n%s" %
                  (offset, len(data), util.hexprint(data)))

    dlen = len(data)
    writemem = b"\x1d\x05" + \
        struct.pack("<BBHBB", dlen+8, 0, offset, dlen, 1) + \
        b"\x6a\x39\x57\x64"+data

    _send_command(serport, writemem)
    o = _receive_reply(serport)

    LOG.debug("writemem Received data: %s len=%i" % (util.hexprint(o), len(o)))

    if (o[0] == 0x1e
            and
            o[4] == (offset & 0xff)
            and
            o[5] == (offset >> 8) & 0xff):
        return True
    else:
        LOG.warning("Bad data from writemem")
        raise errors.RadioError("Bad response to writemem")


def _resetradio(serport):
    resetpacket = b"\xdd\x05\x00\x00"
    _send_command(serport, resetpacket)


def do_download(radio):
    serport = radio.pipe
    serport.timeout = 0.5
    status = chirp_common.Status()
    status.cur = 0
    status.max = MEM_SIZE
    status.msg = "Downloading from radio"
    radio.status_fn(status)

    eeprom = b""
    f = _sayhello(serport)
    if f:
        radio.FIRMWARE_VERSION = f
    else:
        raise errors.RadioError('Unable to determine firmware version')

    addr = 0
    while addr < MEM_SIZE:
        o = _readmem(serport, addr, MEM_BLOCK)
        status.cur = addr
        radio.status_fn(status)

        if o and len(o) == MEM_BLOCK:
            eeprom += o
            addr += MEM_BLOCK
        else:
            raise errors.RadioError("Memory download incomplete")

    return memmap.MemoryMapBytes(eeprom)


def do_upload(radio):
    serport = radio.pipe
    serport.timeout = 0.5
    status = chirp_common.Status()
    status.cur = 0
    status.max = PROG_SIZE
    status.msg = "Uploading to radio"
    radio.status_fn(status)

    f = _sayhello(serport)
    if f:
        radio.FIRMWARE_VERSION = f
    else:
        return False

    addr = 0
    while addr < PROG_SIZE:
        o = radio.get_mmap()[addr:addr+MEM_BLOCK]
        _writemem(serport, o, addr)
        status.cur = addr
        radio.status_fn(status)
        if o:
            addr += MEM_BLOCK
        else:
            raise errors.RadioError("Memory upload incomplete")
    status.msg = "Uploaded OK"

    _resetradio(serport)

    return True


def _find_band(nolimits, hz):
    mhz = hz/1000000.0
    if nolimits:
        B = BANDS_NOLIMITS
    else:
        B = BANDS

    # currently the hacked firmware sets band=1 below 50 MHz
    if nolimits and mhz < 50.0:
        return 1

    for a in B:
        if mhz >= B[a][0] and mhz <= B[a][1]:
            return a
    return False


@directory.register
class UVK5Radio(chirp_common.CloneModeRadio):
    """Quansheng UV-K5"""
    VENDOR = "Quansheng"
    MODEL = "UV-K5 (cn)"
    BAUD_RATE = 38400
    NEEDS_COMPAT_SERIAL = False
    FIRMWARE_VERSION = ""
    _expanded_limits = False

    def get_prompts(x=None):
        rp = chirp_common.RadioPrompts()
        rp.experimental = _(
            'This is an experimental driver for the Quansheng UV-K5. '
            'It may harm your radio, or worse. Use at your own risk.\n\n'
            'Before attempting to do any changes please download '
            'the memory image from the radio with chirp '
            'and keep it. This can be later used to recover the '
            'original settings. \n\n'
            'some details are not yet implemented')
        rp.pre_download = _(
            "1. Turn radio on.\n"
            "2. Connect cable to mic/spkr connector.\n"
            "3. Make sure connector is firmly connected.\n"
            "4. Click OK to download image from device.\n\n"
            "It will may not work if you turn on the radio "
            "with the cable already attached\n")
        rp.pre_upload = _(
            "1. Turn radio on.\n"
            "2. Connect cable to mic/spkr connector.\n"
            "3. Make sure connector is firmly connected.\n"
            "4. Click OK to upload the image to device.\n\n"
            "It will may not work if you turn on the radio "
            "with the cable already attached")
        return rp

    # Return information about this radio's features, including
    # how many memories it has, what bands it supports, etc
    def get_features(self):
        rf = chirp_common.RadioFeatures()
        rf.has_bank = False
        rf.valid_dtcs_codes = DTCS_CODES
        rf.has_rx_dtcs = True
        rf.has_ctone = True
        rf.has_settings = True
        rf.has_comment = False
        rf.valid_name_length = 10
        rf.valid_power_levels = UVK5_POWER_LEVELS
        rf.valid_special_chans = list(SPECIALS.keys())
        rf.valid_duplexes = ["", "-", "+", "off"]

        # hack so we can input any frequency,
        # the 0.1 and 0.01 steps don't work unfortunately
        rf.valid_tuning_steps = [0.01, 0.1, 1.0] + STEPS

        rf.valid_tmodes = ["", "Tone", "TSQL", "DTCS", "Cross"]
        rf.valid_cross_modes = ["Tone->Tone", "Tone->DTCS", "DTCS->Tone",
                                "->Tone", "->DTCS", "DTCS->", "DTCS->DTCS"]

        rf.valid_characters = chirp_common.CHARSET_ASCII + CHINESE_CHARSET
        rf.valid_modes = ["FM", "NFM", "AM", "NAM"]
        rf.valid_tmodes = ["", "Tone", "TSQL", "DTCS", "Cross"]

        rf.valid_skips = [""]

        # This radio supports memories 1-200, 201-214 are the VFO memories
        rf.memory_bounds = (1, 200)

        rf.valid_bands = []
        for a in BANDS_NOLIMITS:
            rf.valid_bands.append(
                    (int(BANDS_NOLIMITS[a][0]*1000000),
                     int(BANDS_NOLIMITS[a][1]*1000000)))
        return rf

    # Do a download of the radio from the serial port
    def sync_in(self):
        self._mmap = do_download(self)
        self.process_mmap()

    # Do an upload of the radio to the serial port
    def sync_out(self):
        do_upload(self)

    # Convert the raw byte array into a memory object structure
    def process_mmap(self):
        self._memobj = bitwise.parse(MEM_FORMAT, self._mmap)

    # Return a raw representation of the memory object, which
    # is very helpful for development
    def get_raw_memory(self, number):
        return repr(self._memobj.channel[number-1])

    def validate_memory(self, mem):
        msgs = super().validate_memory(mem)

        if mem.duplex == 'off':
            return msgs

        # find tx frequency
        if mem.duplex == '-':
            txfreq = mem.freq - mem.offset
        elif mem.duplex == '+':
            txfreq = mem.freq + mem.offset
        else:
            txfreq = mem.freq

        # find band
        band = _find_band(self._expanded_limits, txfreq)
        if band is False:
            msg = "Transmit frequency %.4f MHz is not supported by this radio"\
                   % (txfreq/1000000.0)
            msgs.append(chirp_common.ValidationError(msg))

        band = _find_band(self._expanded_limits, mem.freq)
        if band is False:
            msg = "The frequency %.4f MHz is not supported by this radio" \
                   % (mem.freq/1000000.0)
            msgs.append(chirp_common.ValidationError(msg))

        return msgs

    def _set_tone(self, mem, _mem):
        ((txmode, txtone, txpol),
         (rxmode, rxtone, rxpol)) = chirp_common.split_tone_encode(mem)

        if txmode == "Tone":
            txtoval = CTCSS_TONES.index(txtone)
            txmoval = 0b01
        elif txmode == "DTCS":
            txmoval = txpol == "R" and 0b11 or 0b10
            txtoval = DTCS_CODES.index(txtone)
        else:
            txmoval = 0
            txtoval = 0

        if rxmode == "Tone":
            rxtoval = CTCSS_TONES.index(rxtone)
            rxmoval = 0b01
        elif rxmode == "DTCS":
            rxmoval = rxpol == "R" and 0b11 or 0b10
            rxtoval = DTCS_CODES.index(rxtone)
        else:
            rxmoval = 0
            rxtoval = 0

        _mem.rxcodeflag = rxmoval
        _mem.txcodeflag = txmoval
        _mem.unknown1 = 0
        _mem.unknown2 = 0
        _mem.rxcode = rxtoval
        _mem.txcode = txtoval

    def _get_tone(self, mem, _mem):
        rxtype = _mem.rxcodeflag
        txtype = _mem.txcodeflag
        rx_tmode = TMODES[rxtype]
        tx_tmode = TMODES[txtype]

        rx_tone = tx_tone = None

        if tx_tmode == "Tone":
            if _mem.txcode < len(CTCSS_TONES):
                tx_tone = CTCSS_TONES[_mem.txcode]
            else:
                tx_tone = 0
                tx_tmode = ""
        elif tx_tmode == "DTCS":
            if _mem.txcode < len(DTCS_CODES):
                tx_tone = DTCS_CODES[_mem.txcode]
            else:
                tx_tone = 0
                tx_tmode = ""

        if rx_tmode == "Tone":
            if _mem.rxcode < len(CTCSS_TONES):
                rx_tone = CTCSS_TONES[_mem.rxcode]
            else:
                rx_tone = 0
                rx_tmode = ""
        elif rx_tmode == "DTCS":
            if _mem.rxcode < len(DTCS_CODES):
                rx_tone = DTCS_CODES[_mem.rxcode]
            else:
                rx_tone = 0
                rx_tmode = ""

        tx_pol = txtype == 0x03 and "R" or "N"
        rx_pol = rxtype == 0x03 and "R" or "N"

        chirp_common.split_tone_decode(mem, (tx_tmode, tx_tone, tx_pol),
                                       (rx_tmode, rx_tone, rx_pol))

    # Extract a high-level memory object from the low-level memory map
    # This is called to populate a memory in the UI
    def get_memory(self, number2):

        mem = chirp_common.Memory()

        if isinstance(number2, str):
            number = SPECIALS[number2]
            mem.extd_number = number2
        else:
            number = number2 - 1

        mem.number = number + 1

        _mem = self._memobj.channel[number]

        tmpcomment = ""

        is_empty = False
        # We'll consider any blank (i.e. 0 MHz frequency) to be empty
        if (_mem.freq == 0xffffffff) or (_mem.freq == 0):
            is_empty = True

        tmpscn = SCANLIST_LIST[0]

        # We'll also look at the channel attributes if a memory has them
        if number < 200:
            _mem3 = self._memobj.channel_attributes[number]
            # free memory bit
            if _mem3.is_free > 0:
                is_empty = True
            # scanlists
            if _mem3.is_scanlist1 > 0 and _mem3.is_scanlist2 > 0:
                tmpscn = SCANLIST_LIST[3]  # "1+2"
            elif _mem3.is_scanlist1 > 0:
                tmpscn = SCANLIST_LIST[1]  # "1"
            elif _mem3.is_scanlist2 > 0:
                tmpscn = SCANLIST_LIST[2]  # "2"

        if is_empty:
            mem.empty = True
            # set some sane defaults:
            mem.power = UVK5_POWER_LEVELS[2]
            mem.extra = RadioSettingGroup("Extra", "extra")
            rs = RadioSetting(
                "bclo", "BCLO",
                RadioSettingValueBoolean(False))
            mem.extra.append(rs)
            rs = RadioSetting(
                "frev", "FreqRev",
                RadioSettingValueBoolean(False))
            mem.extra.append(rs)
            rs = RadioSetting(
                "pttid", "PTTID",
                RadioSettingValueList(PTTID_LIST, PTTID_LIST[0]))
            mem.extra.append(rs)
            rs = RadioSetting(
                "dtmfdecode", _("DTMF decode"),
                RadioSettingValueBoolean(False))
            mem.extra.append(rs)
            rs = RadioSetting(
                "scrambler", _("Scrambler"),
                RadioSettingValueList(SCRAMBLER_LIST, SCRAMBLER_LIST[0]))
            mem.extra.append(rs)

            rs = RadioSetting(
                "scanlists", _("Scanlists"),
                RadioSettingValueList(SCANLIST_LIST, SCANLIST_LIST[0]))
            mem.extra.append(rs)

            # actually the step and duplex are overwritten by chirp based on
            # bandplan. they are here to document sane defaults for IARU r1
            # mem.tuning_step = 25.0
            # mem.duplex = ""

            return mem

        if number > 199:
            mem.immutable = ["name", "scanlists"]
        else:
            _mem2 = self._memobj.channelname[number]
            last_char = ""
            for char in _mem2.name:
                if last_char != "":
                    two_char = last_char + str(char)
                    mem.name += FONT_MAPPING[two_char]
                    last_char = ""
                    continue

                if str(char) == "\xFF" or str(char) == "\x00":
                    break
                if str(char) in ["\x80", "\x81", "\x82", "\x83", "\x84", "\x85", "\x86", "\x87", "\x88", "\x89", "\x8A", "\x8B", "\x8C", "\x8D", "\x8E", "\x8F", "\x90", "\x91", "\x92", "\x93", "\x94", "\x95", "\x96", "\x97", "\x98", "\x99", "\x9A", "\x9B"]:
                    last_char = str(char)
                    continue
                mem.name += str(char)
            mem.name = mem.name.rstrip()

        # Convert your low-level frequency to Hertz
        mem.freq = int(_mem.freq)*10
        mem.offset = int(_mem.offset)*10

        if (mem.offset == 0):
            mem.duplex = ''
        else:
            if _mem.shift == FLAGS1_OFFSET_MINUS:
                if _mem.freq == _mem.offset:
                    # fake tx disable by setting tx to 0 MHz
                    mem.duplex = 'off'
                    mem.offset = 0
                else:
                    mem.duplex = '-'
            elif _mem.shift == FLAGS1_OFFSET_PLUS:
                mem.duplex = '+'
            else:
                mem.duplex = ''

        # tone data
        self._get_tone(mem, _mem)

        # mode
        if _mem.enable_am > 0:
            if _mem.bandwidth > 0:
                mem.mode = "NAM"
            else:
                mem.mode = "AM"
        else:
            if _mem.bandwidth > 0:
                mem.mode = "NFM"
            else:
                mem.mode = "FM"

        # tuning step
        tstep = _mem.step & 0x7
        if tstep < len(STEPS):
            mem.tuning_step = STEPS[tstep]
        else:
            mem.tuning_step = 2.5

        # power
        if _mem.txpower == POWER_HIGH:
            mem.power = UVK5_POWER_LEVELS[2]
        elif _mem.txpower == POWER_MEDIUM:
            mem.power = UVK5_POWER_LEVELS[1]
        else:
            mem.power = UVK5_POWER_LEVELS[0]

        # We'll consider any blank (i.e. 0 MHz frequency) to be empty
        if (_mem.freq == 0xffffffff) or (_mem.freq == 0):
            mem.empty = True
        else:
            mem.empty = False

        mem.extra = RadioSettingGroup("Extra", "extra")

        # BCLO
        is_bclo = bool(_mem.bclo > 0)
        rs = RadioSetting("bclo", "BCLO", RadioSettingValueBoolean(is_bclo))
        mem.extra.append(rs)
        tmpcomment += "BCLO:"+(is_bclo and "ON" or "off")+" "

        # Frequency reverse - whatever that means, don't see it in the manual
        is_frev = bool(_mem.freq_reverse > 0)
        rs = RadioSetting("frev", "FreqRev", RadioSettingValueBoolean(is_frev))
        mem.extra.append(rs)
        tmpcomment += "FreqReverse:"+(is_frev and "ON" or "off")+" "

        # PTTID
        pttid = _mem.dtmf_pttid
        rs = RadioSetting("pttid", "PTTID", RadioSettingValueList(
            PTTID_LIST, PTTID_LIST[pttid]))
        mem.extra.append(rs)
        tmpcomment += "PTTid:"+PTTID_LIST[pttid]+" "

        # DTMF DECODE
        is_dtmf = bool(_mem.dtmf_decode > 0)
        rs = RadioSetting("dtmfdecode", _("DTMF decode"),
                          RadioSettingValueBoolean(is_dtmf))
        mem.extra.append(rs)
        tmpcomment += "DTMFdecode:"+(is_dtmf and "ON" or "off")+" "

        # Scrambler
        if _mem.scrambler & 0x0f < len(SCRAMBLER_LIST):
            enc = _mem.scrambler & 0x0f
        else:
            enc = 0

        rs = RadioSetting("scrambler", _("Scrambler"), RadioSettingValueList(
            SCRAMBLER_LIST, SCRAMBLER_LIST[enc]))
        mem.extra.append(rs)
        tmpcomment += "Scrambler:"+SCRAMBLER_LIST[enc]+" "

        rs = RadioSetting("scanlists", _("Scanlists"), RadioSettingValueList(
            SCANLIST_LIST, tmpscn))
        mem.extra.append(rs)

        return mem

    def set_settings(self, settings):
        _mem = self._memobj
        for element in settings:
            if not isinstance(element, RadioSetting):
                self.set_settings(element)
                continue

            # basic settings

            # call channel
            if element.get_name() == "call_channel":
                _mem.call_channel = int(element.value)-1

            # squelch
            if element.get_name() == "squelch":
                _mem.squelch = int(element.value)
            # TOT
            if element.get_name() == "tot":
                _mem.max_talk_time = int(element.value)

            # NOAA autoscan
            if element.get_name() == "noaa_autoscan":
                _mem.noaa_autoscan = element.value and 1 or 0

            # VOX switch
            if element.get_name() == "vox_switch":
                _mem.vox_switch = element.value and 1 or 0

            # vox level
            if element.get_name() == "vox_level":
                _mem.vox_level = int(element.value)-1

            # mic gain
            if element.get_name() == "mic_gain":
                _mem.mic_gain = int(element.value)

            # Channel display mode
            if element.get_name() == "channel_display_mode":
                _mem.channel_display_mode = CHANNELDISP_LIST.index(
                    str(element.value))

            # Crossband receiving/transmitting
            if element.get_name() == "crossband":
                _mem.crossband = CROSSBAND_LIST.index(str(element.value))

            # Battery Save
            if element.get_name() == "battery_save":
                _mem.battery_save = BATSAVE_LIST.index(str(element.value))
            # Dual Watch
            if element.get_name() == "dualwatch":
                _mem.dual_watch = DUALWATCH_LIST.index(str(element.value))

            # Backlight auto mode
            if element.get_name() == "backlight_auto_mode":
                _mem.backlight_auto_mode = \
                        BACKLIGHT_LIST.index(str(element.value))

            # Tail tone elimination
            if element.get_name() == "tail_note_elimination":
                _mem.tail_note_elimination = element.value and 1 or 0

            # VFO Open
            if element.get_name() == "vfo_open":
                _mem.vfo_open = element.value and 1 or 0

            # Beep control
            if element.get_name() == "beep_control":
                _mem.beep_control = element.value and 1 or 0

            # Scan resume mode
            if element.get_name() == "scan_resume_mode":
                _mem.scan_resume_mode = SCANRESUME_LIST.index(
                    str(element.value))

            # Keypad lock
            if element.get_name() == "key_lock":
                _mem.key_lock = element.value and 1 or 0

            # Auto keypad lock
            if element.get_name() == "auto_keypad_lock":
                _mem.auto_keypad_lock = element.value and 1 or 0

            # Power on display mode
            if element.get_name() == "welcome_mode":
                _mem.power_on_dispmode = WELCOME_LIST.index(str(element.value))

            # Keypad Tone
            if element.get_name() == "keypad_tone":
                _mem.keypad_tone = KEYPADTONE_LIST.index(str(element.value))

            # Language
            if element.get_name() == "language":
                _mem.language = LANGUAGE_LIST.index(str(element.value))

            # Alarm mode
            if element.get_name() == "alarm_mode":
                _mem.alarm_mode = ALARMMODE_LIST.index(str(element.value))

            # Reminding of end of talk
            if element.get_name() == "reminding_of_end_talk":
                _mem.reminding_of_end_talk = REMENDOFTALK_LIST.index(
                    str(element.value))

            # Repeater tail tone elimination
            if element.get_name() == "repeater_tail_elimination":
                _mem.repeater_tail_elimination = RTE_LIST.index(
                    str(element.value))

            # Logo string 1
            if element.get_name() == "logo1":
                b = str(element.value).rstrip("\x20\xff\x00")+"\x00"*12
                _mem.logo_line1 = b[0:12]+"\x00\xff\xff\xff"

            # Logo string 2
            if element.get_name() == "logo2":
                b = str(element.value).rstrip("\x20\xff\x00")+"\x00"*12
                _mem.logo_line2 = b[0:12]+"\x00\xff\xff\xff"

            # unlock settings

            # FLOCK
            if element.get_name() == "flock":
                _mem.lock.flock = FLOCK_LIST.index(str(element.value))

            # 350TX
            if element.get_name() == "tx350":
                _mem.lock.tx350 = element.value and 1 or 0

            # 200TX
            if element.get_name() == "tx200":
                _mem.lock.tx200 = element.value and 1 or 0

            # 500TX
            if element.get_name() == "tx500":
                _mem.lock.tx500 = element.value and 1 or 0

            # 350EN
            if element.get_name() == "en350":
                _mem.lock.en350 = element.value and 1 or 0

            # SCREN
            if element.get_name() == "enscramble":
                _mem.lock.enscramble = element.value and 1 or 0

            # KILLED
            if element.get_name() == "killed":
                _mem.lock.killed = element.value and 1 or 0

            # fm radio
            for i in range(1, 21):
                freqname = "FM_" + str(i)
                if element.get_name() == freqname:
                    val = str(element.value).strip()
                    try:
                        val2 = int(float(val)*10)
                    except Exception:
                        val2 = 0xffff

                    if val2 < FMMIN*10 or val2 > FMMAX*10:
                        val2 = 0xffff
#                        raise errors.InvalidValueError(
#                                "FM radio frequency should be a value "
#                                "in the range %.1f - %.1f" % (FMMIN , FMMAX))
                    _mem.fmfreq[i-1] = val2

            # dtmf settings
            if element.get_name() == "dtmf_side_tone":
                _mem.dtmf_settings.side_tone = \
                        element.value and 1 or 0

            if element.get_name() == "dtmf_separate_code":
                _mem.dtmf_settings.separate_code = str(element.value)

            if element.get_name() == "dtmf_group_call_code":
                _mem.dtmf_settings.group_call_code = element.value

            if element.get_name() == "dtmf_decode_response":
                _mem.dtmf_settings.decode_response = \
                        DTMF_DECODE_RESPONSE_LIST.index(str(element.value))

            if element.get_name() == "dtmf_auto_reset_time":
                _mem.dtmf_settings.auto_reset_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_preload_time":
                _mem.dtmf_settings.preload_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_first_code_persist_time":
                _mem.dtmf_settings.first_code_persist_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_hash_persist_time":
                _mem.dtmf_settings.hash_persist_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_code_persist_time":
                _mem.dtmf_settings.code_persist_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_code_interval_time":
                _mem.dtmf_settings.code_interval_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_permit_remote_kill":
                _mem.dtmf_settings.permit_remote_kill = \
                        element.value and 1 or 0

            if element.get_name() == "dtmf_dtmf_local_code":
                k = str(element.value).rstrip("\x20\xff\x00") + "\x00"*3
                _mem.dtmf_settings_numbers.dtmf_local_code = k[0:3]

            if element.get_name() == "dtmf_dtmf_up_code":
                k = str(element.value).strip("\x20\xff\x00") + "\x00"*16
                _mem.dtmf_settings_numbers.dtmf_up_code = k[0:16]

            if element.get_name() == "dtmf_dtmf_down_code":
                k = str(element.value).rstrip("\x20\xff\x00") + "\x00"*16
                _mem.dtmf_settings_numbers.dtmf_down_code = k[0:16]

            if element.get_name() == "dtmf_kill_code":
                k = str(element.value).strip("\x20\xff\x00") + "\x00"*5
                _mem.dtmf_settings_numbers.kill_code = k[0:5]

            if element.get_name() == "dtmf_revive_code":
                k = str(element.value).strip("\x20\xff\x00") + "\x00"*5
                _mem.dtmf_settings_numbers.revive_code = k[0:5]

            # dtmf contacts
            for i in range(1, 17):
                varname = "DTMF_" + str(i)
                if element.get_name() == varname:
                    k = str(element.value).rstrip("\x20\xff\x00") + "\x00"*8
                    _mem.dtmfcontact[i-1].name = k[0:8]

                varnumname = "DTMFNUM_" + str(i)
                if element.get_name() == varnumname:
                    k = str(element.value).rstrip("\x20\xff\x00") + "\xff"*3
                    _mem.dtmfcontact[i-1].number = k[0:3]

            # scanlist stuff
            if element.get_name() == "scanlist_default":
                val = (int(element.value) == 2) and 1 or 0
                _mem.scanlist_default = val

            if element.get_name() == "scanlist1_priority_scan":
                _mem.scanlist1_priority_scan = \
                        element.value and 1 or 0

            if element.get_name() == "scanlist2_priority_scan":
                _mem.scanlist2_priority_scan = \
                        element.value and 1 or 0

            if element.get_name() == "scanlist1_priority_ch1" or \
                    element.get_name() == "scanlist1_priority_ch2" or \
                    element.get_name() == "scanlist2_priority_ch1" or \
                    element.get_name() == "scanlist2_priority_ch2":

                val = int(element.value)

                if val > 200 or val < 1:
                    val = 0xff
                else:
                    val -= 1

                if element.get_name() == "scanlist1_priority_ch1":
                    _mem.scanlist1_priority_ch1 = val
                if element.get_name() == "scanlist1_priority_ch2":
                    _mem.scanlist1_priority_ch2 = val
                if element.get_name() == "scanlist2_priority_ch1":
                    _mem.scanlist2_priority_ch1 = val
                if element.get_name() == "scanlist2_priority_ch2":
                    _mem.scanlist2_priority_ch2 = val

            if element.get_name() == "key1_shortpress_action":
                _mem.key1_shortpress_action = KEYACTIONS_LIST.index(
                        str(element.value))

            if element.get_name() == "key1_longpress_action":
                _mem.key1_longpress_action = KEYACTIONS_LIST.index(
                        str(element.value))

            if element.get_name() == "key2_shortpress_action":
                _mem.key2_shortpress_action = KEYACTIONS_LIST.index(
                        str(element.value))

            if element.get_name() == "key2_longpress_action":
                _mem.key2_longpress_action = KEYACTIONS_LIST.index(
                        str(element.value))

            if element.get_name() == "nolimits":
                LOG.warning("User expanded band limits")
                self._expanded_limits = bool(element.value)

    def get_settings(self):
        _mem = self._memobj
        basic = RadioSettingGroup("basic", "Basic Settings")
        keya = RadioSettingGroup("keya", "Programmable keys")
        dtmf = RadioSettingGroup("dtmf", "DTMF Settings")
        dtmfc = RadioSettingGroup("dtmfc", "DTMF Contacts")
        scanl = RadioSettingGroup("scn", "Scan Lists")
        unlock = RadioSettingGroup("unlock", "Unlock Settings")
        fmradio = RadioSettingGroup("fmradio", _("FM Radio"))

        roinfo = RadioSettingGroup("roinfo", _("Driver information"))

        top = RadioSettings(
                basic, keya, dtmf, dtmfc, scanl, unlock, fmradio, roinfo)

        # Programmable keys
        tmpval = int(_mem.key1_shortpress_action)
        if tmpval >= len(KEYACTIONS_LIST):
            tmpval = 0
        rs = RadioSetting("key1_shortpress_action", "Side key 1 short press",
                          RadioSettingValueList(
                              KEYACTIONS_LIST, KEYACTIONS_LIST[tmpval]))
        keya.append(rs)

        tmpval = int(_mem.key1_longpress_action)
        if tmpval >= len(KEYACTIONS_LIST):
            tmpval = 0
        rs = RadioSetting("key1_longpress_action", "Side key 1 long press",
                          RadioSettingValueList(
                              KEYACTIONS_LIST, KEYACTIONS_LIST[tmpval]))
        keya.append(rs)

        tmpval = int(_mem.key2_shortpress_action)
        if tmpval >= len(KEYACTIONS_LIST):
            tmpval = 0
        rs = RadioSetting("key2_shortpress_action", "Side key 2 short press",
                          RadioSettingValueList(
                              KEYACTIONS_LIST, KEYACTIONS_LIST[tmpval]))
        keya.append(rs)

        tmpval = int(_mem.key2_longpress_action)
        if tmpval >= len(KEYACTIONS_LIST):
            tmpval = 0
        rs = RadioSetting("key2_longpress_action", "Side key 2 long press",
                          RadioSettingValueList(
                              KEYACTIONS_LIST, KEYACTIONS_LIST[tmpval]))
        keya.append(rs)

        # DTMF settings
        tmppr = bool(_mem.dtmf_settings.side_tone > 0)
        rs = RadioSetting(
                "dtmf_side_tone",
                "DTMF Sidetone",
                RadioSettingValueBoolean(tmppr))
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings.separate_code)
        if tmpval not in DTMF_CODE_CHARS:
            tmpval = '*'
        val = RadioSettingValueString(1, 1, tmpval)
        val.set_charset(DTMF_CODE_CHARS)
        rs = RadioSetting("dtmf_separate_code", "Separate Code", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings.group_call_code)
        if tmpval not in DTMF_CODE_CHARS:
            tmpval = '#'
        val = RadioSettingValueString(1, 1, tmpval)
        val.set_charset(DTMF_CODE_CHARS)
        rs = RadioSetting("dtmf_group_call_code", "Group Call Code", val)
        dtmf.append(rs)

        tmpval = _mem.dtmf_settings.decode_response
        if tmpval >= len(DTMF_DECODE_RESPONSE_LIST):
            tmpval = 0
        rs = RadioSetting("dtmf_decode_response", "Decode Response",
                          RadioSettingValueList(
                              DTMF_DECODE_RESPONSE_LIST,
                              DTMF_DECODE_RESPONSE_LIST[tmpval]))
        dtmf.append(rs)

        tmpval = _mem.dtmf_settings.auto_reset_time
        if tmpval > 60 or tmpval < 5:
            tmpval = 5
        rs = RadioSetting("dtmf_auto_reset_time",
                          "Auto reset time (s)",
                          RadioSettingValueInteger(5, 60, tmpval))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.preload_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_preload_time",
                          "Pre-load time (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.first_code_persist_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_first_code_persist_time",
                          "First code persist time (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.hash_persist_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_hash_persist_time",
                          "#/* persist time (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.code_persist_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_code_persist_time",
                          "Code persist time (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.code_interval_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_code_interval_time",
                          "Code interval time (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = bool(_mem.dtmf_settings.permit_remote_kill > 0)
        rs = RadioSetting(
                "dtmf_permit_remote_kill",
                "Permit remote kill",
                RadioSettingValueBoolean(tmpval))
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.dtmf_local_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_ID:
                continue
            else:
                tmpval = "103"
                break
        val = RadioSettingValueString(3, 3, tmpval)
        val.set_charset(DTMF_CHARS_ID)
        rs = RadioSetting("dtmf_dtmf_local_code",
                          "Local code (3 chars 0-9 ABCD)", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.dtmf_up_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_UPDOWN or i == "":
                continue
            else:
                tmpval = "123"
                break
        val = RadioSettingValueString(1, 16, tmpval)
        val.set_charset(DTMF_CHARS_UPDOWN)
        rs = RadioSetting("dtmf_dtmf_up_code",
                          "Up code (1-16 chars 0-9 ABCD*#)", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.dtmf_down_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_UPDOWN:
                continue
            else:
                tmpval = "456"
                break
        val = RadioSettingValueString(1, 16, tmpval)
        val.set_charset(DTMF_CHARS_UPDOWN)
        rs = RadioSetting("dtmf_dtmf_down_code",
                          "Down code (1-16 chars 0-9 ABCD*#)", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.kill_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_KILL:
                continue
            else:
                tmpval = "77777"
                break
        if not len(tmpval) == 5:
            tmpval = "77777"
        val = RadioSettingValueString(5, 5, tmpval)
        val.set_charset(DTMF_CHARS_KILL)
        rs = RadioSetting("dtmf_kill_code",
                          "Kill code (5 chars 0-9 ABCD)", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.revive_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_KILL:
                continue
            else:
                tmpval = "88888"
                break
        if not len(tmpval) == 5:
            tmpval = "88888"
        val = RadioSettingValueString(5, 5, tmpval)
        val.set_charset(DTMF_CHARS_KILL)
        rs = RadioSetting("dtmf_revive_code",
                          "Revive code (5 chars 0-9 ABCD)", val)
        dtmf.append(rs)

        val = RadioSettingValueString(0, 80,
                                      "All DTMF Contacts are 3 codes "
                                      "(valid: 0-9 * # ABCD), "
                                      "or an empty string")
        val.set_mutable(False)
        rs = RadioSetting("dtmf_descr1", "DTMF Contacts", val)
        dtmfc.append(rs)

        for i in range(1, 17):
            varname = "DTMF_"+str(i)
            varnumname = "DTMFNUM_"+str(i)
            vardescr = "DTMF Contact "+str(i)+" name"
            varinumdescr = "DTMF Contact "+str(i)+" number"

            cntn = str(_mem.dtmfcontact[i-1].name).strip("\x20\x00\xff")
            cntnum = str(_mem.dtmfcontact[i-1].number).strip("\x20\x00\xff")

            val = RadioSettingValueString(0, 8, cntn)
            rs = RadioSetting(varname, vardescr, val)
            dtmfc.append(rs)

            val = RadioSettingValueString(0, 3, cntnum)
            val.set_charset(DTMF_CHARS)
            rs = RadioSetting(varnumname, varinumdescr, val)
            dtmfc.append(rs)

        # scanlists
        if _mem.scanlist_default == 1:
            tmpsc = 2
        else:
            tmpsc = 1
        rs = RadioSetting("scanlist_default",
                          "Default scanlist",
                          RadioSettingValueInteger(1, 2, tmpsc))
        scanl.append(rs)

        tmppr = bool((_mem.scanlist1_priority_scan & 1) > 0)
        rs = RadioSetting(
                "scanlist1_priority_scan",
                "Scanlist 1 priority channel scan",
                RadioSettingValueBoolean(tmppr))
        scanl.append(rs)

        tmpch = _mem.scanlist1_priority_ch1 + 1
        if tmpch > 200:
            tmpch = 0
        rs = RadioSetting("scanlist1_priority_ch1",
                          "Scanlist 1 priority channel 1 (0 - off)",
                          RadioSettingValueInteger(0, 200, tmpch))
        scanl.append(rs)

        tmpch = _mem.scanlist1_priority_ch2 + 1
        if tmpch > 200:
            tmpch = 0
        rs = RadioSetting("scanlist1_priority_ch2",
                          "Scanlist 1 priority channel 2 (0 - off)",
                          RadioSettingValueInteger(0, 200, tmpch))
        scanl.append(rs)

        tmppr = bool((_mem.scanlist2_priority_scan & 1) > 0)
        rs = RadioSetting(
                "scanlist2_priority_scan",
                "Scanlist 2 priority channel scan",
                RadioSettingValueBoolean(tmppr))
        scanl.append(rs)

        tmpch = _mem.scanlist2_priority_ch1 + 1
        if tmpch > 200:
            tmpch = 0
        rs = RadioSetting("scanlist2_priority_ch1",
                          "Scanlist 2 priority channel 1 (0 - off)",
                          RadioSettingValueInteger(0, 200, tmpch))
        scanl.append(rs)

        tmpch = _mem.scanlist2_priority_ch2 + 1
        if tmpch > 200:
            tmpch = 0
        rs = RadioSetting("scanlist2_priority_ch2",
                          "Scanlist 2 priority channel 2 (0 - off)",
                          RadioSettingValueInteger(0, 200, tmpch))
        scanl.append(rs)

        # basic settings

        # call channel
        tmpc = _mem.call_channel+1
        if tmpc > 200:
            tmpc = 1
        rs = RadioSetting("call_channel", "One key call channel",
                          RadioSettingValueInteger(1, 200, tmpc))
        basic.append(rs)

        # squelch
        tmpsq = _mem.squelch
        if tmpsq > 9:
            tmpsq = 1
        rs = RadioSetting("squelch", "Squelch",
                          RadioSettingValueInteger(0, 9, tmpsq))
        basic.append(rs)

        # TOT
        tmptot = _mem.max_talk_time
        if tmptot > 10:
            tmptot = 10
        rs = RadioSetting(
                "tot",
                "Max talk time [min]",
                RadioSettingValueInteger(0, 10, tmptot))
        basic.append(rs)

        # NOAA autoscan
        rs = RadioSetting(
                "noaa_autoscan",
                "NOAA Autoscan", RadioSettingValueBoolean(
                    bool(_mem.noaa_autoscan > 0)))
        basic.append(rs)

        # VOX switch
        rs = RadioSetting(
                "vox_switch",
                "VOX enabled", RadioSettingValueBoolean(
                    bool(_mem.vox_switch > 0)))
        basic.append(rs)

        # VOX Level
        tmpvox = _mem.vox_level+1
        if tmpvox > 10:
            tmpvox = 10
        rs = RadioSetting("vox_level", "VOX Level",
                          RadioSettingValueInteger(1, 10, tmpvox))
        basic.append(rs)

        # Mic gain
        tmpmicgain = _mem.mic_gain
        if tmpmicgain > 4:
            tmpmicgain = 4
        rs = RadioSetting("mic_gain", "Mic Gain",
                          RadioSettingValueInteger(0, 4, tmpmicgain))
        basic.append(rs)

        # Channel display mode
        tmpchdispmode = _mem.channel_display_mode
        if tmpchdispmode >= len(CHANNELDISP_LIST):
            tmpchdispmode = 0
        rs = RadioSetting(
                "channel_display_mode",
                "Channel display mode",
                RadioSettingValueList(
                    CHANNELDISP_LIST,
                    CHANNELDISP_LIST[tmpchdispmode]))
        basic.append(rs)

        # Crossband receiving/transmitting
        tmpcross = _mem.crossband
        if tmpcross >= len(CROSSBAND_LIST):
            tmpcross = 0
        rs = RadioSetting(
                "crossband",
                "Cross-band receiving/transmitting",
                RadioSettingValueList(
                    CROSSBAND_LIST,
                    CROSSBAND_LIST[tmpcross]))
        basic.append(rs)

        # Battery save
        tmpbatsave = _mem.battery_save
        if tmpbatsave >= len(BATSAVE_LIST):
            tmpbatsave = BATSAVE_LIST.index("1:4")
        rs = RadioSetting(
                "battery_save",
                "Battery Save",
                RadioSettingValueList(
                    BATSAVE_LIST,
                    BATSAVE_LIST[tmpbatsave]))
        basic.append(rs)

        # Dual watch
        tmpdual = _mem.dual_watch
        if tmpdual >= len(DUALWATCH_LIST):
            tmpdual = 0
        rs = RadioSetting("dualwatch", "Dual Watch", RadioSettingValueList(
            DUALWATCH_LIST, DUALWATCH_LIST[tmpdual]))
        basic.append(rs)

        # Backlight auto mode
        tmpback = _mem.backlight_auto_mode
        if tmpback >= len(BACKLIGHT_LIST):
            tmpback = 0
        rs = RadioSetting("backlight_auto_mode",
                          "Backlight auto mode",
                          RadioSettingValueList(
                              BACKLIGHT_LIST,
                              BACKLIGHT_LIST[tmpback]))
        basic.append(rs)

        # Tail tone elimination
        rs = RadioSetting(
                "tail_note_elimination",
                "Tail tone elimination",
                RadioSettingValueBoolean(
                    bool(_mem.tail_note_elimination > 0)))
        basic.append(rs)

        # VFO open
        rs = RadioSetting("vfo_open", "VFO open",
                          RadioSettingValueBoolean(bool(_mem.vfo_open > 0)))
        basic.append(rs)

        # Beep control
        rs = RadioSetting(
                "beep_control",
                "Beep control",
                RadioSettingValueBoolean(bool(_mem.beep_control > 0)))
        basic.append(rs)

        # Scan resume mode
        tmpscanres = _mem.scan_resume_mode
        if tmpscanres >= len(SCANRESUME_LIST):
            tmpscanres = 0
        rs = RadioSetting(
                "scan_resume_mode",
                "Scan resume mode",
                RadioSettingValueList(
                    SCANRESUME_LIST,
                    SCANRESUME_LIST[tmpscanres]))
        basic.append(rs)

        # Keypad locked
        rs = RadioSetting(
                "key_lock",
                "Keypad lock",
                RadioSettingValueBoolean(bool(_mem.key_lock > 0)))
        basic.append(rs)

        # Auto keypad lock
        rs = RadioSetting(
                "auto_keypad_lock",
                "Auto keypad lock",
                RadioSettingValueBoolean(bool(_mem.auto_keypad_lock > 0)))
        basic.append(rs)

        # Power on display mode
        tmpdispmode = _mem.power_on_dispmode
        if tmpdispmode >= len(WELCOME_LIST):
            tmpdispmode = 0
        rs = RadioSetting(
                "welcome_mode",
                "Power on display mode",
                RadioSettingValueList(
                    WELCOME_LIST,
                    WELCOME_LIST[tmpdispmode]))
        basic.append(rs)

        # Keypad Tone
        tmpkeypadtone = _mem.keypad_tone
        if tmpkeypadtone >= len(KEYPADTONE_LIST):
            tmpkeypadtone = 0
        rs = RadioSetting("keypad_tone", "Keypad tone", RadioSettingValueList(
            KEYPADTONE_LIST, KEYPADTONE_LIST[tmpkeypadtone]))
        basic.append(rs)

        # Language
        tmplanguage = _mem.language
        if tmplanguage >= len(LANGUAGE_LIST):
            tmplanguage = 0
        rs = RadioSetting("language", "Language", RadioSettingValueList(
            LANGUAGE_LIST, LANGUAGE_LIST[tmplanguage]))
        basic.append(rs)

        # Alarm mode
        tmpalarmmode = _mem.alarm_mode
        if tmpalarmmode >= len(ALARMMODE_LIST):
            tmpalarmmode = 0
        rs = RadioSetting("alarm_mode", "Alarm mode", RadioSettingValueList(
            ALARMMODE_LIST, ALARMMODE_LIST[tmpalarmmode]))
        basic.append(rs)

        # Reminding of end of talk
        tmpalarmmode = _mem.reminding_of_end_talk
        if tmpalarmmode >= len(REMENDOFTALK_LIST):
            tmpalarmmode = 0
        rs = RadioSetting(
                "reminding_of_end_talk",
                "Reminding of end of talk",
                RadioSettingValueList(
                    REMENDOFTALK_LIST,
                    REMENDOFTALK_LIST[tmpalarmmode]))
        basic.append(rs)

        # Repeater tail tone elimination
        tmprte = _mem.repeater_tail_elimination
        if tmprte >= len(RTE_LIST):
            tmprte = 0
        rs = RadioSetting(
                "repeater_tail_elimination",
                "Repeater tail tone elimination",
                RadioSettingValueList(RTE_LIST, RTE_LIST[tmprte]))
        basic.append(rs)

        # Logo string 1
        logo1 = str(_mem.logo_line1).strip("\x20\x00\xff") + "\x00"
        logo1 = _getstring(logo1.encode('ascii', errors='ignore'), 0, 12)
        rs = RadioSetting("logo1", _("Logo string 1 (12 characters)"),
                          RadioSettingValueString(0, 12, logo1))
        basic.append(rs)

        # Logo string 2
        logo2 = str(_mem.logo_line2).strip("\x20\x00\xff") + "\x00"
        logo2 = _getstring(logo2.encode('ascii', errors='ignore'), 0, 12)
        rs = RadioSetting("logo2", _("Logo string 2 (12 characters)"),
                          RadioSettingValueString(0, 12, logo2))
        basic.append(rs)

        # FM radio
        for i in range(1, 21):
            freqname = "FM_"+str(i)
            fmfreq = _mem.fmfreq[i-1]/10.0
            if fmfreq < FMMIN or fmfreq > FMMAX:
                rs = RadioSetting(freqname, freqname,
                                  RadioSettingValueString(0, 5, ""))
            else:
                rs = RadioSetting(freqname, freqname,
                                  RadioSettingValueString(0, 5, str(fmfreq)))

            fmradio.append(rs)

        # unlock settings

        # F-LOCK
        tmpflock = _mem.lock.flock
        if tmpflock >= len(FLOCK_LIST):
            tmpflock = 0
        rs = RadioSetting(
            "flock", "F-LOCK",
            RadioSettingValueList(FLOCK_LIST, FLOCK_LIST[tmpflock]))
        unlock.append(rs)

        # 350TX
        rs = RadioSetting("tx350", "350TX - unlock 350-400 MHz TX",
                          RadioSettingValueBoolean(
                              bool(_mem.lock.tx350 > 0)))
        unlock.append(rs)

        # Killed
        rs = RadioSetting("Killed", "KILLED Device was disabled (via DTMF)",
                          RadioSettingValueBoolean(
                              bool(_mem.lock.killed > 0)))
        unlock.append(rs)

        # 200TX
        rs = RadioSetting("tx200", "200TX - unlock 174-350 MHz TX",
                          RadioSettingValueBoolean(
                              bool(_mem.lock.tx200 > 0)))
        unlock.append(rs)

        # 500TX
        rs = RadioSetting("tx500", "500TX - unlock 500-600 MHz TX",
                          RadioSettingValueBoolean(
                              bool(_mem.lock.tx500 > 0)))
        unlock.append(rs)

        # 350EN
        rs = RadioSetting("en350", "350EN - unlock 350-400 MHz RX",
                          RadioSettingValueBoolean(
                              bool(_mem.lock.en350 > 0)))
        unlock.append(rs)

        # SCREEN
        rs = RadioSetting("scrambler", "SCREN - scrambler enable",
                          RadioSettingValueBoolean(
                              bool(_mem.lock.enscramble > 0)))
        unlock.append(rs)

        # readonly info
        # Firmware
        if self.FIRMWARE_VERSION == "":
            firmware = "To get the firmware version please download"
            "the image from the radio first"
        else:
            firmware = self.FIRMWARE_VERSION

        val = RadioSettingValueString(0, 128, firmware)
        val.set_mutable(False)
        rs = RadioSetting("fw_ver", "Firmware Version", val)
        roinfo.append(rs)

        # No limits version for hacked firmware
        val = RadioSettingValueBoolean(self._expanded_limits)
        rs = RadioSetting("nolimits", "Limits disabled for modified firmware",
                          val)
        rs.set_warning(_(
            'This should only be enabled if you are using modified firmware '
            'that supports wider frequency coverage. Enabling this will cause '
            'CHIRP not to enforce OEM restrictions and may lead to undefined '
            'or unregulated behavior. Use at your own risk!'),
            safe_value=False)
        roinfo.append(rs)

        return top

    # Store details about a high-level memory to the memory map
    # This is called when a user edits a memory in the UI
    def set_memory(self, mem):
        number = mem.number-1

        # Get a low-level memory object mapped to the image
        _mem = self._memobj.channel[number]
        _mem4 = self._memobj
        # empty memory
        if mem.empty:
            _mem.set_raw("\xFF" * 16)
            if number < 200:
                _mem2 = self._memobj.channelname[number]
                _mem2.set_raw("\xFF" * 16)
                _mem4.channel_attributes[number].is_scanlist1 = 0
                _mem4.channel_attributes[number].is_scanlist2 = 0
                _mem4.channel_attributes[number].unknown1 = 0
                _mem4.channel_attributes[number].unknown2 = 0
                _mem4.channel_attributes[number].is_free = 1
                _mem4.channel_attributes[number].band = 0x7
            return mem

        # clean the channel memory, restore some bits if it was used before
        if _mem.get_raw(asbytes=False)[0] == "\xff":
            # this was an empty memory
            _mem.set_raw("\x00" * 16)
        else:
            # this memory wasn't empty, save some bits that we don't know the
            # meaning of, or that we don't support yet
            prev_0a = _mem.get_raw()[0x0a] & SAVE_MASK_0A
            prev_0b = _mem.get_raw()[0x0b] & SAVE_MASK_0B
            prev_0c = _mem.get_raw()[0x0c] & SAVE_MASK_0C
            prev_0d = _mem.get_raw()[0x0d] & SAVE_MASK_0D
            prev_0e = _mem.get_raw()[0x0e] & SAVE_MASK_0E
            prev_0f = _mem.get_raw()[0x0f] & SAVE_MASK_0F
            _mem.set_raw("\x00" * 10 +
                         chr(prev_0a) + chr(prev_0b) + chr(prev_0c) +
                         chr(prev_0d) + chr(prev_0e) + chr(prev_0f))

        if number < 200:
            _mem4.channel_attributes[number].is_scanlist1 = 0
            _mem4.channel_attributes[number].is_scanlist2 = 0
            _mem4.channel_attributes[number].unknown1 = 0
            _mem4.channel_attributes[number].unknown2 = 0
            _mem4.channel_attributes[number].is_free = 1
            _mem4.channel_attributes[number].band = 0x7

        # find band
        band = _find_band(self, mem.freq)

        # mode
        if mem.mode == "NFM":
            _mem.bandwidth = 1
            _mem.enable_am = 0
        elif mem.mode == "FM":
            _mem.bandwidth = 0
            _mem.enable_am = 0
        elif mem.mode == "NAM":
            _mem.bandwidth = 1
            _mem.enable_am = 1
        elif mem.mode == "AM":
            _mem.bandwidth = 0
            _mem.enable_am = 1

        # frequency/offset
        _mem.freq = mem.freq/10
        _mem.offset = mem.offset/10

        if mem.duplex == "":
            _mem.offset = 0
            _mem.shift = 0
        elif mem.duplex == '-':
            _mem.shift = FLAGS1_OFFSET_MINUS
        elif mem.duplex == '+':
            _mem.shift = FLAGS1_OFFSET_PLUS
        elif mem.duplex == 'off':
            # we fake tx disable by setting the tx freq to 0 MHz
            _mem.shift = FLAGS1_OFFSET_MINUS
            _mem.offset = _mem.freq

        # set band
        if number < 200:
            _mem4.channel_attributes[number].is_free = 0
            _mem4.channel_attributes[number].band = band

        # channels >200 are the 14 VFO chanells and don't have names
        if number < 200:
            _mem2 = self._memobj.channelname[number]
            text = ""
            for str_chat in mem.name:
                if str_chat in chirp_common.CHARSET_ASCII:
                    if len(text) + 1 > 16:
                        break
                    text += str_chat
                elif str_chat in CHINESE_CHARSET:
                    if len(text) + 2 > 16:
                        break
                    reverse_str = REVERSE_FONT_MAPPING[str_chat]
                    text += reverse_str[0]
                    text += reverse_str[1]
            if len(text) < 16:
                text += "\x00" * (16-len(text))
            _mem2.name = text  # Store the alpha tag

        # tone data
        self._set_tone(mem, _mem)

        # step
        _mem.step = STEPS.index(mem.tuning_step)

        # tx power
        if str(mem.power) == str(UVK5_POWER_LEVELS[2]):
            _mem.txpower = POWER_HIGH
        elif str(mem.power) == str(UVK5_POWER_LEVELS[1]):
            _mem.txpower = POWER_MEDIUM
        else:
            _mem.txpower = POWER_LOW

        for setting in mem.extra:
            sname = setting.get_name()
            svalue = setting.value.get_value()

            if sname == "bclo":
                _mem.bclo = svalue and 1 or 0

            if sname == "pttid":
                _mem.dtmf_pttid = PTTID_LIST.index(svalue)

            if sname == "frev":
                _mem.freq_reverse = svalue and 1 or 0

            if sname == "dtmfdecode":
                _mem.dtmf_decode = svalue and 1 or 0

            if sname == "scrambler":
                _mem.scrambler = (
                    _mem.scrambler & 0xf0) | SCRAMBLER_LIST.index(svalue)

            if number < 200 and sname == "scanlists":
                if svalue == "1":
                    _mem4.channel_attributes[number].is_scanlist1 = 1
                    _mem4.channel_attributes[number].is_scanlist2 = 0
                elif svalue == "2":
                    _mem4.channel_attributes[number].is_scanlist1 = 0
                    _mem4.channel_attributes[number].is_scanlist2 = 1
                elif svalue == "1+2":
                    _mem4.channel_attributes[number].is_scanlist1 = 1
                    _mem4.channel_attributes[number].is_scanlist2 = 1
                else:
                    _mem4.channel_attributes[number].is_scanlist1 = 0
                    _mem4.channel_attributes[number].is_scanlist2 = 0

        return mem


@directory.register
class RA79Radio(UVK5Radio):
    """Retevis RA79"""
    VENDOR = "Retevis"
    MODEL = "RA79"
